Autodesk.AutoCAD.DatabaseServices.DgnReference
Reserved for future use.

Autodesk.AutoCAD.DatabaseServices.DgnReference.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.DgnReference.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DgnReference.{dtor}
