Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes
The setting of the object snap mode.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes.ModeNear
Nearest.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes.ModeTangent
Tangent.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes.ModePerpendicular
Perpendicular.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes.ModeIns
Insertion.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes.ModeQuad
Quadrant.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes.ModeNode
Node.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes.ModeCenter
Center.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes.ModeMid
Midpoint.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes.ModeEnd
Endpoint.