Autodesk.AutoCAD.Geometry.Curve2d
Abstract base class for all 2D curves. Any class that is derived from this class represents a 2D curve.

Autodesk.AutoCAD.Geometry.Curve2d.EndPoint
Gets end point of curve.

Autodesk.AutoCAD.Geometry.Curve2d.StartPoint
Gets start point of curve.

Autodesk.AutoCAD.Geometry.Curve2d.HasEndPoint
Gets true if curve has an endpoint.

Autodesk.AutoCAD.Geometry.Curve2d.HasStartPoint
Gets true if curve has an startpoint.

Autodesk.AutoCAD.Geometry.Curve2d.OrthoBoundBlock
Gets the bounding box of the curve. The sides of the returned box are parallel to the coordinate axes.

Autodesk.AutoCAD.Geometry.Curve2d.BoundBlock
Gets the bounding box of the specified sub-interval of the curve. The sides of the returned box are parallel to the coordinate axes.

Autodesk.AutoCAD.Geometry.Curve2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Curve2d.GetInterval
Returns the parametric range of the curve.
Returns: Parametric interval on which this curve is defined.

Autodesk.AutoCAD.Geometry.Curve2d.SetInterval(Autodesk.AutoCAD.Geometry.Interval)
Sets the domain of the curve to the input interval.
value: Interval.

Autodesk.AutoCAD.Geometry.Curve2d.GetReverseParameterCurve
Reverses the parametric direction of the curve. The point set of the curve is unchanged, but the direction of the curve is reversed.
Returns: The reversed curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Curve2d)
Returns the distance between the closest points between this curve and the input curve.This method calls Curve2d.GetDistanceTo(Curve2d curve, Tolerance tolerance) with tolerance set to Global.
curve: Any 2D curve.
Returns: The distance between the closest points between this curve and the input curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the distance between the closest points between this curve and the input curve.
curve: Any 2D curve.
tolerance: Tolerance.
Returns: The distance between the closest points between this curve and the input curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Point2d)
Returns the distance between the input point and the closest point on this curve.This method calls Curve2d.GetDistanceTo(Point2d point, Tolerance tolerance) with tolerance set to Global.
point: Any 2D point.
Returns: The distance between the input point and the closest point on this curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the distance between the input point and the closest point on this curve.
point: Any 2D point.
tolerance: Tolerance.
Returns: The distance between the input point and the closest point on this curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Curve2d)
Finds the closest points between this curve and the input curve.This method calls Curve2d.GetClosestPointTo(Curve2d curve, Tolerance tolerance) with tolerance set to Global.
curve: Any 2D curve.
Returns: The closest points between this curve and the input curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the closest points between this curve and the input curve.
curve: Any 2D curve.
tolerance: Tolerance.
Returns: The closest points between this curve and the input curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point2d)
Finds the closest point on this curve to the input point.This method calls Curve2d.GetClosestPointTo(Point2d point, Tolerance tolerance) with tolerance set to Global.
point: Any 2D point.
Returns: The closest point on this curve to the input point.

Autodesk.AutoCAD.Geometry.Curve2d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the closest point on this curve to the input point.
point: Any 2D point.
tolerance: Tolerance.
Returns: The closest point on this curve to the input point.

Autodesk.AutoCAD.Geometry.Curve2d.GetNormalPoint(Autodesk.AutoCAD.Geometry.Point2d)
Finds the point on the input curve whose normal passes through the input point.This method calls Curve2d.GetNormalPoint(Point2d point, Tolerance tolerance) with tolerance set to Global.
point: Any 2D point.
Returns: The point on the input curve whose normal passes through the input point.

Autodesk.AutoCAD.Geometry.Curve2d.GetNormalPoint(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the point on the input curve whose normal passes through the input point.
point: Any 2D point.
tolerance: Tolerance.
Returns: The point on the input curve whose normal passes through the input point.

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(System.Double)
Determines if input parameter value is within valid parametric range of curve.This method calls Curve2d.IsOn(Double parameter, Tolerance tolerance) with tolerance set to Global.
parameter: Parameter value.
Returns: true if input parameter value is within valid parametric range of curve.

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if input parameter value is within valid parametric range of curve.
parameter: Parameter value.
tolerance: Tolerance.
Returns: true if input parameter value is within valid parametric range of curve.

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d,System.Double@)
Determines if point lies on curve.This method calls Curve2d.IsOn(Point2d point, Double value, Tolerance tolerance) with tolerance set to Global.
point: Any 2D point.
value: Parameter value of point if pnt lies on curve.
Returns: true if point lies on curve.

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d,System.Double@,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if point lies on curve.
point: Any 2D point.
value: Parameter value of point if pnt lies on curve.
tolerance: Tolerance.
Returns: true if point lies on curve.

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d)
Determines if point lies on curve.This method calls Curve2d.IsOn(Point2d point,Tolerance tolerance) with tolerance set to Global.
point: Any 2D point.
Returns: true if point lies on curve.

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if point lies on curve.
point: Any 2D point.
tolerance: Tolerance.
Returns: true if point lies on curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetParameterOf(Autodesk.AutoCAD.Geometry.Point2d)
Returns the parameter value of point. This function assumes that point lies on the curve and does not verify this. If point does not lie on the curve, this method returns unpredictable results.This method calls Curve2d.GetParameterOf(Point2d point, Tolerance tolerance) with tolerance set to Global.
point: Point on the curve.
Returns: The parameter value of point.

Autodesk.AutoCAD.Geometry.Curve2d.GetParameterOf(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the parameter value of point. This function assumes that point lies on the curve and does not verify this. If point does not lie on the curve, this method returns unpredictable results.
point: Point on the curve.
tolerance: Tolerance.
Returns: The parameter value of point.

Autodesk.AutoCAD.Geometry.Curve2d.GetTrimmedOffset(System.Double,Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType)
Returns one or more offset curves that represent the trimmed offset of the curve.This method calls Curve2d.GetTrimmedOffset(Double distance, OffsetCurveExtensionType extensionType, Tolerance tolerance) with tolerance set to Global.
distance: Point on the curve.
extensionType: Determines how offset curve will be extended at points of C1 discontinuity.
Returns: List of offset curves.

Autodesk.AutoCAD.Geometry.Curve2d.GetTrimmedOffset(System.Double,Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType,Autodesk.AutoCAD.Geometry.Tolerance)
Returns one or more offset curves that represent the trimmed offset of the curve.
distance: Offset distance.
extensionType: Determines how offset curve will be extended at points of C1 discontinuity.
tolerance: Tolerance.
Returns: List of offset curves.

Autodesk.AutoCAD.Geometry.Curve2d.IsClosed
Determines if start point and endpoint of curve are the same.This method calls Curve2d.IsClosed(Tolerance tolerance) with tolerance set to Global.
Returns: true if start point and endpoint of curve are the same.

Autodesk.AutoCAD.Geometry.Curve2d.IsClosed(Autodesk.AutoCAD.Geometry.Tolerance)
Determines if start point and endpoint of curve are the same.
tolerance: Tolerance.
Returns: true if start point and endpoint of curve are the same.

Autodesk.AutoCAD.Geometry.Curve2d.IsPeriodic(System.Double@)
Determines if the curve is periodic. The curve is periodic if and only if it is closed and the two points EvaluatePoint(t) and EvaluatePoint(t+period) are always the same point for all values of t.
period: Point on the curve.
Returns: true if the curve is periodic.

Autodesk.AutoCAD.Geometry.Curve2d.IsLinear(Autodesk.AutoCAD.Geometry.Line2d@)
Determines if curve is linear.This method calls Curve2d.IsLinear(Line2d line, Tolerance tolerance) with tolerance set to Global.
line: Line on which this curve lies if it is linear.
Returns: true if curve is linear.

Autodesk.AutoCAD.Geometry.Curve2d.IsLinear(Autodesk.AutoCAD.Geometry.Line2d@,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is linear.
line: Line on which this curve lies if it is linear.
tolerance: Tolerance.
Returns: true if curve is linear.

Autodesk.AutoCAD.Geometry.Curve2d.GetLength(System.Double,System.Double)
Returns the arc length of the curve between the two parameter values.This method calls Curve2d.GetLength(Double fromParameter, Double toParameter, Tolerance tolerance) with tolerance set to Global.
fromParameter: First parameter value.
toParameter: Second parameter value.
Returns: The arc length of the curve between the two parameter values.

Autodesk.AutoCAD.Geometry.Curve2d.GetLength(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the arc length of the curve between the two parameter values.
fromParameter: First parameter value.
toParameter: Second parameter value.
tolerance: Tolerance.
Returns: The arc length of the curve between the two parameter values.

Autodesk.AutoCAD.Geometry.Curve2d.GetParameterAtLength(System.Double,System.Double,System.Boolean)
Returns the parameter value of the point whose arc length distance (from the point with parameter value datumParameter) is the input length.This method calls Curve2d.GetParameterAtLength(Double datumParameter, Double length, Boolean parameterDirection, Tolerance tolerance) with tolerance set to Global.
datumParameter: Parameter value.
length: Arc length.
parameterDirection: Parameter direction.
Returns: The parameter value of the point.

Autodesk.AutoCAD.Geometry.Curve2d.GetParameterAtLength(System.Double,System.Double,System.Boolean,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the parameter value of the point whose arc length distance (from the point with parameter value datumParameter) is the input length.
datumParameter: Parameter value.
length: Arc length.
parameterDirection: Parameter direction.
tolerance: Tolerance.
Returns: The parameter value of the point.

Autodesk.AutoCAD.Geometry.Curve2d.GetArea(System.Double,System.Double)
Returns the area of the interval of the curve defined by startParameter and endParameter.This method calls Curve2d.GetArea(Double startParameter, Double endParameter, Tolerance tolerance) with tolerance set to Global.
startParameter: Parameter value of interval start.
endParameter: Parameter value of interval end (must be larger than startParameter).
Returns: Area of curve between startParameter and endParameter.

Autodesk.AutoCAD.Geometry.Curve2d.GetArea(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the area of the interval of the curve defined by startParameter and endParameter.
startParameter: Parameter value of interval start.
endParameter: Parameter value of interval end (must be larger than startParameter).
tolerance: Tolerance.
Returns: Area of curve between startParameter and endParameter.

Autodesk.AutoCAD.Geometry.Curve2d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity2d@)
Determines if the curve is degenerate and if so returns the entity that the curve degenerates into.This method calls Curve2d.IsDegenerate(Entity2d result, Tolerance tolerance) with tolerance set to Global.
result: Output entity that curve degenerates into.
Returns: true if the curve is degenerate.

Autodesk.AutoCAD.Geometry.Curve2d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity2d@,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the curve is degenerate and if so returns the entity that the curve degenerates into.
result: Output entity that curve degenerates into.
tolerance: Tolerance.
Returns: true if the curve is degenerate.

Autodesk.AutoCAD.Geometry.Curve2d.GetSplitCurves(System.Double)
Returns two segments that are obtained by splitting the curve at the input parameter value. If the specified parameter value does not lie within the parametric interval of the curve or if it corresponds to the start or endpoint of the curve, then returns null.
value: Parameter value at which curve is to be split.
Returns: Curve segments that are obtained by splitting the curve at the input parameter value.

Autodesk.AutoCAD.Geometry.Curve2d.Explode(Autodesk.AutoCAD.Geometry.Interval)
Explodes the curve into its individual components.If the curve is a composite curve, then returns the list of component curves of the composite. If the curve is a spline, then it is exploded at the points of C1 discontinuity and returns a copy of each continuous sub-curve.
interval: Interval of curve that is to be exploded.
Returns: List of curves into which this curve was exploded.

Autodesk.AutoCAD.Geometry.Curve2d.GetBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve. The sides of the returned box are parallel to the coordinate axes.
range: Sub-interval of curve.
Returns: The bounding box of the specified sub-interval of the curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetOrthoBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve. The sides of the returned box are parallel to the coordinate axes.
range: Sub-interval of curve.
Returns: The bounding box of the specified sub-interval of the curve.

Autodesk.AutoCAD.Geometry.Curve2d.EvaluatePoint(System.Double)
Returns the point on the curve that corresponds to the input parameter value.
parameter: Parameter value at which curve is to be evaluated.
Returns: The point on the curve that corresponds to the input parameter value.

Autodesk.AutoCAD.Geometry.Curve2d.GetSamplePoints(System.Int32)
Returns the specified number of points on the curve. The points are equally spaced by parameter value.
numSample: Number of points that are to be returned.
Returns: Array of sampled points.

Autodesk.AutoCAD.Geometry.Curve2d.GetSamplePoints(System.Double,System.Double,System.Double)
Returns a list of points on the curve between fromParameter and toParameter.
fromParameter: Starting parameter.
toParameter: Ending parameter.
approxEps: Chord-height tolerance.
Returns: Array of points on curve between fromParameter and toParameter.

Autodesk.AutoCAD.Geometry.Curve2d.{dtor}
