Autodesk.AutoCAD.DatabaseServices.Mline
Represents the AutoCAD MLINE entity. This multi-line entity allows the user to create a complex line with multiple parallel line parts, each with its own linetype. The space between these parallel lines can be filled if desired.

Autodesk.AutoCAD.DatabaseServices.Mline.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Mline.NumberOfVertices
Gets the number of vertices in the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.SupressEndCaps
Gets or sets true if endcaps are currently suppressed for the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.SupressStartCaps
Gets or sets true if startcaps are currently suppressed for the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.IsClosed
Gets or sets true if the MLine object is currently closed.

Autodesk.AutoCAD.DatabaseServices.Mline.Normal
Gets or sets the unit normal vector the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.Scale
Gets or sets the current scale value in use by the MLine object. The scale value controls the overall width of the MLine object. This scale doesn't affect linetype scale.

Autodesk.AutoCAD.DatabaseServices.Mline.Justification
Gets or sets the MLine object's justification.

Autodesk.AutoCAD.DatabaseServices.Mline.Style
Gets or sets the ObjectId of the MlineStyle currently used by the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.AppendSegment(Autodesk.AutoCAD.Geometry.Point3d)
Projects newVertex along the MLine object's normal vector onto the plane defined by the normal vector and the first vertex of the MLine object. The result of this projection is appended to the end of the MLine object's vertex list. This generates a new MLine object segment between the previously "last" vertex and the newly added vertex.
newVertex: New vertex point (in WCS) to be added.

Autodesk.AutoCAD.DatabaseServices.Mline.RemoveLastSegment(Autodesk.AutoCAD.Geometry.Point3d)
Removes the last vertex in the MLine object's vertex array. The value of the new "last" vertex is then copied into lastVertex.
lastVertex: Returns filled in with the value of the vertex that becomes last when current last is removed.

Autodesk.AutoCAD.DatabaseServices.Mline.MoveVertexAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Changes vertex in index position in the MLine object's vertex array (0 based) to use a value determined by projecting the newPosition point along the MLine object's normal vector onto the plane defined by the normal vector and the MLine object's first vertex.
index: Index of vertex to move in the vertex array.
newPosition: New vertex value.

Autodesk.AutoCAD.DatabaseServices.Mline.Element(Autodesk.AutoCAD.Geometry.Point3d)
Attempts to find which element of the MLine object contains the point pt. If an element is not found that directly contains the point and the MLine object is not closed, then the ends of the MLine object are "virtually" extended to see if pt lies in the path of any element.
pt: Search point.
Returns: The index number of the element(see MlineStyle for an explanation of elements) that contains pt if successful;If not successful, then -1 is returned.

Autodesk.AutoCAD.DatabaseServices.Mline.VertexAt(System.Int32)
Returns the value of the vertex at the index location (0 based) in the MLine object's vertex array.
index: Index (0 based) of desired vertex.
Returns: The value of the vertex at the index location (0 based) in the MLine object's vertex array.

Autodesk.AutoCAD.DatabaseServices.Mline.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean,System.Boolean)
Returns filled in with point on MLine that is nearest.
givenPoint: Point to find nearest point to.
normal: Direction of projection.
extend: Boolean indicates if search should include "virtual" extension of Mline.
excludeCaps: Boolean indicates if endcaps should not be included in nearest point search.
Returns: Point on MLine that is nearest.

Autodesk.AutoCAD.DatabaseServices.Mline.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,System.Boolean,System.Boolean)
Returns filled in with point on MLine that is nearest.
givenPoint: Point to find nearest point to.
extend: Boolean indicates if search should include "virtual" extension of Mline.
excludeCaps: Boolean indicates if endcaps should not be included in nearest point search.
Returns: Point on MLine that is nearest.

Autodesk.AutoCAD.DatabaseServices.Mline.{dtor}
