Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyUnitsType
Describes the units (if any) of the property. Clients can use this information to format the property in their user interface.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyUnitsType.Angular
Property represents an angle between two vectors.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyUnitsType.NoUnits
No units defined.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyUnitsType.Area
Property represents a two-dimensional area.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyUnitsType.Distance
Property represents a distance between two points.