Autodesk.AutoCAD.DatabaseServices.Section
Represents the section plane entity in AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Section.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a section plane using the specified points, normal,and viewing direction.
pts: Vertex points on the section line; should contain at least two points.
verticalDir: Vector on the first segment's plane, normal to the section line.
vecViewingDir: Vector specifies the viewing direction .

Autodesk.AutoCAD.DatabaseServices.Section.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a section plane using the specified points and vector.
pts: Vertex points on the section line; should contain at least two points.
verticalDir: Vector on the first segment's plane, normal to the section line.

Autodesk.AutoCAD.DatabaseServices.Section.#ctor
Default constructor. Constructs a section plane with the type initialized to SectionState.Plane. Since a section plane should have at least two vertices, the section plane constructed by this constructor is invalid until vertices are added. Invalid section planes should not be posted to the database. If they are posted they will remain invisible in the database.

Autodesk.AutoCAD.DatabaseServices.Section.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Section.IsLiveSectionEnabled
Gets true if live sectioning is enabled in the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.Settings
Gets the ID of the Section.Settings object, which stores all the settings for section creation.

Autodesk.AutoCAD.DatabaseServices.Section.Vertices
Gets or sets all section plane vertices.

Autodesk.AutoCAD.DatabaseServices.Section.NumVertices
Gets the number of vertices on the section line of the section plane. A valid section plane has a minimum of two vertices.

Autodesk.AutoCAD.DatabaseServices.Section.IndicatorFillColor
Gets or sets the fill color of the section plane indicator.

Autodesk.AutoCAD.DatabaseServices.Section.IndicatorTransparency
Gets or sets the transparency value for the section plane indicator. The transparency value is in the range 1 to 100.

Autodesk.AutoCAD.DatabaseServices.Section.Normal
Gets the normal vector. The unit vector is perpendicular to the first segment of the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.VerticalDirection
Gets or sets a unit vector specifying the vertical direction of the section plane. The vector is on first segment's plane, perpendicular to the section line.

Autodesk.AutoCAD.DatabaseServices.Section.ViewingDirection
Gets or sets a unit vector that specifies the viewing direction of the section plane. The vector is perpendicular to the first segment's plane.

Autodesk.AutoCAD.DatabaseServices.Section.Name
Gets or sets name of the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.State
Gets or sets the state of this section object.

Autodesk.AutoCAD.DatabaseServices.Section.GetVertex(System.Int32)
Gets the position of the specified vertex.
nIndex: Zero-based index of the vertex to be retrieved; should be less than the number of vertices.
Returns: The position of the vertex.

Autodesk.AutoCAD.DatabaseServices.Section.SetVertex(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Sets the position of the specified vertex.
nIndex: Zero-based index of the vertex to set; should be less than the number of vertices.
pt: New position of the vertex.

Autodesk.AutoCAD.DatabaseServices.Section.AddVertex(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Inserts or adds a new vertex to the section plane. If nIndex is less than zero, or is equal to or more than the number of vertices, the new vertex will be added after the last vertex.
nIndex: Index at which to add the new vertex.
pt: Position of the new vertex.

Autodesk.AutoCAD.DatabaseServices.Section.RemoveVertex(System.Int32)
Removes a vertex from the section plane. The first vertex cannot be removed.
nIndex: Index of the vertex to remove.

Autodesk.AutoCAD.DatabaseServices.Section.GetVertices(Autodesk.AutoCAD.Geometry.Point3dCollection)
Returns all section plane vertices in the pts array.
pts: Output to receive vertices.

Autodesk.AutoCAD.DatabaseServices.Section.Height(Autodesk.AutoCAD.DatabaseServices.SectionHeight)
Returns the height of the section plane above or below the section line. The returned height is the indicator height when the section plane type is either plane or boundary, since the cut extends infinitely in the vertical direction for these two types. The height of the cut is returned when the section plane type is volume.
nHeightType: SectionHeight value.
Returns: The height of the section plane above or below the section line.

Autodesk.AutoCAD.DatabaseServices.Section.SetHeight(Autodesk.AutoCAD.DatabaseServices.SectionHeight,System.Double)
Sets the height of the section plane above or below the section line. The height is the indicator height when the section plane type is plane or boundary, since the cuts extends infinitely in the vertical direction for these two types.
nHeightType: SectionHeight value.
fHeight: Height.

Autodesk.AutoCAD.DatabaseServices.Section.HitTest(Autodesk.AutoCAD.Geometry.Point3d)
Performs a hit test on the section plane.
ptHit: Point to perform hit test.
Returns: SectionHitTestInfo object.

Autodesk.AutoCAD.DatabaseServices.Section.CreateJog(Autodesk.AutoCAD.Geometry.Point3d)
Creates a jog in the section plane at the specified point.
ptOnSection: Point on the section line at which to create the jog.

Autodesk.AutoCAD.DatabaseServices.Section.EnableLiveSection(System.Boolean)
If bEnable is true, this method enables live sectioning in the section plane. At any time, only one section plane in a drawing can have its live section enabled. Enabling live sectioning in one section plane will automatically disable it in other section planes.
bEnable: Boolean indicates whether live sectioning should be enabled.

Autodesk.AutoCAD.DatabaseServices.Section.GenerateSectionGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,System.Array@,System.Array@,System.Array@,System.Array@,System.Array@)
Generates 2D or 3D section geometry.
pEnt: Pointer to the sectionable entity.
pIntFillEnts: Output array containing intersection fill annotation geometry.
pBackgroundEnts: Output array containing background geometry.
pForegroundEnts: Output array containing foreground geometry.
pFurveTangencyEnts: Output array containing furve tangency geometry.
pCurveTangencyEnts: Output array containing curve tangency geometry.

Autodesk.AutoCAD.DatabaseServices.Section.CreateEntity(AcArray&lt;AcDbEntity \*\,AcArrayMemCopyReallocator&lt;AcDbEntity \*&gt; &gt;*)


Autodesk.AutoCAD.DatabaseServices.Section.{dtor}
