Autodesk.AutoCAD.Geometry.Matrix3d
Represents an affine transformation of 3D space, including translation.

Autodesk.AutoCAD.Geometry.Matrix3d.#ctor(System.Double[])


Autodesk.AutoCAD.Geometry.Matrix3d.ElementAt(System.Int32,System.Int32)


Autodesk.AutoCAD.Geometry.Matrix3d.Normal
Takes the absolute value of each element of the upper 3x3 of the matrix and gets the absolute value of the largest such element.

Autodesk.AutoCAD.Geometry.Matrix3d.CoordinateSystem3d
Gets the origin, xAxis, yAxis, and zAxis correspondingly to the origin and axes of the coordinate system to which this matrix maps the standard coordinate system with the origin (0, 0, 0) and axes (1, 0, 0), (0, 1, 0), and (0, 0,1).

Autodesk.AutoCAD.Geometry.Matrix3d.Translation
Gets the translation part of this matrix.

Autodesk.AutoCAD.Geometry.Matrix3d.Identity


Autodesk.AutoCAD.Geometry.Matrix3d.PreMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Sets this matrix to the product leftSide * (this matrix).
leftSide: Left side of matrix.
Returns: leftSide * (this matrix).

Autodesk.AutoCAD.Geometry.Matrix3d.PostMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Sets this matrix to the product (this matrix) * rightSide.
rightSide: Left side of matrix.
Returns: (this matrix) * rightSide.

Autodesk.AutoCAD.Geometry.Matrix3d.Inverse
Returns inverse matrix.
Returns: Inverse matrix.

Autodesk.AutoCAD.Geometry.Matrix3d.IsSingular
Returns true if either of the vectors returned by the property CoordinateSystem3d has zero length, or if these vectors are parallel.
Returns: true if either of the vectors returned by the property CoordinateSystem3d has zero length, or if these vectors are parallel.

Autodesk.AutoCAD.Geometry.Matrix3d.IsSingular(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if either of the vectors returned by the property CoordinateSystem3d has zero length, or if these vectors are parallel.
tolerance: Tolerance.
Returns: true if either of the vectors returned by the property CoordinateSystem3d has zero length, or if these vectors are parallel.

Autodesk.AutoCAD.Geometry.Matrix3d.Transpose
Returns the matrix that is the result of transposition of this matrix.
Returns: The matrix that is the result of transposition of this matrix.

Autodesk.AutoCAD.Geometry.Matrix3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix3d)
Returns true if each column of this matrix is equal to the corresponding column of the matrix mat as vectors.
mat: Matrix to compare against.
Returns: true if each column of this matrix is equal to the corresponding column of the matrix mat as vectors.

Autodesk.AutoCAD.Geometry.Matrix3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if each column of this matrix is equal to the corresponding column of the matrix mat as vectors.
mat: Matrix to compare against.
tolerance: Tolerance.
Returns: true if each column of this matrix is equal to the corresponding column of the matrix mat as vectors.

Autodesk.AutoCAD.Geometry.Matrix3d.IsUniscaledOrtho
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 3D vectors and these two vectors have equal length.
Returns: true if the columns of the linear part of this matrix are perpendicular to each other as 3D vectors and these two vectors have equal length.

Autodesk.AutoCAD.Geometry.Matrix3d.IsUniscaledOrtho(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 3D vectors and these two vectors have equal length.
tolerance: Tolerance.
Returns: true if the columns of the linear part of this matrix are perpendicular to each other as 3D vectors and these two vectors have equal length.

Autodesk.AutoCAD.Geometry.Matrix3d.IsScaledOrtho
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 3D vectors.
Returns: true if the columns of the linear part of this matrix are perpendicular to each other as 3D vectors.

Autodesk.AutoCAD.Geometry.Matrix3d.IsScaledOrtho(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 3D vectors.
tolerance: Tolerance.
Returns: true if the columns of the linear part of this matrix are perpendicular to each other as 3D vectors.

Autodesk.AutoCAD.Geometry.Matrix3d.GetDeterminant
Returns the determinant of this matrix.
Returns: The determinant of this matrix.

Autodesk.AutoCAD.Geometry.Matrix3d.Displacement(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the matrix of the translation by the vector vector.
vector: Translation vector.
Returns: The matrix of the translation by the vector vector.

Autodesk.AutoCAD.Geometry.Matrix3d.Rotation(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d)
Returns the matrix of the rotation by angle angle around the axis with vector axis passing through the point center. The direction of the rotation is defined by right-hand rule.
angle: Rotation angle.
axis: Axis of rotation.
center: Origin point of rotation.
Returns: The matrix of the rotation by angle angle around the axis with vector axis passing through the point center. The direction of the rotation is defined by right-hand rule.

Autodesk.AutoCAD.Geometry.Matrix3d.Scaling(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Returns the matrix of uniform scaling by scale factor scaleAll with respect to the point center.
scaleAll: Scale factor.
center: Origin of the scale.
Returns: The matrix of uniform scaling by scale factor scaleAll with respect to the point center.

Autodesk.AutoCAD.Geometry.Matrix3d.Mirroring(Autodesk.AutoCAD.Geometry.Point3d)
Returns the matrix of mirroring with respect to point point. This is the same as central symmetry with a center point.
pointValue: Point that defines the mirror line.
Returns: The matrix of mirroring with respect to point point.

Autodesk.AutoCAD.Geometry.Matrix3d.Mirroring(Autodesk.AutoCAD.Geometry.Plane)
Returns the matrix of mirroring with respect to plane plane.
plane: The mirror plane.
Returns: The matrix of mirroring with respect to plane plane.

Autodesk.AutoCAD.Geometry.Matrix3d.Mirroring(Autodesk.AutoCAD.Geometry.Line3d)
Returns the matrix of mirroring with respect to line line.
line: The mirror line.
Returns: The matrix of mirroring with respect to line line.

Autodesk.AutoCAD.Geometry.Matrix3d.WorldToPlane(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the matrix of the transformation from world coordinates to plane coordinates, around plane plane.
plane: The transformation plane.
Returns: The matrix of the transformation from world coordinates to plane coordinates, around plane plane.

Autodesk.AutoCAD.Geometry.Matrix3d.WorldToPlane(Autodesk.AutoCAD.Geometry.Plane)
Returns the matrix of the transformation from world coordinates to plane coordinates, around a plane with normal normal.
normal: The normal vector to the plane.
Returns: The matrix of the transformation from world coordinates to plane coordinates.

Autodesk.AutoCAD.Geometry.Matrix3d.PlaneToWorld(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the matrix transformion from plane to world coordinates, using the normal to the plane.
normal: The normal vector to the plane.
Returns: The matrix transformion from plane to world coordinates.

Autodesk.AutoCAD.Geometry.Matrix3d.PlaneToWorld(Autodesk.AutoCAD.Geometry.Plane)
Returns the matrix transformion from plane to world coordinates.
plane: The transformation plane.
Returns: The matrix transformion from plane to world coordinates.

Autodesk.AutoCAD.Geometry.Matrix3d.Projection(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the matrix of the parallel projection into the plane projectionPlane. The direction of the projection is defined by the vector projectDir.
projectionPlane: The projection plane.
projectDir: The projection direction.
Returns: The matrix of the parallel projection into the plane projectionPlane.

Autodesk.AutoCAD.Geometry.Matrix3d.AlignCoordinateSystem(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns matrix that maps coordinate system with the origin fromOrigin and the axes fromXAxis, fromYAxis, and fromZAxis to coordinate system with the origin toOrigin and the axes toXAxis, toYAxis, and toZAxis.
fromOrigin: Point that defines the origin of the from coordinate system.
fromXAxis: Vector that defines the x axis of the from coordinate system.
fromYAxis: Vector that defines the y axis of the from coordinate system.
fromZAxis: Vector that defines the z axis of the from coordinate system.
toOrigin: Point that defines the origin of the to coordinate system.
toXAxis: Vector that defines the x axis of the to coordinate system.
toYAxis: Vector that defines the y axis of the to coordinate system.
toZAxis: Vector that defines the z axis of the to coordinate system.
Returns: Matrix that maps coordinate system with the origin fromOrigin and the axes fromXAxis, fromYAxis, and fromZAxis to coordinate system with the origin toOrigin and the axes toXAxis, toYAxis, and toZAxis.

Autodesk.AutoCAD.Geometry.Matrix3d.GetScale
Returns scale factor of matrix. The returned scale is the square root of the maximum length of the three column vectors.
Returns: Scale factor of matrix.

Autodesk.AutoCAD.Geometry.Matrix3d.IsInverse(Autodesk.AutoCAD.Geometry.Matrix3d)
Gets true if the matrix is the inverse matrix of the input matrix inv.
inv: Matrix.
Returns: true if the matrix is the inverse matrix of the input matrix inv.

Autodesk.AutoCAD.Geometry.Matrix3d.IsInverse(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Tolerance)
Gets true if the matrix is the inverse matrix of the input matrix inv.
inv: Matrix.
tolerance: Tolerance.
Returns: true if the matrix is the inverse matrix of the input matrix inv.

Autodesk.AutoCAD.Geometry.Matrix3d.Equals(System.Object)


Autodesk.AutoCAD.Geometry.Matrix3d.GetHashCode


Autodesk.AutoCAD.Geometry.Matrix3d.ToString(System.IFormatProvider)


Autodesk.AutoCAD.Geometry.Matrix3d.ToString


Autodesk.AutoCAD.Geometry.Matrix3d.ToArray
Returns this matrix as a 1-dimensional array containing 16 elements of type System.Double. The array elements store the matrix row (rn) and column (cn) indices in the following order:r0c0r0c1r0c2r0c3r1c0r1c1r1c2r1c3r2c0r2c1r2c2r2c3r3c0r3c1r3c2r3c3.
Returns: A 1-dimensional array containing 16 elements of type System.Double.

Autodesk.AutoCAD.Geometry.Matrix3d.op_Inequality(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Matrix3d)


Autodesk.AutoCAD.Geometry.Matrix3d.op_Equality(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Matrix3d)


Autodesk.AutoCAD.Geometry.Matrix3d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Matrix3d)
