Autodesk.AutoCAD.GraphicsInterface.ShadowType
The method used to calculate shadows.

Autodesk.AutoCAD.GraphicsInterface.ShadowType.Maps
Shadow maps are created for each light.

Autodesk.AutoCAD.GraphicsInterface.ShadowType.RayTraced
Shadows are calculated using a ray-trace algorithm.