Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Destination
The available outputs targets for rendering.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Destination.Viewport
The rendered image appears directly in the current viewport.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Destination.Window
The rendered image appears in the separate Render window.