Autodesk.AutoCAD.DatabaseServices.SectionSettings
This class stores section geometry settings.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SectionSettings.CurrentSectionType
Gets or sets the current section type set in the section plane.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Reset(Autodesk.AutoCAD.DatabaseServices.SectionType)
Resets the settings for the specified section type to defaults.
nSecType: Section type whose settings are to be reset.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Reset
Resets the settings for all the section types to defaults.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.GenerationOptions(Autodesk.AutoCAD.DatabaseServices.SectionType)
Returns the section generation options flag.
nSecType: Section type for which the generation options object is to be returned.
Returns: The section generation options flag.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetGenerationOptions(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeneration)
Sets the generation options flag. This will overwrite all the current generation options.
nSecType: Section type for which the generation options are to be set.
nOptions: Options flag to set.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.GetSourceObjects(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Gets the source object IDs which are used to generate the section.
nSecType: Section type for which the source objects are to be returned.
ids: Output an array to receive the object IDs.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetSourceObjects(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Sets the source object IDs, which are used to generate a section.
nSecType: Section type for which the source objects are to be set.
ids: An array containing the object IDs.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.DestinationBlock(Autodesk.AutoCAD.DatabaseServices.SectionType)
Returns the ID of the block which will be replaced during section generation.
nSecType: Section type for which the destination block is to be returned.
Returns: The ID of the block which will be replaced during section generation.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetDestinationBlock(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the block name that will be replaced during section generation.
nSecType: Section type for which the destination block is to be set.
id: ID of the block to be replaced during section generation.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.DestinationFile(Autodesk.AutoCAD.DatabaseServices.SectionType)
Returns the output file name to which the generated section will be written.
nSecType: Section type for which the destination file is to be returned.
Returns: The output file name to which the generated section will be written.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetDestinationFile(Autodesk.AutoCAD.DatabaseServices.SectionType,System.String)
Sets the output file name to which the generated section will be written.
nSecType: Section type for which the destination file is to be set.
pszFileName: Destination file name.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Visibility(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns true if the specified section geometry is visible, or false if it is not visible.
nSecType: Section type.
nGeometry: Geometry value.
Returns: true if the specified section geometry is visible.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetVisibility(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Boolean)
Sets the visibility of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
bVisible: true to show the specified geometry, or false to hide it.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Color(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the color of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The color of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetColor(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,Autodesk.AutoCAD.Colors.Color)
Sets the color of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
color: Color to set.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Layer(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the layer name of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The layer name of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetLayer(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.String)
Sets the layer of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
pszLayer: Layer to set.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Linetype(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the linetype of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The linetype of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetLinetype(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.String)
Sets the linetype of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
pszLinetype: Linetype to set.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.LinetypeScale(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the linetype scale of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The linetype scale of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetLinetypeScale(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Double)
Sets the linetype scale of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
fScale: Linetype scale to set.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.PlotStyleName(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the plot style name of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The plot style name of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetPlotStyleName(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.String)
Sets plot style name of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
pszPlotStyleName: Plot style name to set.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.LineWeight(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the line weight of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The line weight of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetLineWeight(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,Autodesk.AutoCAD.DatabaseServices.LineWeight)
Sets line weight of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
nLineWeight: Line weight to set.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.FaceTransparency(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the face transparency of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The face transparency of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetFaceTransparency(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Int32)
Sets the face transparency of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
nTransparency: Face transparency to set.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.EdgeTransparency(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the edge transparency of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The edge transparency of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetEdgeTransparency(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Int32)
Sets the edge transparency of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
nTransparency: Edge transparency to set, in the range 0-100.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.HatchVisibility(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the visibility of hatch in the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The visibility of hatch in the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchVisibility(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Boolean)
Sets the hatch visibility of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
bVisible: true to show hatch, or false to hide it.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.GetHatchPatternType(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Gets the hatch pattern type of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The hatch pattern type of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.GetHatchPatternName(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Gets the hatch pattern name of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The hatch pattern name of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchPatternType(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,Autodesk.AutoCAD.DatabaseServices.HatchPatternType)
Sets the hatch pattern type of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
nPatternType: Hatch pattern type.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchPatternName(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.String)
Sets the hatch pattern name of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
sNewName: Hatch pattern name.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.HatchAngle(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the hatch angle of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The hatch angle of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchAngle(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Double)
Sets the hatch angle of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
fAngle: Hatch angle.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.HatchSpacing(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the hatch spacing of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The hatch spacing of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchSpacing(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Double)
Sets the hatch spacing of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
fSpacing: Hatch spacing.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.HatchScale(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the hatch scale of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The hatch scale of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchScale(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Double)
Sets the hatch scale of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
fScale: Hatch scale.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.HiddenLine(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the hidden line visibility of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The hidden line visibility of the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHiddenLine(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Boolean)
Sets the hidden line visibility of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
bHiddenLine: true if hidden line is to be shown, or false if it is to be hidden.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.DivisionLines(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the visibility of division lines in the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
Returns: The visibility of division lines in the specified section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetDivisionLines(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Boolean)
Sets the division line visibility of the specified section geometry.
nSecType: Section type.
nGeometry: Geometry value.
bShow: true if division lines are to be shown, or false if they are to be hidden.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.{dtor}
