Autodesk.AutoCAD.DatabaseServices.SweepOptionsCheckSweepCurveOut
This class holds the value that SweepOptions.CheckSweepCurve ObjectARX method returns.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsCheckSweepCurveOut.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsCheckSweepCurveOut.ApproximateArcLength
Gets approximate arc length.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsCheckSweepCurveOut.Closed
Gets boolean indicates whether the sweep entity is a closed entity.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsCheckSweepCurveOut.Vector
Gets the normal vector of the entity if planarity is Planar, or the line direction if planarity is Linear.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsCheckSweepCurveOut.Point
Gets a point on the sweep entity if planarity is Planar, or a point on the line if planarity is Linear.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsCheckSweepCurveOut.Planarity
Gets planarity of the entity.