Autodesk.AutoCAD.DatabaseServices.BlockReference
Represents the INSERT entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.BlockReference.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor initializes the block reference to use position (in WCS) as the position point; blockTableRecord as the object ID of the block table record to reference; the X, Y, and Z scale factors to 1.0; the rotation to 0.0; the normal vector to (0,0,1); and the HasAttribute flag to false.
position: Position point.
blockTableRecord: Object ID of BlockTableRecord to reference.

Autodesk.AutoCAD.DatabaseServices.BlockReference.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.BlockReference.AnonymousBlockTableRecord
Gets the anonymous block definition used to draw the dynamic block.

Autodesk.AutoCAD.DatabaseServices.BlockReference.DynamicBlockTableRecord
Gets the ObjectId of the dynamic block definition (a BlockTableRecord) if the block reference is a dynamic block. Otherwise, it returns ObjectId.Null.

Autodesk.AutoCAD.DatabaseServices.BlockReference.DynamicBlockReferencePropertyCollection
Gets a collection of DynamicBlockReferenceProperty instances referencing dynamic block properties on the BlockReference.

Autodesk.AutoCAD.DatabaseServices.BlockReference.TreatAsBlockRefForExplode
This property is called by the AutoCAD EXPLODE command to determine how the entity should be exploded. It is only called on entities of classes derived from BlockReference and not on actual BlockReference objects.

Autodesk.AutoCAD.DatabaseServices.BlockReference.AttributeCollection
Gets the AttributeCollection property value.

Autodesk.AutoCAD.DatabaseServices.BlockReference.BlockTransform
Gets a matrix that describes the mapping from the block table record's MCS (the WCS within the block table record's microspace) out to the Database's WCS.

Autodesk.AutoCAD.DatabaseServices.BlockReference.Normal
Gets the block reference's unit normal vector in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.BlockReference.Rotation
Gets the rotation value (in radians) of the block reference. The rotation value is relative to the X axis of a coordinate system that is parallel to the OCS of the block reference, but has its origin at the position point of the block reference. The rotation axis is the Z axis of this coordinate system with positive rotations going counterclockwise when looking down the Z axis towards the origin.

Autodesk.AutoCAD.DatabaseServices.BlockReference.ScaleFactors
Gets a Scale3d object that contains the X, Y, and Z scale factors for the block reference.

Autodesk.AutoCAD.DatabaseServices.BlockReference.Position
Gets the WCS position point (often referred to as the insertion point) of the block reference.

Autodesk.AutoCAD.DatabaseServices.BlockReference.BlockTableRecord
Gets the object ID of the BlockTableRecord referenced by the block reference.

Autodesk.AutoCAD.DatabaseServices.BlockReference.Dispose(System.Boolean)


Autodesk.AutoCAD.DatabaseServices.BlockReference.GeometryExtentsBestFit
Gets copies of all the entities in the referenced block table record, and then calculates the extents on the resulting entity set.
Returns: WCS extents of the block reference.

Autodesk.AutoCAD.DatabaseServices.BlockReference.GeometryExtentsBestFit(Autodesk.AutoCAD.Geometry.Matrix3d)
Gets copies of all the entities in the referenced block table record, applies parentTransform to them, and then calculates the extents on the resulting entity set.
parentTransform: Transformation to be applied to the block reference's geometry.
Returns: WCS extents of the block reference.

Autodesk.AutoCAD.DatabaseServices.BlockReference.ExplodeToOwnerSpace
This method's behavior corresponds to the BlockReference.Explode() method, except that it appends the resulting entities to the BlockTableRecord that owns the BlockReference on which this method was called.

Autodesk.AutoCAD.DatabaseServices.BlockReference.ConvertToStaticBlock(System.String)
Converts the dynamic block instance to a legacy (nondynamic) block.
newBlockName: Name of the new block definition.

Autodesk.AutoCAD.DatabaseServices.BlockReference.ConvertToStaticBlock
Converts the dynamic block instance to a legacy (nondynamic) anonymous block.

Autodesk.AutoCAD.DatabaseServices.BlockReference.{dtor}
