Autodesk.AutoCAD.GraphicsInterface.TileOrder
The available sequences that can be followed for rendered image tiles.

Autodesk.AutoCAD.GraphicsInterface.TileOrder.BottomToTop
Bottom-to-top order.

Autodesk.AutoCAD.GraphicsInterface.TileOrder.TopToBottom
Top-to-bottom order.

Autodesk.AutoCAD.GraphicsInterface.TileOrder.RightToLeft
Right-to-left order.

Autodesk.AutoCAD.GraphicsInterface.TileOrder.LeftToRight
Left-to-right order.

Autodesk.AutoCAD.GraphicsInterface.TileOrder.Spiral
Spiral order.

Autodesk.AutoCAD.GraphicsInterface.TileOrder.Hilbert
Hilbert order.