Autodesk.AutoCAD.DatabaseServices.ViewportTable
This class is the symbol table for ViewportTableRecords, which represent viewport configurations within AutoCAD when the system variable TILEMODE == 1. Within AutoCAD and DXF files this symbol table is known as the "VPORT" table.

Autodesk.AutoCAD.DatabaseServices.ViewportTable.{dtor}
