Autodesk.AutoCAD.DatabaseServices.Body
Represent nonmanifold solids and other ShapeManager entities that do not fit the characteristics of the Solid3d or Region classes.

Autodesk.AutoCAD.DatabaseServices.Body.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Body.NumChanges
Gets the number of changes that have occurred to this Body since it was first created.

Autodesk.AutoCAD.DatabaseServices.Body.BodyPtr


Autodesk.AutoCAD.DatabaseServices.Body.IsNull
Gets true if this Body has no ShapeManager object within it.

Autodesk.AutoCAD.DatabaseServices.Body.AcisOut(System.String,Autodesk.AutoCAD.DatabaseServices.DBObjectCollection)
This static method writes out all the ShapeManager entities in the entitiesOutToFile array to the fileName file.
fileName: File name to write data to.
entitiesOutToFile: Array containing all the Entities that are to be written out to the file.

Autodesk.AutoCAD.DatabaseServices.Body.AcisIn(System.String)
This static method reads in all the ACIS entities from the fileName ASCII ACIS SAT file; creates Line, Circle, Arc, Ellipse, Spline, Region, Solid3d, or Body objects for each one as appropriate; and returns the newly created DBObjects.
fileName: Object ID of BlockTableRecord to reference.
Returns: The Entities that represent the objects in the file read in.

Autodesk.AutoCAD.DatabaseServices.Body.{dtor}
