Autodesk.AutoCAD.DatabaseServices.Solid3d
Represent 3D solids in AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Solid3d.#ctor
Default constructor. Initializes the change count to 0 and IsNull to true.

Autodesk.AutoCAD.DatabaseServices.Solid3d.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Solid3d.ShowHistory
Gets or sets a boolean indicating whether items in the history should be drawn when the sysvar SHOWHIST is 1.

Autodesk.AutoCAD.DatabaseServices.Solid3d.RecordHistory
Gets or sets a boolean indicating whether the solid will record operations supported by solid history.

Autodesk.AutoCAD.DatabaseServices.Solid3d.NumChanges
Gets the number of changes that have occurred to this solid since it was first created.

Autodesk.AutoCAD.DatabaseServices.Solid3d.IsNull
Gets true if the solid does not have a ShapeManager object within itself.

Autodesk.AutoCAD.DatabaseServices.Solid3d.MassProperties
Gets the volume properties of the solid (for example, mass properties with density == 1.0). All the properties are evaluated in the WCS.

Autodesk.AutoCAD.DatabaseServices.Solid3d.Area
Gets the surface area of the solid. The area will be in square drawing units.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateBox(System.Double,System.Double,System.Double)
Creates a box solid primitive with centroid at world origin. The length, width, and height axes of the box are aligned with the WCS X, Y, and Z axes, respectively.
lengthAlongX: Value for length of the box.
lengthAlongY: Value for width of the box.
lengthAlongZ: Value for height of the box.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateFrustum(System.Double,System.Double,System.Double,System.Double)
Creates a cylinder or cone with the world origin being centered about its diameter and positioned at half of the height.
height: Height for the frustum.
radiusAlongX: Radius for the frustum in X direction.
radiusAlongY: Radius for the frustum in Y direction.
topRadius: Radius for top end of the frustum.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateSphere(System.Double)
Creates a sphere with centroid at world origin and radius radius.
radius: Radius for the sphere.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateTorus(System.Double,System.Double)
Creates a torus with centroid at the WCS origin and using the WCS Z axis as the axis of rotational symmetry for the torus.
majorRadius: Major radius for the torus.
minorRadius: Minor radius for the torus.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateWedge(System.Double,System.Double,System.Double)
Creates a wedge solid with center at the WCS origin.
lengthAlongX: Length for the wedge.
lengthAlongY: Width for the wedge.
lengthAlongZ: Height for the wedge.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreatePyramid(System.Double,System.Int32,System.Double,System.Double)
Creates a pyramid with the world origin being centered about its base and positioned at half of the height.
height: Height for pyramid.
sides: Number of sides for pyramid.
radius: Radius for inscribed circle of bottom polygon.
topRadius: Radius for inscribed circle of top polygon.

Autodesk.AutoCAD.DatabaseServices.Solid3d.Extrude(Autodesk.AutoCAD.DatabaseServices.Region,System.Double,System.Double)
Creates a solid by extruding region, a distance of height with a taper angle of taper. The extrusion direction is along the normal of the region if the height is positive.
region: A region object.
height: Height for extrusion.
taperAngle: Taper angle in radians.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeAlongPath(Autodesk.AutoCAD.DatabaseServices.Region,Autodesk.AutoCAD.DatabaseServices.Curve,System.Double)
Creates a solid by extruding region along the path curve.
region: A region object.
path: A curve object to extrude along.
taperAngle: Taper angle in radians.

Autodesk.AutoCAD.DatabaseServices.Solid3d.Revolve(Autodesk.AutoCAD.DatabaseServices.Region,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Creates a solid by revolving region around the axis defined by the projection of the line from axisPoint to axisPoint+axisDir onto the plane containing region.
region: Region object to be revolved.
axisPoint: Point on the line to be projected to create the axis of revolution.
axisDir: Vector represents the direction of the line to be projected to create the axis of revolution.
angleOfRevolution: Angle of revolution in radians.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CheckInterference(Autodesk.AutoCAD.DatabaseServices.Solid3d)
Checks whether this solid interferes with otherSolid.
otherSolid: Other solid object.
Returns: true if there is interference.

Autodesk.AutoCAD.DatabaseServices.Solid3d.GetSection(Autodesk.AutoCAD.Geometry.Plane)
Creates a Region entity that represents the intersection of plane with the solid, and returns the newly created region entity.
plane: Plane to use as the section cutting plane.
Returns: Region that represents the section.

Autodesk.AutoCAD.DatabaseServices.Solid3d.StlOut(System.String,System.Boolean)
Writes out a Stereo Lithography (STL) representation of this solid to a file with the name fileName.
fileName: File name.
asciiFormat: Boolean indicates file format.

Autodesk.AutoCAD.DatabaseServices.Solid3d.BooleanOperation(Autodesk.AutoCAD.DatabaseServices.BooleanOperationType,Autodesk.AutoCAD.DatabaseServices.Solid3d)
Performs Boolean operation between this solid and solid.
operation: Type of Boolean operation.
solid: Other solid with which to carry out the Boolean operation.

Autodesk.AutoCAD.DatabaseServices.Solid3d.Slice(Autodesk.AutoCAD.DatabaseServices.Surface,System.Boolean)
Slices the solid by a given surface.
surface: The surface entity to be used to slice the solid.
negativeHalfToo: Flag to indicate whether the other side of the solid is to be generated.
Returns: A new solid represents the other side of the solid that is sliced by the given surface.

Autodesk.AutoCAD.DatabaseServices.Solid3d.Slice(Autodesk.AutoCAD.DatabaseServices.Surface)
Slices the solid by a given surface.
surface: The surface entity to be used to slice the solid.
Returns: A new solid represents the other side of the solid that is sliced by the given surface.

Autodesk.AutoCAD.DatabaseServices.Solid3d.Slice(Autodesk.AutoCAD.Geometry.Plane,System.Boolean)
Slices the solid with plane and sets the solid to be the portion on the positive normal side plane.
plane: Plane to be used for slicing the solid.
negativeHalfToo: Boolean indicates whether to return part of solid on negative side of plane.
Returns: The negative half of solid if negativeHalfToo == true.

Autodesk.AutoCAD.DatabaseServices.Solid3d.Slice(Autodesk.AutoCAD.Geometry.Plane)
Slices the solid with plane and sets the solid to be the portion on the positive normal side plane.
plane: Plane to be used for slicing the solid.
Returns: The negative half of solid.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CopyEdge(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Copies the specified edge as an AutoCAD entity, which can be a Line,Circle,Arc,Ellipse, or Spline.
subEntityId: Subentity ID of an edge in the Solid3d.
Returns: The newly created entity copy.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CopyFace(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Copies the specified face as an AutoCAD entity, which can be a Region if the face is planar, or otherwise will be a Body.
subEntityId: Subentity ID of a face in the Solid3d.
Returns: The newly created entity copy.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],System.Double,System.Double)
Extrudes faces of a solid by a distance of height with a taper angle of taper.
subentityIds: Array of subentity IDs of faces to be extruded; these faces must be planar.
height: Extrusion distance to be applied to the specified faces. Use a positive value to extrude in the direction of the face normals, which point outward from the solid. Use a negative value to extrude faces into the solid.
taper: Angle of tapering to be applied to the extrusion; the tapering is relative to the axis formed from the center of each face in the direction of the face normal when a positive height is used or in the opposite direction when a negative height is used; this value should be between half pi and -half pi.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeFacesAlongPath(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.DatabaseServices.Curve)
Extrudes the given faces along the given path curve entity, which must be a Line, Arc, Circle, Ellipse, Spline, Polyline2d, or a non-spline fit Polyline3d.
subentityIds: Array of subentity IDs of faces to be extruded; these faces must be planar.
path: A curve object to extrude along.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ImprintEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
Intersects the given entity with the solid and imprints their intersection graph onto the solid.
entity: Entity to be imprinted.

Autodesk.AutoCAD.DatabaseServices.Solid3d.OffsetBody(System.Double)
Offsets all faces of the solid by the given distance.
offsetDistance: Distance to offset each face.

Autodesk.AutoCAD.DatabaseServices.Solid3d.OffsetFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],System.Double)
Offsets the given faces of the solid by the given distance.
subentityIds: Array of subentity IDs of faces to be offset.
offsetDistance: Distance to offset each face.

Autodesk.AutoCAD.DatabaseServices.Solid3d.RemoveFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[])
Removes the given faces, growing the adjacent faces to fill the gaps.
subentityIds: Array of subentity IDs of faces to be removed.

Autodesk.AutoCAD.DatabaseServices.Solid3d.SeparateBody
Separates the solid into a list of solids representing the additional disjoint volumes.
Returns: A list of solids representing the additional disjoint volumes.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ShellBody(Autodesk.AutoCAD.DatabaseServices.SubentityId[],System.Double)
Changes the solid into a thin-walled solid shell with the faces offset to the outside of the solid when given positive offset distances, and to the inside when given negative distances.
subentityIds: Array of subentity IDs of faces to be removed from the shell.
offsetDistance: Distance to offset each face.

Autodesk.AutoCAD.DatabaseServices.Solid3d.TaperFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Tapers the given faces of the solid about the given base point and supplied draft vector by a given draft angle. The base point and draft vector define a draft plane about which faces are tapered. Any face lying in the draft plane will not be modified.
subentityIds: Array of subentity IDs of faces to be tapered.
basePoint: Origin of the draft plane.
draftVector: Draft direction vector.
draftAngle: Draft angle.

Autodesk.AutoCAD.DatabaseServices.Solid3d.TransformFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.Geometry.Matrix3d)
Transforms the given faces of the solid by applying the transformation matrix to rotate and or move the faces.
subentityIds: Array of subentity IDs of faces to be transformed.
matrix: Rotation and/or translation matrix to be applied to the faces.

Autodesk.AutoCAD.DatabaseServices.Solid3d.SetSubentityColor(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Colors.Color)
Sets the color of the face or edge subentity of the Solid3d to the specified AutoCAD color.
subEntityId: ID of subentity face or edge to be colored.
color: Color for the subentity.

Autodesk.AutoCAD.DatabaseServices.Solid3d.GetSubentityColor(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Retrieves the color of the specified subentity.
subEntityId: Subentity Id.
Returns: Color value of the specified subentity.

Autodesk.AutoCAD.DatabaseServices.Solid3d.SetSubentityMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets a material on a specified subentity. You can remove a previously assigned material by providing a null objectId for the materialId parameter.
subEntityId: Subentity Id.
materialId: Object Id of the material.

Autodesk.AutoCAD.DatabaseServices.Solid3d.GetSubentityMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Returns the material of the specified subentity.
subEntityId: Subentity Id.
Returns: Object Id of the assigned material.

Autodesk.AutoCAD.DatabaseServices.Solid3d.SetSubentityMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.GraphicsInterface.Mapper)
Sets an explicit material mapper on the specified subentity.
subEntityId: Subentity Id.
mapper: A GraphicsInterface.Mapper object. Pass in null to remove a previous assignment.

Autodesk.AutoCAD.DatabaseServices.Solid3d.GetSubentityMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Retrieves the material mapper for the specified subentity.
subEntityId: Subentity Id.
Returns: The assigned material mapper.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ConvertToBrepAtSubentPaths(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Converts individual history items from a parameterized type such as a box to a simple boundary-representation without its parameter or type information.
paths: Array of references to history items.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ChamferEdges(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.DatabaseServices.SubentityId,System.Double,System.Double)
Creates chamfers at the edges of a solid.
subentityIds: Object ids of edges at which the chamfer will be applied.
baseSubentityId: Object id of the base face where the chamfer will be applied.
baseDist: Chamfer distance on the base face.
otherDist: Chamfer distance on the other faces.

Autodesk.AutoCAD.DatabaseServices.Solid3d.FilletEdges(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection)
Creates rounded fillets the edges of a solid.
subentityIds: Object ids of the edges where the fillet will be applied.
radius: Radius at the corresponding edge.
startSetback: Start setback at the corresponding edge.
endSetback: End setback at the corresponding edge.

Autodesk.AutoCAD.DatabaseServices.Solid3d.{dtor}
