Autodesk.AutoCAD.GraphicsInterface.Mapper
The Mapper class defines mappers. Mappers determine how a MaterialMap is positioned, sized, and rotated when it is mapped to an object surface. Mappers are described by type, tiling, automatic transform, and transform properties.

Autodesk.AutoCAD.GraphicsInterface.Mapper.#ctor(Autodesk.AutoCAD.GraphicsInterface.Projection,Autodesk.AutoCAD.GraphicsInterface.Tiling,Autodesk.AutoCAD.GraphicsInterface.AutoTransform,Autodesk.AutoCAD.Geometry.Matrix3d)
Constructor.
projection: The mapping projection.
tiling: The tiling mode.
autoTransform: The automatic transform mode of the mapper.
transform: The transform of the mapper.

Autodesk.AutoCAD.GraphicsInterface.Mapper.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.Mapper.Transform
Gets the transform of the mapper.

Autodesk.AutoCAD.GraphicsInterface.Mapper.AutoTransform
Gets the automatic transform mode of the mapper.

Autodesk.AutoCAD.GraphicsInterface.Mapper.Tiling
Gets the tiling mode.

Autodesk.AutoCAD.GraphicsInterface.Mapper.Projection
Gets the mapping projection.

Autodesk.AutoCAD.GraphicsInterface.Mapper.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.Mapper.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.Mapper.{dtor}
