Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder
Is required to build instances of Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo , which is an immutable value type.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.#ctor(Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo)
Constructor.
value: Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo object.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.CustomProperties
Gets the CustomProperties property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.HyperlinkBase
Gets the HyperlinkBase property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.RevisionNumber
Gets the RevisionNumber property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.LastSavedBy
Gets the LastSavedBy property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.Comments
Gets the Comments property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.Keywords
Gets the Keywords property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.Author
Gets the Author property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.Subject
Gets the Subject property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.Title
Gets the Subject Title value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.ToDatabaseSummaryInfo
Returns a DatabaseSummaryInfo object that contains the values specified in this object.
Returns: A DatabaseSummaryInfo object that contains the values specified in this object.