Autodesk.AutoCAD.GraphicsSystem.Model
The GraphicsSystem.Model class is an abstraction of a database. This database may be a Database, it may be a container for transient graphics (such as the Icon and Grid), or it may represent another persistent database format such as DWF. Most significantly, the Model provides a mechanism for the database to inform the graphics system (GS) of changes (additions, deletions, and modifications).

Autodesk.AutoCAD.GraphicsSystem.Model.#ctor(Autodesk.AutoCAD.GraphicsSystem.RenderType)


Autodesk.AutoCAD.GraphicsSystem.Model.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsSystem.Model.ShadowPlaneLocation
Gets the models current ground plane z position in world coordinates. The ground plane is always parallel to the X-Y world plane.

Autodesk.AutoCAD.GraphicsSystem.Model.RenderType
Gets the render type of this model.

Autodesk.AutoCAD.GraphicsSystem.Model.SectioningVisualStyle
Sets the visual style to be used for objects on the clipped side of the sectioning.

Autodesk.AutoCAD.GraphicsSystem.Model.EnableSectioning
Gets or sets a boolean indicating whether or not the currently specified sectioning is active in GraphicsSystem.Views displaying this Model.

Autodesk.AutoCAD.GraphicsSystem.Model.LinetypesEnabled
Gets or sets true if linetypes are currently enabled.

Autodesk.AutoCAD.GraphicsSystem.Model.BackgroundId
Gets or sets the Object ID of the Background-derived object on the view.

Autodesk.AutoCAD.GraphicsSystem.Model.VisualStyle
Gets or sets the persistent visual style on the model.

Autodesk.AutoCAD.GraphicsSystem.Model.VisualStyleId
Gets or sets the ObjectId of the non-persistent visual style on the model.

Autodesk.AutoCAD.GraphicsSystem.Model.RenderModeOverride
Instructs the geometry in a model to always choose a particular rendering algorithm and ignore the view's default algorithm.

Autodesk.AutoCAD.GraphicsSystem.Model.ViewClippingOverride
Sets true to enable the geometry in a model to ignore the view's front and back clipping planes.

Autodesk.AutoCAD.GraphicsSystem.Model.Transform
Gets or sets a base modeling transform.

Autodesk.AutoCAD.GraphicsSystem.Model.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsSystem.Model.AddSceneGraphRoot(Autodesk.AutoCAD.GraphicsInterface.Drawable)
Informs this Model that pRoot is a scene graph root.
pRoot: Drawable that is a scene graph root.
Returns: Always true.

Autodesk.AutoCAD.GraphicsSystem.Model.EraseSceneGraphRoot(Autodesk.AutoCAD.GraphicsInterface.Drawable)
Informs this AcGsModel that pRoot is no longer a scene graph root.
pRoot: Drawable that was a scene graph root.
Returns: true if pRoot was registered as a scene graph root.

Autodesk.AutoCAD.GraphicsSystem.Model.OnAdded(Autodesk.AutoCAD.GraphicsInterface.Drawable,System.Int32)
Informs the GS that the specified Drawable has been added to the database represented by this Model.
added: Drawable that has been added to the database.
parentId: Parent.

Autodesk.AutoCAD.GraphicsSystem.Model.OnAdded(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
Informs the Graphic System (GS) that the specified Drawable has been added to the database represented by this Model.
added: Drawable that has been added to the database.
parent: Drawable parent.

Autodesk.AutoCAD.GraphicsSystem.Model.OnModified(Autodesk.AutoCAD.GraphicsInterface.Drawable,System.Int32)
Informs the GS that the database representation of the specified Drawable has been modified.
modified: Drawable that has been modified.
parentId: Parent.

Autodesk.AutoCAD.GraphicsSystem.Model.OnModified(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
Informs the Graphic System (GS) that the database representation of the specified Drawable has been modified.
modified: Drawable that has been modified.
parent: Drawable parent.

Autodesk.AutoCAD.GraphicsSystem.Model.OnErased(Autodesk.AutoCAD.GraphicsInterface.Drawable,System.Int32)
Informs the Graphic System (GS) that the specified Drawable has been removed from the underlying database; it offers the GS the opportunity to clean up the portion of its cache corresponding to the erase database object.
erased: Drawable that has been removed from the database.
parentId: Parent.

Autodesk.AutoCAD.GraphicsSystem.Model.OnErased(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
Informs the Graphic System (GS) that the specified Drawable has been removed from the underlying database; it offers the GS the opportunity to clean up the portion of its cache corresponding to the erase database object.
erased: Drawable that has been removed from the database.
parent: Drawable parent.

Autodesk.AutoCAD.GraphicsSystem.Model.OnPaletteModified
Informs the GS that the color palette has changed.

Autodesk.AutoCAD.GraphicsSystem.Model.SetExtents(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This method is not implemented.
point3dx: Not implemented.
point3dy: Not implemented.

Autodesk.AutoCAD.GraphicsSystem.Model.Invalidate(Autodesk.AutoCAD.GraphicsSystem.InvalidationHint)
Invalidates a given Model, allowing it to invalidate and rebuild its cache.
hint: Hint about the invalidation required.

Autodesk.AutoCAD.GraphicsSystem.Model.SetSectioning(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double)
Sets the active live sectioning for the Model.
pts: An array of co-planar points specifying a sectioning region.
upVector: Vector that specifies the orientation of the plane containing pts.
top: Value that specifies the top capping height of the sectioning.
bottom: Value that specifies the bottom capping height of the sectioning.
Returns: true if the specified sectioning is valid.

Autodesk.AutoCAD.GraphicsSystem.Model.SetSectioning(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the active live sectioning for the Model.
pts: An array of co-planar points specifying a sectioning region.
upVector: Vector that specifies the orientation of the plane containing pts.
Returns: true if the specified sectioning is valid.

Autodesk.AutoCAD.GraphicsSystem.Model.DeleteUnmanagedObject


Autodesk.AutoCAD.GraphicsSystem.Model.{dtor}
