Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d
Represents the vertices within 3D polylines in AutoCAD.

Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs a PolylineVertex3d that uses param0 as the position point. The vertex type is initialized to Vertex3dType.SimpleVertex.
param0: WCS position point for the vertex.

Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.#ctor
Default constructor. Initializes the position to (0,0,0) and the vertex type to Vertex3dType.SimpleVertex.

Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.Position
Gets or sets the WCS point value of this vertex.

Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.VertexType
Gets Vertex3dType of this vertex.

Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.{dtor}
