Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex
Represents vertices within polygon meshes in AutoCAD.

Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs a PolygonMeshVertex that uses position as the position point.The vertex type is initialized to Vertex3dType.SimpleVertex.
point: WCS position point for the vertex.

Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.#ctor
Default constructor. Initializes the position to (0,0,0) and the vertex type to Vertex3dType.SimpleVertex.

Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.Position
Gets or sets the WCS point value of this vertex.

Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.VertexType
Gets the VertexType of this vertex.

Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.{dtor}
