Autodesk.AutoCAD.DatabaseServices.Ole2Frame
Provides support for OLE 2 objects in AutoCAD drawings. Essentially it provides a window to display the OLE 2 object it has a pointer to.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Ole2Frame.OleObject
Gets the MFC COleClientItem object currently used by the Ole2Frame object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.LockAspect
Gets the lock aspect ratio property, which affects the behavior of the OLE object when its size is changed.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.ScaleHeight
Gets or sets the scale height, which represents the current object scale relative to the original scale from the default text size to the AutoCAD units scale. This is expressed as a percentage of the original scale.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.ScaleWidth
Gets or sets the scale width, which represents the current object scale relative to the original scale from the default text size to the AutoCAD units scale. This is expressed as a percentage of the original scale.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.WcsHeight
Gets or sets the actual height of the OLE object expressed in AutoCAD world coordinates.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.WcsWidth
Gets or sets the actual width of the OLE object expressed in AutoCAD world coordinates.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Rotation
Gets or sets the rotation value, which users may change to any angle using the Properties window or the ROTATE command. The angle is returned in degrees.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.AutoOutputQuality
Gets or sets a Boolean indicating whether the plot quality setting is Automatically Select in the Properties palette.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.OutputQuality
Gets or sets the current output quality assigned to this Ole2Frame object. Output quality affects the color depth and resolution at which the OLE object is plotted.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.LinkPath
Gets the path and file name to which the object is linked.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.LinkName
Gets the path, file and item name to which the object is linked.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.IsLinked
Gets true if this Ole2Frame object is a linked object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Type
Gets the OLE object's type.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.UserType
Gets the user type string (for example "Paintbrush Bitmap") of the object used by this Ole2Frame object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Position2d
Gets or sets System.Drawing.Rectangle object with the coordinates of the four corners of OLE object in the GDI coordinates of the current viewport.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Position3d
Gets or sets DatabaseServices.Rectangle3d object with the world coordinate system coordinates of the four corners of OLE object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Location
Gets with Point3d set to the WCS point that corresponds to the lower-left corner of the OLE display rectangle of the Ole2Frame object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.{dtor}
