Autodesk.AutoCAD.Runtime.ExtensionLoader
This class loads a managed extension application and uses the system activator to instantiate the application object. The assembly's ExtensionApplication attribute provides the type information needed to create the application's entry point.

Autodesk.AutoCAD.Runtime.ExtensionLoader.Load(System.String)
Loads managed extension specified by fileName.
fileName: Filename of the managed extension.

Autodesk.AutoCAD.Runtime.ExtensionLoader.IsLoaded(System.String)
Determines whether the managed extension specified by fileName is loaded.
fileName: Filename of the managed extension.
Returns: true if the managed extension specified by fileName is loaded.