Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord
Objects of this class represent viewport arrangements when TILEMODE == 1 within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridMajor
Gets or sets the number of minor grid lines between each major grid line in the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridFollow
Gets or sets true if the grid will follow a dynamic UCS change in the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridSubdivisionRestricted
Gets or sets true if the grid adapts to display more lines that specified in the GRIDUNIT setting. When zooming in the gridlines may get too sparse, so more lines are diplayed.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridAdaptive
Gets or sets true if the grid adapts to display fewer lines in the viewport than specified by the GRIDUNIT setting.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridBoundToLimits
Gets or sets true if the grid is drawn beyond the limits for the WCS and user-defined UCS in the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.UcsSavedWithViewport
Gets or sets true if the ucs that is saved with this viewport will become active whenever the viewport is made active.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapIncrements
Gets or sets a Point2d in which the X value represents the X spacing of the snap grid and the Y value represents the Y spacing of the snap grid. Both values are in drawing units.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapBase
Gets or sets the snap basepoint (in UCS coordinates) for the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapAngle
Gets or sets the snap angle setting (in radians) for the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapPair
Gets or sets the snap IsoPair setting for the ViewportTableRecord.The snap IsoPair indicates the current isometric plane for the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.IsometricSnapEnabled
Gets or sets true if snap mode is currently set to isometric in the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapEnabled
Gets or sets true if snap mode is currently set on in the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridIncrements
Gets or sets a Vector2d in which the X value represents the X spacing (in drawing units) of the grid and the Y value represents the Y spacing of the grid.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridEnabled
Gets or sets true if the grid is set on in the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.IconAtOrigin
Gets or sets true if the ViewportTableRecord is currently set to have the UCS icon follow the current UCS origin (as long as the origin is far enough within the viewport to allow the icon to display properly).

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.IconEnabled
Gets or sets true if the ViewportTableRecord is currently set to have the UCS icon display.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.FastZoomsEnabled
Always true. It is obsolete and will be removed in a future release.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.CircleSides
Gets or sets the circle zoom percent of the ViewportTableRecord.The circle zoom percent controls the number of sides to the tessellation used when displaying curves. The value can be between 1 and 20000, with higher settings using more sides in the curve tessellation.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.UcsFollowMode
Gets or sets true if the ViewportTableRecord is set to generate and display a plan view whenever the UCS changes in the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.UpperRightCorner
Gets or sets a Point2d object containing the upper right corner of the viewport window.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.LowerLeftCorner
Gets or sets a Point2d object containing the lower left corner of the viewport window.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.{dtor}
