Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollectionEnumerator.#ctor(Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection)


Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollectionEnumerator.Current
Gets the current element in the collection.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollectionEnumerator.MoveNext
Moves the enumerator to the next entry in the collection.
Returns: true if the enumerator was successfully moved to the next entry; false if the enumerator has passed the end of the collection.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollectionEnumerator.Reset
Resets the enumerator to the first entry in the collection.