Autodesk.AutoCAD.DatabaseServices.Face
Represents the 3dface entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Face.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
This constructor initializes the Face to use the points pointer1--pointer3 as the four corner points of the face with pointer3 being used for both the third and fourth corner points. This produces a face that is triangular.
pointer1: First corner point (in WCS coordinates).
pointer2: Second corner point (in WCS coordinates).
pointer3: Third corner point (in WCS coordinates).
value1: Boolean indicating whether or not first edge will be visible.
value2: Boolean indicating whether or not second edge will be visible.
value3: Boolean indicating whether or not third edge will be visible.
value4: Boolean indicating whether or not fourth edge will be visible.

Autodesk.AutoCAD.DatabaseServices.Face.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
This constructor initializes the Face to use the points pointer1--pointer13 as the four corner points of the face.
pointer1: First corner point (in WCS coordinates).
pointer2: Second corner point (in WCS coordinates).
pointer3: Third corner point (in WCS coordinates).
pointer4: Fourth corner point (in WCS coordinates).
value1: Boolean indicating whether or not first edge will be visible.
value2: Boolean indicating whether or not second edge will be visible.
value3: Boolean indicating whether or not third edge will be visible.
value4: Boolean indicating whether or not fourth edge will be visible.

Autodesk.AutoCAD.DatabaseServices.Face.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Face.GetVertexAt(System.Int16)
Uses the value argument to return the WCS value of the vertex.
value: Vertex index number (must be 0--3).
Returns: Vertex position (in WCS coordinates).

Autodesk.AutoCAD.DatabaseServices.Face.SetVertexAt(System.Int16,Autodesk.AutoCAD.Geometry.Point3d)
Sets the vertex specified by vertexIndex to use the position value position.
vertexIndex: Vertex index number (must be 0--3).
vertexPosition: Vertex position (in WCS coordinates).

Autodesk.AutoCAD.DatabaseServices.Face.IsEdgeVisibleAt(System.Int16)
Uses the visibility argument to return the visibility value for the edge that starts with the vertex specified by vertexIndex.
vertexIndex: Vertex index number (must be 0--3).
Returns: Edge visibility Boolean.

Autodesk.AutoCAD.DatabaseServices.Face.MakeEdgeVisibleAt(System.Int16)
Sets the edge that starts at the vertex specified by vertexIndex to be visible.
vertexIndex: Vertex index number of starting vertex for edge.

Autodesk.AutoCAD.DatabaseServices.Face.MakeEdgeInvisibleAt(System.Int16)
Sets the edge that starts at the vertex specified by vertexIndex to be invisible.
vertexIndex: Vertex index number of starting vertex for edge.

Autodesk.AutoCAD.DatabaseServices.Face.{dtor}
