Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings
This class is a container for all properties relating to the Mental Ray renderer.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.EnergyMultiplier
Gets or sets the energy multiplier value.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.MemoryLimit
Gets or sets the maximum amount of memory (in MB) that the renderer will allocate for rendering.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.TileOrder
Gets or sets the sequence (order) used to render image tiles.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.TileSize
Gets or sets the size of the image tiles to use when rendering.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.ExportMIFileName
Gets or sets the full path and file name to use for an exported MI file.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.ExportMIEnabled
Gets or sets Boolean indicating whether to export an MI file after rendering.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.DiagnosticBSPMode
Gets or sets the type of BSP information to visualize with the BSP diagnostic mode.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.DiagnosticPhotonMode
Gets or sets the type of photon information to visualize with the photon diagnostic mode.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.DiagnosticGridMode
Gets or sets the coordinate system to use for the diagnostic grid, including the distance between grid lines (size).

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.DiagnosticMode
Gets or sets the mode used for rendering diagnostic images.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.FGSampleRadius
Gets or sets the minimum and maximum radii of the area used to sample final gather points to compute indirect illumination.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.FGSampleRadiusState
Gets or sets the flags indicating whether the user-defined final gathering sampling radii are used, and what units they are defined in.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.FGRayCount
Gets or sets the number of final gather rays to be used for each final gather point.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.FinalGatheringEnabled
Gets or sets a Boolean value indicating whether final gathering is applied.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.PhotonTraceDepth
Gets or sets the maximum trace depth (recursion level) for photons.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.GIPhotonsPerLight
Gets or sets the average number of GI photons to shoot for each light.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.GISampleRadius
Gets or sets the radius of the area used to sample photons for global illumination.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.GISampleRadiusEnabled
Gets or sets a Boolean value indicating whether the user-defined photon sampling radius is used.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.GISampleCount
Gets or sets the maximum number of photons near a render sample point to use for computing global illumination.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.GlobalIlluminationEnabled
Gets or sets a Boolean value indicating whether global illumination (using photon mapping) is computed.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.RayTraceDepth
Gets or sets the maximum trace depth (recursion level) for rays.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.RayTracingEnabled
Gets or sets a Boolean value indicating whether ray-tracing is performed.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.ShadowMapsEnabled
Gets or sets a Boolean value indicating whether shadow maps are computed.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.ShadowMode
Gets or sets the method used to compute ray-traced shadows.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.SamplingContrastColor
Gets or sets the threshold above which further samples will be taken, per color channel. When performing sampling, the renderer will compare a sample to its surrounding samples, and take further samples if the difference is greater than the threshold value.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.SamplingFilter
Gets or sets the filtering parameters for combining multiple samples into a single pixel color.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.Sampling
Gets or sets the minimum and maximum numbers of samples to take when shading a pixel during rendering.

Autodesk.AutoCAD.DatabaseServices.MentalRayRenderSettings.{dtor}
