Autodesk.AutoCAD.Geometry.Vector3dCollectionEnumerator
Supports a simple iteration over a Vector3dCollection.

Autodesk.AutoCAD.Geometry.Vector3dCollectionEnumerator.#ctor(Autodesk.AutoCAD.Geometry.Vector3dCollection)


Autodesk.AutoCAD.Geometry.Vector3dCollectionEnumerator.Current
Gets the current element in the collection.

Autodesk.AutoCAD.Geometry.Vector3dCollectionEnumerator.MoveNext
Moves the enumerator to the next entry in the collection.
Returns: true if the enumerator was successfully moved to the next entry; false if the enumerator has passed the end of the collection.

Autodesk.AutoCAD.Geometry.Vector3dCollectionEnumerator.Reset
Resets the enumerator to the first entry in the collection.