Autodesk.AutoCAD.DatabaseServices.ImageQuality
Image display quality.

Autodesk.AutoCAD.DatabaseServices.ImageQuality.High
More computationally intensive algorithms are used, which usually generate more accurate and visually pleasing output.

Autodesk.AutoCAD.DatabaseServices.ImageQuality.Draft
Fast low-quality image resampling and processing algorithms are used.

Autodesk.AutoCAD.DatabaseServices.ImageQuality.Invalid
Image display quality setting is invalid.