Autodesk.AutoCAD.Geometry.DoubleCollectionEnumerator
Supports a simple iteration over a DoubleCollection.

Autodesk.AutoCAD.Geometry.DoubleCollectionEnumerator.#ctor(Autodesk.AutoCAD.Geometry.DoubleCollection)


Autodesk.AutoCAD.Geometry.DoubleCollectionEnumerator.Current
Gets the current element in the collection.

Autodesk.AutoCAD.Geometry.DoubleCollectionEnumerator.MoveNext
Moves the enumerator to the next entry in the collection.
Returns: true if the enumerator was successfully moved to the next entry; false if the enumerator has passed the end of the collection.

Autodesk.AutoCAD.Geometry.DoubleCollectionEnumerator.Reset
Resets the enumerator to the first entry in the collection.