Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex
Represents the vertices within PolyFaceMesh entities in AutoCAD drawings.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs a PolyFaceMeshVertex that uses position as the position point. The vertex type is initialized to Vertex3dType.SimpleVertex.
position: WCS position point for the vertex.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex.#ctor
Default constructor.Initializes the position to (0,0,0) and the vertex type to Vertex3dType.SimpleVertex.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex.Position
Gets or sets the WCS point value of this vertex.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex.{dtor}
