Autodesk.AutoCAD.DatabaseServices.AlignedDimension
The AlignedDimension class is used to represent the dimension type that dimensions the distance between two points located anywhere in space. The dimension's normal vector must be perpendicular to the line between the two points. The two selected points are also used as the definition points for the start of the two dimension extension lines.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor uses the parameters passed in to initialize the dimension. In addition, the extension line obliquing angle is set to 0.0 and the rest of the Dimension, Entity, and others, default constructor initializations are performed.
line1Point: Start point (in WCS coordinates) of first extension line.
line2Point: Start point (in WCS coordinates) of second extension line.
dimensionLinePoint: Point (in WCS coordinates) on dimension line itself.
dimensionText: Text string to use as the dimension annotation.
dimensionStyle: Object ID of DimStyleTableRecord to use.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.AlignedDimension.Oblique
Gets or sets the extension line obliquing angle (in radians) for the dimension.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.DimLinePoint
Gets or sets the definition point (in WCS coordinates) that specifies where the dimension line will be. This point will be somewhere on the dimension line.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.XLine2Point
Gets or sets the definition point (in WCS coordinates) that is used as the start point for the second extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.XLine1Point
Gets or sets the definition point (in WCS coordinates) that is used as the start point for the first extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.{dtor}
