Autodesk.AutoCAD.Geometry.Curve2dCollection
Represents a collection of Curve2d objects.

Autodesk.AutoCAD.Geometry.Curve2dCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.Curve2dCollection.Item(System.Int32)


Autodesk.AutoCAD.Geometry.Curve2dCollection.IsReadOnly


Autodesk.AutoCAD.Geometry.Curve2dCollection.IsFixedSize


Autodesk.AutoCAD.Geometry.Curve2dCollection.Count


Autodesk.AutoCAD.Geometry.Curve2dCollection.GetEnumerator


Autodesk.AutoCAD.Geometry.Curve2dCollection.RemoveAt(System.Int32)


Autodesk.AutoCAD.Geometry.Curve2dCollection.Clear


Autodesk.AutoCAD.Geometry.Curve2dCollection.CopyTo(Autodesk.AutoCAD.Geometry.Curve2d[],System.Int32)


Autodesk.AutoCAD.Geometry.Curve2dCollection.Insert(System.Int32,Autodesk.AutoCAD.Geometry.Curve2d)


Autodesk.AutoCAD.Geometry.Curve2dCollection.Remove(Autodesk.AutoCAD.Geometry.Curve2d)


Autodesk.AutoCAD.Geometry.Curve2dCollection.Contains(Autodesk.AutoCAD.Geometry.Curve2d)


Autodesk.AutoCAD.Geometry.Curve2dCollection.IndexOf(Autodesk.AutoCAD.Geometry.Curve2d)


Autodesk.AutoCAD.Geometry.Curve2dCollection.Add(Autodesk.AutoCAD.Geometry.Curve2d)


Autodesk.AutoCAD.Geometry.Curve2dCollection.{dtor}
