Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension
Represents the angular dimension defined by three points (as opposed to two lines) within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor uses the parameters passed in to initialize the dimension. In addition, the rest of the Dimension, Entity, and others, default constructor initializations are performed.
centerPoint: Center (vertex) point (in WCS coordinates) of angle being dimensioned.
line1Point: Start point (in WCS coordinates) of first extension line.
line2Point: Start point (in WCS coordinates) of second extension line.
arcPoint: Point that will be on the dimension arc.
dimensionText: Text string to use as the dimension annotation.
dimensionStyle: Object ID of DimStyleTableRecord to use.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.#ctor
Default constructor. Initializes the arc point angle center point and extension lines 1 and 2 start points all to (0,0,0). In addition, all the initializations of the default constructor for Dimension, Entity, and others, are performed.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.CenterPoint
Gets or sets the dimension definition point (in WCS coordinates) that is located at the vertex of the angle being dimensioned.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.XLine2Point
Gets or sets the dimension definition point (in WCS coordinates) that is used for the start point of the second extension line of the dimension. This point and the dimension's center point (which is located at the angle's vertex) define one side of the angle being dimensioned.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.XLine1Point
Gets or sets the dimension definition point (in WCS coordinates) that is used for the start point of the first extension line of the dimension. This point and the dimension's center point (which is located at the angle's vertex) define one side of the angle being dimensioned.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.ArcPoint
Gets or sets the dimension definition point (in WCS coordinates) that is used to determine the location of the arc of the dimension.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.{dtor}
