Autodesk.AutoCAD.DatabaseServices.Filters.SpatialIndex
This class is an index implementation especially for the spatial index.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialIndex.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialIndex.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialIndex.{dtor}
