Autodesk.AutoCAD.DatabaseServices.RasterImage
The RasterImage entity (or "image entity") works with the RasterImageDef object (or "image definition object") to implement raster images inside AutoCAD. The relationship between these two classes is much like the relationship between an AutoCAD block definition object and a block insert entity.

Autodesk.AutoCAD.DatabaseServices.RasterImage.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RasterImage.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RasterImage.Fade
Gets or sets the current fade value of the image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Contrast
Gets or sets the current contrast value of the image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Brightness
Gets or sets the current brightness value of the image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.DisplayOptions
Gets or sets the current display options of the image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.PixelToModelTransform
Gets an affine transformation from image source pixels to model coordinates.

Autodesk.AutoCAD.DatabaseServices.RasterImage.IsClipped
Gets true if the image is clipped.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ClipBoundaryType
Gets the current clip boundary type of the image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Scale
Gets the effective XY scale factor for this image entity, expressed as image size in user units (as inserted and scaled into model space) divided by the original image size (derived from the image resolution specified in the image file).

Autodesk.AutoCAD.DatabaseServices.RasterImage.Orientation
Gets or sets the position and orientation of an image entity. These vectors lie along the outer edge of the unclipped image. The clipped image may be smaller than the rectangle specified by these vectors.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ReactorId
Gets or sets the ObjectId of an image entity's reactor.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ImageDefId
Gets or sets the ObjectId of an image entity's image definition object.

Autodesk.AutoCAD.DatabaseServices.RasterImage.AssociateRasterDef(Autodesk.AutoCAD.DatabaseServices.RasterImageDef)


Autodesk.AutoCAD.DatabaseServices.RasterImage.EnableReactors(System.Boolean)
Temporarily disables notification of RasterImage entities when a RasterImageDef object is modified or erased.
enable: Boolean to enable/disable notification.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ImageSize(System.Boolean)
Returns the raw image size in pixels.
getCachedValue: Boolean indicates whether the cached should be used.
Returns: The raw image size in pixels.

Autodesk.AutoCAD.DatabaseServices.RasterImage.SetClipBoundaryToWholeImage
Sets the clip boundary to coincide with the image borders.Any existing clip boundary is deleted.

Autodesk.AutoCAD.DatabaseServices.RasterImage.SetClipBoundary(Autodesk.AutoCAD.DatabaseServices.ClipBoundaryType,Autodesk.AutoCAD.Geometry.Point2dCollection)
Specifies a polygonal clip boundary. The clip boundary must be closed, the last point being identical to the first point. The value of type must match the shape of the points in the array.
type: Clip boundary type.
clipBoundaryVertices: Array of clip boundary vertices.

Autodesk.AutoCAD.DatabaseServices.RasterImage.SetClipBoundary(Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.DatabaseServices.RasterImage.GetClipBoundary
Returns an array of clip boundary vertices in image pixel coordinates.
Returns: An array of clip boundary vertices in image pixel coordinates.

Autodesk.AutoCAD.DatabaseServices.RasterImage.GetVertices
Given an empty array, this method adds the image frame vertices to it. These points represent either the four corners of the image, or if the image is clipped, the vertices of a polygonal clip boundary.
Returns: A 3D point array.

Autodesk.AutoCAD.DatabaseServices.RasterImage.{dtor}
