Autodesk.AutoCAD.GraphicsSystem.RendererType
Enum whose values control a renderer type set by an Device.

Autodesk.AutoCAD.GraphicsSystem.RendererType.Default
The default rendering stack configuration.

Autodesk.AutoCAD.GraphicsSystem.RendererType.SelectionRender


Autodesk.AutoCAD.GraphicsSystem.RendererType.FullRender
The high-end renderer (mental ray) will be used for rendering.

Autodesk.AutoCAD.GraphicsSystem.RendererType.SoftwareNewViewsOnly
Use software acceleration regardless of the settings in the GS configuration for new views only.

Autodesk.AutoCAD.GraphicsSystem.RendererType.Software
Use software acceleration regardless of the settings in the GS configuration.