Autodesk.AutoCAD.DatabaseServices.Vertex
The Vertex class is the base class for all the vertex types used by the Polyline2d, Polyline3d, PolyFaceMesh, and PolygonMesh classes within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Vertex.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Vertex.{dtor}
