Autodesk.AutoCAD.DatabaseServices.JoinStyle
Lineweight joint style.

Autodesk.AutoCAD.DatabaseServices.JoinStyle.StyleFlat
Lineweight joint style is flat.

Autodesk.AutoCAD.DatabaseServices.JoinStyle.StyleAngle
Lineweight joint style is angle.

Autodesk.AutoCAD.DatabaseServices.JoinStyle.StyleRound
Lineweight joint style is round.

Autodesk.AutoCAD.DatabaseServices.JoinStyle.StyleNone
Lineweight joint style is none.