Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits
Represents a spotlight source. Spotlights emit lights in a specific direction, and have an associated "light cone".

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.Attenuation
Gets or sets the attenuation parameters for this light.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.Falloff
Gets the falloff angle of this spotlight.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.Hotspot
Gets the hotspot angle of this spotlight.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.TargetLocation
Gets or sets the location (position) towards which the spot light is "pointing" in the coordinate space of the current context.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.Position
Gets or sets the position of this light in the coordinate space of the current context.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.SetHotspotAndFalloff(System.Double,System.Double)
Sets the hotspot and falloff angles for this light, in radians.
hotspot: Hotspot cone angle, in radians. Defines the brightest part of the spot light beam. Must be smaller than or equal to the falloff angle.
falloff: Falloff angle, in radians. Defines the full cone of light. This is also known as the field angle. Must be larger than or equal to the hotspot.
Returns: true if successful.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.{dtor}
