Autodesk.AutoCAD.DatabaseServices.XrefObjectId
Provides a convenient way to refer to a specific DBObject within an xref'd database.XrefObjectId is persistent across drawing sessions.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Handle)
Constructor.
XrefBlockTableRecordId: Block table record of the xref as it exists in the host database.
hand: Handle of the object within the xref database.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Constructor.
LocalId: Object ID of the object local to the host database.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.Handle
Gets handle of the object within the xref database.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.ObjectId
Gets ObjectId of the object within the xref.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.IsNull
Gets true if the object does not refer to any object.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.IsXref
Gets true if this object refers to an object in an xref database.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.IsValid
Gets true if the xref is loaded and the handle is valid within that xref.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.XrefObjectId.ResolveObjectId
Returns the ID of the object within the xref.
Returns: ID of the object within the xref.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.Serialize
Returns the first and last entries in a Result Buffer object containing the information necessary to persist the reference across drawing sessions.
Returns: The first and last entries.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.Deserialize(Autodesk.AutoCAD.DatabaseServices.ResultBuffer,Autodesk.AutoCAD.DatabaseServices.ResultBuffer@)
Processes a Result Buffer object(created by Serialize()) that contains the information necessary for persisting the reference across drawing sessions.
rbStart: Head of a Result Buffer object containing the information necessary for persisting the reference across drawing sessions.
rbEnd: Tail of a Result Buffer object containing the information necessary for persisting the reference across drawing sessions.
Returns: Result Buffer object that follows after the xref information.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.op_Inequality(Autodesk.AutoCAD.DatabaseServices.XrefObjectId,Autodesk.AutoCAD.DatabaseServices.XrefObjectId)


Autodesk.AutoCAD.DatabaseServices.XrefObjectId.op_Equality(Autodesk.AutoCAD.DatabaseServices.XrefObjectId,Autodesk.AutoCAD.DatabaseServices.XrefObjectId)
