Autodesk.AutoCAD.DatabaseServices.Extents3d
This class was designed to be used with the GeometricExtents property of Entity-derived classes. It embodies a box in 3D space whose edges are parallel to the axes of the WCS. This box is represented in the private data of an Extents3d object as a minimum point (MinPoint) and a maximum point (MaxPoint). At all times except immediately after an Extents3d object has been instantiated with the default constructor, each of the X, Y, and Z values of MinPoint must be less than the corresponding values of MaxPoint.

Autodesk.AutoCAD.DatabaseServices.Extents3d.#ctor
Default constructor.This is typically used to initialize an Extents3d object prior to calling GeometricExtents.It sets the MinPoint to a very big value (10 to the 20th power) and the MaxPoint to a very small value (minus 10 to the 20th power). Note that at this stage the object is in an invalid state, since its MinPoint is bigger than its MaxPoint.

Autodesk.AutoCAD.DatabaseServices.Extents3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructer. Initialize MinPoint to min and MaxPoint to max if each of the X, Y, and Z values of min are less than the corresponding values of max.
min: Minimum extent.
max: Maximum extent.

Autodesk.AutoCAD.DatabaseServices.Extents3d.MaxPoint
Gets the point of the Extents box that has the smallest X, Y, Z coordinate values.

Autodesk.AutoCAD.DatabaseServices.Extents3d.MinPoint
Gets the point of the Extents box that has the largest X, Y, Z coordinate values.

Autodesk.AutoCAD.DatabaseServices.Extents3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Sets MinPoint to min and MaxPoint to max if each of the X, Y, and Z values of min are less than the corresponding values of max.
min: Minimum extent.
max: Maximum extent.

Autodesk.AutoCAD.DatabaseServices.Extents3d.AddPoint(Autodesk.AutoCAD.Geometry.Point3d)
Expands this box to also enclose the point pt.
pt: 3D point to be added.

Autodesk.AutoCAD.DatabaseServices.Extents3d.AddExtents(Autodesk.AutoCAD.DatabaseServices.Extents3d)
Expands the box defined by this object to also enclose the box defined by source.
source: Another Extents3d object.

Autodesk.AutoCAD.DatabaseServices.Extents3d.AddBlockExtents(Autodesk.AutoCAD.DatabaseServices.BlockTableRecord)
Computes the minimum box that encloses all of the entities in the block pointed to by pointerToBlockTableRecord and the box already defined by this object.
pointerToBlockTableRecord: A block table record.

Autodesk.AutoCAD.DatabaseServices.Extents3d.ExpandBy(Autodesk.AutoCAD.Geometry.Vector3d)
Expands this box by the amount in the vector.
vector: 3D vector.

Autodesk.AutoCAD.DatabaseServices.Extents3d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transforms the eight corners of the current box by this matrix and compute the box that encloses the current box and those points.
mat: 3D transformation matrix.

Autodesk.AutoCAD.DatabaseServices.Extents3d.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj: An object.
Returns: True if this object is identical to the argument object.

Autodesk.AutoCAD.DatabaseServices.Extents3d.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Extents3d)
Returns a value indicating whether the minimum and maximum points of a are equivalent to those of this object. Tolerance is set to Global for this overload.
a: An Extents3d object.
Returns: A value indicates whether the minimum and maximum points of a are equivalent to those of this object.

Autodesk.AutoCAD.DatabaseServices.Extents3d.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Extents3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns a value indicating whether the minimum and maximum points of a are equivalent, within the tolerance range specified by tolerance, to those of this object.
a: An Extents3d object.
tolerance: The tolerance range.
Returns: A value indicates whether the minimum and maximum points of a are equivalent to those of this object.

Autodesk.AutoCAD.DatabaseServices.Extents3d.GetHashCode
Returns the hash code for this object.
Returns: The hash code for this object.

Autodesk.AutoCAD.DatabaseServices.Extents3d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.Extents3d.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.Extents3d.op_Inequality(Autodesk.AutoCAD.DatabaseServices.Extents3d,Autodesk.AutoCAD.DatabaseServices.Extents3d)


Autodesk.AutoCAD.DatabaseServices.Extents3d.op_Equality(Autodesk.AutoCAD.DatabaseServices.Extents3d,Autodesk.AutoCAD.DatabaseServices.Extents3d)
