Autodesk.AutoCAD.DatabaseServices.Ole2Frame.ItemType
This enumeration lists the possible types of an Ole2Frame object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.ItemType.Embedded
Ole2Frame is an embedded object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.ItemType.Link
Ole2Frame is a link object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.ItemType.Static
Ole2Frame is a static.