Autodesk.AutoCAD.Colors.ColorConverter
Performs conversions between Autodesk.AutoCAD.Colors.Color objects and ACI, RGB, and AutoCAD Color Book names.

Autodesk.AutoCAD.Colors.ColorConverter.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Colors.ColorConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
Returns true if sourceType can be converted to this type.
context: System.ComponentModel.ITypeDescriptorContext object.
sourceType: Source type.
Returns: true if sourceType can be converted to this type.

Autodesk.AutoCAD.Colors.ColorConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)


Autodesk.AutoCAD.Colors.ColorConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
