Autodesk.AutoCAD.DatabaseServices.RotationAngle
Specifies the text rotation angle within table cells.

Autodesk.AutoCAD.DatabaseServices.RotationAngle.DegreesUnknown
Unknown rotation angle.

Autodesk.AutoCAD.DatabaseServices.RotationAngle.Degrees270
270 degree rotation.

Autodesk.AutoCAD.DatabaseServices.RotationAngle.Degrees180
180 degree rotation.

Autodesk.AutoCAD.DatabaseServices.RotationAngle.Degrees090
90 degree rotation.

Autodesk.AutoCAD.DatabaseServices.RotationAngle.Degrees000
0 degree rotation.