Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.NumberOfControlPointsInV
Gets number of control points in U direction.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.NumberOfControlPointsInU
Gets number of control points in V direction.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.PropertiesInV
Gets V properties.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.PropertiesInU
Gets U properties.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.DegreeInV
Gets V degree.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.DegreeInU
Gets U degree.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.VKnots
Gets V array of knots.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.UKnots
Gets U array of knots.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.Weights
Gets array of weights.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.ControlPoints
Gets array of control points.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.Equals(System.Object)


Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.IsEqualTo(Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition)


Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.GetHashCode


Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.op_Inequality(Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition,Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition)


Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.op_Equality(Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition,Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition)
