Autodesk.AutoCAD.GraphicsInterface.DiagnosticPhotonMode
The type of photon information to visualize with the photon diagnostic mode.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticPhotonMode.Irradiance
BSP leaf size: the leaf size in the BSP tree reached.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticPhotonMode.Density
BSP depth: the depth of the BSP tree reached.