Autodesk.AutoCAD.DatabaseServices.FileDependencyManager
Allows management, creation, deletion, and retrieval of entries in the File Dependency List DWG section.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.IteratorNext
Gets the index of the next entry in the File Dependency List.This index can then be passed to the GetXXX() methods to get the entry.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.CountEntries
Gets the number of unique entries in the File Dependency List.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.CreateEntry(System.String,System.String,System.Boolean,System.Boolean)
Creates a new File Dependency List entry.
feature: String describing the application or feature creating the entry.
fullFileName: Name of the file being stored in the File Dependency List.
affectsGraphics: true means that the entry affects the on-screen view of the DWG file;false means it does not affect the on-screen view.
noIncrement: true does not increment the reference count on existing entries; false increments the reference count when an existing entry is added.
Returns: The unique ID created for the entry,or zero if the entry was not created.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.UpdateEntry(System.Int32)
A shortcut for erasing and recreating the File Dependency List entry identified by index.
index: Index of the entry in the File Dependency List.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.UpdateEntry(System.String,System.String)
A shortcut for erasing and recreating the File Dependency List entry identified by feature and fullFileName.
feature: Feature string of the entry.
fullFileName: File name of the entry.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.EraseEntry(System.Int32,System.Boolean)
Erases the entry identified by index from the File Dependency List if its reference count equals 1.
index: Index of the entry to remove.
forceRemove: True removes an entry with multiple references regardless of its reference count; false removes it only if the reference count is zero.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.EraseEntry(System.String,System.String,System.Boolean)
Erases the entry identified by feature and fullFileName from the File Dependency List if its reference count equals 1.
feature: Feature string of the entry to erase.
fullFileName: File name of the entry to erase.
forceRemove: True removes an entry with multiple references regardless of its reference count; false removes it only if the reference count is zero.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.IteratorInitialize(System.String,System.Boolean,System.Boolean,System.Boolean)
Initializes an iterator for the File Dependency List.
feature: Feature name of entries to be returned using the iterator; can be null.
modifiedOnly: True gets only those entries that were modified since the last save; false gets entries regardless of whether they were modified.
affectsGraphicsOnly: True gets only those entries that have the affectsGraphics bits set; false gets entries regardless of the affectGraphics bits.
walkXRefTree: True creates an iterator that automatically iterates over the entries of File Dependency Lists in xref'd drawings; false creates an iterator to iterate over only entries in the local list.

Autodesk.AutoCAD.DatabaseServices.FileDependencyManager.{dtor}
