Autodesk.AutoCAD.DatabaseServices.SweptSurface
Represents a swept surface entity. It provides methods to create and manipulate ASM surfaces.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SweptSurface.SweepOptions
Gets or sets the sweep options associated with this surface.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.PathLength
Gets the length of the path curve.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.PathEntity
Gets the sweep path of this surface.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.SweepEntity
Gets the sweep entity that describes this surface.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.CreateSweptSurface(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Creates a swept surface by sweeping a curve, region, or planar surface (sweepEnt) along the path curve pathEnt.
sweepEnt: The curve, region, or planar surface to be swept.
pathEnt: The curve entity that specifies the path along which sweepEnt is to be swept.
sweepOptions: Sweep options.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.{dtor}
