Autodesk.AutoCAD.DatabaseServices.AttributeDefinition
Represents the ATTDEF entity within AutoCAD. ATTDEF entities are used within block definitions (BlockTableRecords) for AutoCAD to use as templates for creating ATTRIB entities (AttributeReference objects) when an INSERT (BlockReference) is created that references the block definition.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.String,System.String,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor initializes the AttributeDefinition object with the arguments passed in. position must be in WCS coordinates. Copies of the value, tag, and prompt strings are used, so the caller is responsible for the memory used by the strings passed in. If used, style must be a valid TextStyleTableRecord object ID.
position: Location point for the attdef.
value: Text string for the attdef.
tag: Tag string for the attdef.
prompt: Prompt string for the attdef.
style: Object ID of the TextStyleTableRecord to be referenced by the attribute.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.#ctor
Default constructor. Initializes the field length to 0, the flags to 0 (that is, nonconstant, visible, not preset, and not verifiable), and the tag to 0. In addition, all the initializations for a default new DBText object take place.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.LockPositionInBlock
Gets or sets true if the AttributeDefinition object is set to be immmovable relative to the geometry in the block.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.FieldLength
Gets or sets the AttributeDefinition's field length value. This value is not currently used within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Preset
Gets or sets true if the AttributeDefinition object has a preset value and will not prompt for user input.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Verifiable
Gets or sets true if the attribute object is set to verify user input.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Constant
Gets or sets true if the AttributeDefinition object is set to be constant.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Invisible
Gets or sets true if the AttributeDefinition object is set to be invisible.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Tag
Gets or sets a copy of the tag string for the attribute. The tag string is the identifier you see on screen to represent the AttributeDefinition.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Prompt
Gets or sets a copy of the prompt string for the AttributeDefinition object. When the BlockTableRecord containing the AttributeDefinition is inserted and an AttributeReference object is created using the AttributeDefinition as the template, the prompt string is displayed to ask the user to input a text string for the AttributeReference.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.{dtor}
