Autodesk.AutoCAD.DatabaseServices.HostApplicationServices
Provides various services to host applications at runtime.These services are defined by the Autodesk? RealDWG client.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.ModelerFlavor
Gets the level of geometric modeler support available from the Autodesk RealDWG host application.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.FontMapFileName
Gets the name of the fontmap file. The fontmap file is a file containing a list of font names and substitute fonts to use in place of the named fonts.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.AlternateFontName
Gets the name of the alternate font, that is, the default font to use in the event that any font cannot be found.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.LocalRootFolder
Gets the local directory.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.RoamableRootFolder
Gets the local roamable files directory.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.WorkingDatabase
Gets or sets the primary database open in whichever document (window) has focus.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.RegistryProductRootKey
Gets the registry root path of the host application, which is "SOFTWARE\Autodesk\AutoCAD\R17.0" for AutoCAD 2007 and "SOFTWARE\Autodesk\ObjectDBX\R17.0" for host applications built with the 2007 version of the Autodesk RealDWG SDK.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.CompanyName
Gets "About" information.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.Product
Gets "About" information.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.Program
Gets "About" information.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.Current
Gets or sets instance of services.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.FindFile(System.String,Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.FindFileHint)
This method is called by the database code when it is trying to locate a file.
fileName: Given name of the file to find.
database: If the caller passes you a database, use it to call database.GetFilename(). This will give you the path to the DWG file associated with the database, which may also be searched for the requested file. If this file search is not related to a database,database will be null.
hint: Caller may pass you a hint, that you may choose to use to narrow your search.
Returns: The full path of the requested file.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.LoadApplication(System.String,Autodesk.AutoCAD.DatabaseServices.ApplicationLoadReasons,System.Boolean,System.Boolean)
Loads the appName ObjectARX program.
appName: String which is the application name (as set in the system registry) of the ObjectARX module to load.
why: ApplicationLoadReasons values to use during this load.
printIt: Boolean indicating whether or not to print load status message.
asCmd: Boolean indicating whether to load the application as if by user command.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.IsUrl(System.String)
Determines whether the string filePath refers to a valid URL.
filePath: String to be evaluated.
Returns: True if the string filePath refers to a valid URL.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetUrl(System.String)


Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetRemoteFile(System.Uri,System.Boolean)
Downloads the resource (file) identified by the URL url to the return local file.
url: URL.
ignoreCache: Boolean indicating whether to download the file even if it has be cached earlier in the session.
Returns: The local file name.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.PutRemoteFile(System.Uri,System.String)
Uploads a local resource (file) identified by the pathname localFile to the remote location specified by the URL url.
url: URL to which to upload file.
localFile: Local file to upload.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetPassword(System.String,Autodesk.AutoCAD.DatabaseServices.PasswordOptions)
Called internally by host applications such as AutoCAD and other ObjectARX applications (via the ReadDwgFile() method) to display a password-request dialog box.
dwgName: Name of the drawing file that is requiring a password.
options: Boolean indicating whether dwgName refers to an xref's drawing.
Returns: Password obtained from the user.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.{dtor}
