Autodesk.AutoCAD.GraphicsInterface.DisplayStyle
Defines a collection of display properties that can be applied to graphical entities.

Autodesk.AutoCAD.GraphicsInterface.DisplayStyle.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.DisplayStyle.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.DisplayStyle.ShadowType
Gets or sets the shadow type currently in effect.

Autodesk.AutoCAD.GraphicsInterface.DisplayStyle.Brightness
Gets or sets the brightness value that is currently in effect.

Autodesk.AutoCAD.GraphicsInterface.DisplayStyle.DisplaySettings
Gets or sets unsigned long representing the collection of display settings flags that are in effect.

Autodesk.AutoCAD.GraphicsInterface.DisplayStyle.Clone
Returns a copy of this object.
Returns: A copy of this object.

Autodesk.AutoCAD.GraphicsInterface.DisplayStyle.Set(Autodesk.AutoCAD.GraphicsInterface.DisplayStyle)
Initializes this display style with the values of the given display style.
style: A constant reference to the display style that will be copied into this display style .

Autodesk.AutoCAD.GraphicsInterface.DisplayStyle.{dtor}
