Autodesk.AutoCAD.DatabaseServices.DBText
The DBText class is the representation for the TEXT entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.DBText.#ctor
Default constructor. Initializes the insertion point to (0,0,0), the alignment point to (0,0,0), the obliquing angle to 0.0, the rotation angle to 0.0, the height to 0.0, the width factor to 1.0, the text string to null, the textStyle object ID to ObjectId.Null, mirroring to false, horizontal mode to TextHorizontalMode.TextLeft, vertical mode to TextVerticalMode.TextBase, the normal vector to (0,0,1), and the thickness to 0.0.

Autodesk.AutoCAD.DatabaseServices.DBText.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DBText.VerticalMode
Gets or sets the vertical mode of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.HorizontalMode
Gets or sets the horizontal mode of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.IsMirroredInY
Gets or sets true if the text is mirrored in the Y direction (that is, it appears to be upside down).

Autodesk.AutoCAD.DatabaseServices.DBText.IsMirroredInX
Gets or sets true if the text is mirrored in the X direction (that is, it appears backward in the horizontal direction).

Autodesk.AutoCAD.DatabaseServices.DBText.TextStyle
Gets or sets the object ID of the TextStyleTableRecord in used by the DBText object.

Autodesk.AutoCAD.DatabaseServices.DBText.TextString
Gets or sets a copy of the null-terminated text string used by the DBText object. The text string can be up to 256 bytes long (not including the null terminator).

Autodesk.AutoCAD.DatabaseServices.DBText.WidthFactor
Gets or sets the width factor (also referred to as the relative X-scale factor) for the text. The WidthFactor is applied to the text's width to allow the width to be adjusted independently of the height.

Autodesk.AutoCAD.DatabaseServices.DBText.Height
Gets or sets the height of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.Rotation
Gets or sets the rotation angle of the text. The rotation angle is relative to the X axis of the text's OCS, with positive angles going counterclockwise when looking down the Z axis towards the origin. The OCS X axis is determined by using the text's normal, the WCS Z axis, and the arbitrary axis algorithm.

Autodesk.AutoCAD.DatabaseServices.DBText.Oblique
Gets or sets the oblique angle (in radians) of the text. The obliquing angle is the angle from the text's vertical; that is, the top of the text "slants" relative to the bottom, the same as the slope in this italic text. Positive angles slant characters forward at their tops. Negative angles have 2pi added to them to convert them to their positive equivalent.

Autodesk.AutoCAD.DatabaseServices.DBText.Thickness
Gets or sets the thickness of the text. The thickness is the text's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.DBText.Normal
Gets or sets the normal vector of the plane containing the text. The normal vector is in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.DBText.IsDefaultAlignment
Gets true if the text is in a default alignment.Default alignment is when horizontal mode is TextHorizontalMode.TextLeft and vertical mode is TextVerticalMode.TextBase, or when horizontal mode is TextVerticalMode.TextMiddle

Autodesk.AutoCAD.DatabaseServices.DBText.AlignmentPoint
Gets or sets the alignment point of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.Position
Gets or sets the insertion point of the text in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.DBText.CorrectSpelling
Runs the spell checker on the text to correct any spelling errors.
Returns: 0 if completed successfully (with errors fixed or no errors found), otherwise returns 1.

Autodesk.AutoCAD.DatabaseServices.DBText.AdjustAlignment(Autodesk.AutoCAD.DatabaseServices.Database)
Allows a way to cause the text to be adjusted on non-database resident text entities or text entities within transactions.
alternateDatabaseToUse: Database to be used if the text entity is not in a database (this argument is ignored if the text entity is in a database).

Autodesk.AutoCAD.DatabaseServices.DBText.{dtor}
