Autodesk.AutoCAD.DatabaseServices.SectionHitTestInfo
This class is a container fot the hit test information returned by DatabaseServices.Section.HitTest().

Autodesk.AutoCAD.DatabaseServices.SectionHitTestInfo.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.SectionHitTestInfo.SubItem
One or more of the SubItem enum values.

Autodesk.AutoCAD.DatabaseServices.SectionHitTestInfo.PtOnSegment
The actual point on the section plane geometry.

Autodesk.AutoCAD.DatabaseServices.SectionHitTestInfo.Index
Zero-based index of the segment on the section line, which passes near or through the hit point.