Autodesk.AutoCAD.DatabaseServices.Group
Represents a collection of entities referred to by a single name.

Autodesk.AutoCAD.DatabaseServices.Group.#ctor(System.String,System.Boolean)
Initializes the group object to use a copy of the description string as the description.
description: String describing the group.
selectable: Boolean value indicating whether the group is selectable or not.

Autodesk.AutoCAD.DatabaseServices.Group.#ctor
Default constructor.Initializes the group description string to null,Selectable to true,and the entities list to empty.Before the Group object can be added to a database, it must have its Group.Description property called to set a valid description string.

Autodesk.AutoCAD.DatabaseServices.Group.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Group.NumEntities
Gets the number of entities in the group.

Autodesk.AutoCAD.DatabaseServices.Group.IsAnonymous
Gets true if the group is an anonymous group.

Autodesk.AutoCAD.DatabaseServices.Group.IsNotAccessible
Gets true if the group is marked as inaccessible,otherwise returns false. Currently, only groups in Xrefs are marked as inaccessible.

Autodesk.AutoCAD.DatabaseServices.Group.Name
Gets or sets the name of the group.

Autodesk.AutoCAD.DatabaseServices.Group.Selectable
Gets or sets a Boolean indicating whether the group is selectable.

Autodesk.AutoCAD.DatabaseServices.Group.Description
Gets or sets the group description string.

Autodesk.AutoCAD.DatabaseServices.Group.SetAnonymous
Sets the group to be anonymous. The group's current name will be replaced by an automatically generated anonymous group name.

Autodesk.AutoCAD.DatabaseServices.Group.Append(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Appends the objects whose objectIds are in the ids array to the group.
ids: ObjectId array containing the objectIds of the objects to be appended.

Autodesk.AutoCAD.DatabaseServices.Group.Append(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Appends the object identified by id to the group.
id: ObjectId of the object to be appended to group.

Autodesk.AutoCAD.DatabaseServices.Group.Prepend(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Prepends the objects whose objectIds are in the ids array to the group.
ids: ObjectId array containing the objectIds of the objects to be prepended.

Autodesk.AutoCAD.DatabaseServices.Group.Prepend(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Prepends the object identified by id to the group.
id: ObjectId of the object to be prepended to group.

Autodesk.AutoCAD.DatabaseServices.Group.InsertAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Inserts the objects whose objectIds are in the ids array into the group just after the entry at index index. The indices are zero based. Hence the first element in the group will have an index of 0.
index: Insertion index.
ids: ObjectId array containing objects to be inserted.

Autodesk.AutoCAD.DatabaseServices.Group.InsertAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Inserts the object specified by id into the group just after the entry at index index. The indices are zero based. Hence the first element in the group will have an index of 0.
index: Insertion index.
id: ObjectId of the object to be inserted.

Autodesk.AutoCAD.DatabaseServices.Group.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Removes from the group, all objects whose object IDs are in the ids array.
ids: Array of objectIds of objects to be removed from the group.

Autodesk.AutoCAD.DatabaseServices.Group.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes from the group, the object whose object ID is id.
id: ObjectId of the object to be removed.

Autodesk.AutoCAD.DatabaseServices.Group.RemoveAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Removes, from the group, the objects whose object IDs are in the ids array. All objects must be in the group and be at index locations equal to or higher than index.
index: Starting index of the objects to be removed.
ids: ObjectId array of objects to be removed after start index.

Autodesk.AutoCAD.DatabaseServices.Group.RemoveAt(System.Int32)
Removes from the group, the object at the index index.
index: Index of the object to be removed.

Autodesk.AutoCAD.DatabaseServices.Group.Replace(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Replaces the oldId entity with the newId entity in the group.
oldId: ObjectId of the object to be removed from the group.
newId: ObjectId of the object to be added to the group in place of oldId.

Autodesk.AutoCAD.DatabaseServices.Group.Transfer(System.Int32,System.Int32,System.Int32)
Starting with the item at index fromIndex and going upwards in index values, this method transfers numItems from the index fromIndex to the index toIndex.
fromIndex: Start index to transfer from.
toIndex: Start index to transfer to.
numItems: Number of items to transfer.

Autodesk.AutoCAD.DatabaseServices.Group.Clear
Resets or clears the contents of a group. After this method is called the group contains no elements. All other settings in the group remain unchanged (for example, Name, Description, ColorIndex, etc.).

Autodesk.AutoCAD.DatabaseServices.Group.Has(Autodesk.AutoCAD.DatabaseServices.Entity)
Look for the entity pointed to by entity.
entity: The entity being looked up.
Returns: True if entity is present in the group.

Autodesk.AutoCAD.DatabaseServices.Group.GetAllEntityIds
Gets an ObjectIdCollection containing the ObjectIds of the entities in the group.
Returns: An ObjectIdCollection containing the ObjectIds of the entities in the group.

Autodesk.AutoCAD.DatabaseServices.Group.GetIndex(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the index value in the group of the object with ObjectId id.
id: ObjectId of the object whose index is being queried.
Returns: Index of the object identified by id.

Autodesk.AutoCAD.DatabaseServices.Group.Reverse
Reverses the indices of all the objects in the group. The first object in the group will become the last object in the group, and so on.

Autodesk.AutoCAD.DatabaseServices.Group.SetColor(Autodesk.AutoCAD.Colors.Color)
All the entities in the group will be set to the color specified by color.
color: Color object representing the color to be set.

Autodesk.AutoCAD.DatabaseServices.Group.SetColorIndex(System.Int32)
All the entities in the group will be set to the color specified by color.
color: AutoCAD color index to be set for entities in the group (color index must be in the range 0 to 256).

Autodesk.AutoCAD.DatabaseServices.Group.SetLayer(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets all entities in the group to use the LayerTableRecord with objectId value.
value: ObjectId of the layer to use.

Autodesk.AutoCAD.DatabaseServices.Group.SetLayer(System.String)
Sets the LayerTableRecord with name value to be the layer for all entities in the group. If the layer specified by value exists, the entities will be modified to reference that layer. If the layer does not exist, a layer of name value is created before modifying the entities.
value: String that is the name of the new layer.

Autodesk.AutoCAD.DatabaseServices.Group.SetLinetype(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the LinetypeTableRecord with objectId value to be the line type for all entities in the group.
value: ObjectId of the line type.

Autodesk.AutoCAD.DatabaseServices.Group.SetLinetype(System.String)
Sets the LinetypeTableRecord with objectId value to be the line type for all entities in the group.
value: String that is the name of the new line type.

Autodesk.AutoCAD.DatabaseServices.Group.SetLinetypeScale(System.Double)
Sets the line type scale to value for all entities in the group.
value: New value for the line type scale.

Autodesk.AutoCAD.DatabaseServices.Group.SetVisibility(System.Boolean)
Sets the visibility to value for all entities in the group.
value: Boolean value for visibility.

Autodesk.AutoCAD.DatabaseServices.Group.SetHighlight(System.Boolean)
If value == true, then all entities in the group will be highlighted.
value: Boolean indicating whether to highlight or not.

Autodesk.AutoCAD.DatabaseServices.Group.{dtor}
