Autodesk.AutoCAD.DatabaseServices.Circle
Represents the circle entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Circle.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Initializes the circle with the arguments center, normal, and radius.
center: Center point for the circle.
normal: Normal vector for circle.
radius: Radius for circle.

Autodesk.AutoCAD.DatabaseServices.Circle.#ctor
Default constructor. Initializes the center to (0,0,0), the radius to 0.0, and the normal to (0,0,1). The radius needs to be set to a value greater than 0.0 before the object is first closed. All coordinates are WCS.

Autodesk.AutoCAD.DatabaseServices.Circle.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Circle.Normal
Gets or sets the WCS unit normal to the plane containing the circle.

Autodesk.AutoCAD.DatabaseServices.Circle.Thickness
Gets or sets the thickness of the circle. The thickness is the circle's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.Circle.Radius
Gets or sets the radius of the circle.

Autodesk.AutoCAD.DatabaseServices.Circle.Center
Gets or sets the center point of the circle in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Circle.{dtor}
