Autodesk.AutoCAD.GraphicsInterface.ChannelFlags
Enumeration of Material Channels in use.

Autodesk.AutoCAD.GraphicsInterface.ChannelFlags.UseAll
Use all material channels.

Autodesk.AutoCAD.GraphicsInterface.ChannelFlags.UseRefraction


Autodesk.AutoCAD.GraphicsInterface.ChannelFlags.UseBump


Autodesk.AutoCAD.GraphicsInterface.ChannelFlags.UseOpacity


Autodesk.AutoCAD.GraphicsInterface.ChannelFlags.UseReflection


Autodesk.AutoCAD.GraphicsInterface.ChannelFlags.UseSpecular


Autodesk.AutoCAD.GraphicsInterface.ChannelFlags.UseDiffuse


Autodesk.AutoCAD.GraphicsInterface.ChannelFlags.None
