Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord
This class is the base class for the ViewTableRecord and ViewportTableRecord classes.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.VisualStyleId
Gets or sets the object ID of the visual style in effect for this viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Background
Gets or sets the object ID of the background corresponding to this view. Returns null if no background has been defined for this view.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.ViewOrthographic
Gets true if the view direction is orthographic relative to the UCSBASE system variable.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Elevation
Gets the elevation of the UCS plane for the view or viewport table record. This property gets 0 if called for an ViewTableRecord that has no associated UCS.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.UcsName
Gets the object ID of an UcsTableRecord if the UCS of the view or viewport table record is a named UCS. This property will get a null id if the UCS is not named or if it is called for a ViewTableRecord that has no associated UCS.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.UcsOrthographic
Gets false if the record's associated UCS does not have an orthographic view whose reference UCS matches the database's UCSBASE system variable, or if called for a ViewTableRecord that has no associated UCS. If this property gets true, then view is set to the orthographic view of the UCS.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Ucs
Gets origin, xAxis, and yAxis that is defined for the view or viewport table record.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SunId
Gets the object Id of a Sun object associated with this viewport. If there is no sun currently associated with this viewport, then it gets null.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.AmbientLightColor
Gets or sets the ambient light color for the viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Contrast
Gets or sets the overall contrast factor of the viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Brightness
Gets or sets the brightness factor for this viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.DefaultLightingType
Gets or sets the type of default lighting being used in the viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.DefaultLightingOn
Gets or sets true if any kind of default lighting is on.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.RenderMode
Gets the current RenderMode for this view.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.FrontClipAtEye
Gets or sets true if the front clipping plane is currently located at the camera; otherwise, gets or sets false.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.BackClipEnabled
Gets or sets true if the back clipping plane is currently turned on in the TableRecord; otherwise, gets or sets false.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.FrontClipEnabled
Gets or sets true if the front clipping plane is currently turned On in the TableRecord; otherwise, gets or sets false.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.PerspectiveEnabled
Gets or sets true if perspective mode is currently set to On in the TableRecord. Otherwise, gets or sets false.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.BackClipDistance
Gets or sets the distance (along the camera-target line) from the target to the back clipping plane. Positive values indicate that the clipping plane is in front of the target (that is, between the target and the camera). Negative values indicate the clipping plane is behind the target.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.FrontClipDistance
Gets or sets the distance (along the camera-target line) from the target to the front clipping plane. Positive values indicate that the clipping plane is in front of the target (that is, between the target and the camera). Negative values indicate the clipping plane is behind the target.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.LensLength
Gets or sets the lens length used when perspective mode is on in the TableRecord.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.ViewTwist
Gets or sets the twist angle (in radians) of the view in the viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.ViewDirection
Gets or sets a Vector3d that is the vector (in WCS coordinates) from the view's target to the view's camera. This also represents the point coordinate set by the AutoCAD VPOINT command. See the AutoCAD VPOINT command documentation for more information on view direction.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Target
Gets or sets a Point3d that is the WCS location of the view's target.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Width
Gets or sets the width of the view in DCS coordinates. Zooming out within the viewport (and then resaving the view if it's a ViewTableRecord) will increase this value. Zooming in (and resaving if appropriate) will decrease this value.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Height
Gets or sets the height of the view in DCS coordinates. Zooming out within the viewport (and then resaving the view if it's a ViewTableRecord) will increase this value. Zooming in (and resaving if appropriate) will decrease this value.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.CenterPoint
Gets or sets the center point of the view in DCS coordinates.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetSun(Autodesk.AutoCAD.DatabaseServices.DBObject)
Sets the object id to associate a sun object with this viewport.
sun: A sun object.
Returns: Object ID of the Sun object.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcs(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the UCS for the view or viewport table record. The new UCS will be named and UcsId must reference a valid UcsTableRecord object.
id: An UcsTableRecord object.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcs(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets the UCS for the view or viewport table record.The new UCS will be unnamed and will be set to the orthographic UCS specified by view (relative to UCSBASE).
view: An orthographic UCS view.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcs(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the UCS for the view or viewport table record.The new UCS will be unnamed and is defined by origin, x, and y.
origin: An orthographic UCS view.
x: An orthographic UCS view.
y: An orthographic UCS view.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetViewDirection(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets the view direction of the view or view table record to the specified orthographic view (relative to UCSBASE).
view: An orthographic view.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.{dtor}
