Autodesk.AutoCAD.DatabaseServices.RevolveOptions
Utility class for setting options used by CreateRevolvedSurface() and CreateRevolvedSolid(). These options can be used to control the shape of the resulting surface or solid. The default constructor for this class assigns default values to these options.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.#ctor(Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
Copy constructor.
opts: Object to be copied into 'this'.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.CloseToAxis
Gets the close to axis option. If this option is set for an open profile, then the ends of the profile will be extended to the axis of revolution before revolving. The default value of this option is false.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.TwistAngle
Gets the angle by which the profile will be twisted as it revolves around the axis. The default value of this option is 0.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.DraftAngle
Gets the draft angle in radians.This is the angle by which profile will taper as it is revolved around the axis. The default value of this option is 0.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.Clone


Autodesk.AutoCAD.DatabaseServices.RevolveOptions.CheckRevolveCurve(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean)
Checks whether __unnamed000 is valid for revolve operation.
__unnamed000: The curve or region to be revolved.
axisPnt: Point on axis of revolution.
axisDir: Direction of axis of revolution.
displayErrorMessages: Boolean value indicates whether to display error messages.
Returns: RevolveOptionsCheckRevolveCurveOut object.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.{dtor}
