Autodesk.AutoCAD.DatabaseServices.SubentityId
An entity can be composed of many graphic subentities, such as arcs, lines, text, vertices, edges, faces, etc. This class creates subentity IDs using one of these subentities and an index. The index is the graphics system marker for the subentity.

Autodesk.AutoCAD.DatabaseServices.SubentityId.#ctor(Autodesk.AutoCAD.Runtime.RXClass,System.Int32)
Constructs a new SubentityId with the specified type class and index,using type SubentityType.Class
classType: The RXClass for the subentity.
i: The index of the subentity.

Autodesk.AutoCAD.DatabaseServices.SubentityId.#ctor(Autodesk.AutoCAD.DatabaseServices.SubentityType,System.Int32)
Initializes subentity type and index of object with type and i.
type: Subentity type of object.
i: The graphics system marker for the desired subentity.

Autodesk.AutoCAD.DatabaseServices.SubentityId.TypeClass
Gets the RXClass of the subentity.

Autodesk.AutoCAD.DatabaseServices.SubentityId.Index
Gets subentity index in the SubentityId object. There is no rule as to how this index value must be determined, but it is often the graphics system marker for the subentity that the SubentityId object is identifying.

Autodesk.AutoCAD.DatabaseServices.SubentityId.Type
Gets subentity type of object.

Autodesk.AutoCAD.DatabaseServices.SubentityId.Null
Gets SubentityId object with a subent-type of SubentityType.Null and an index value of null.

Autodesk.AutoCAD.DatabaseServices.SubentityId.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.SubentityId.GetHashCode


Autodesk.AutoCAD.DatabaseServices.SubentityId.op_Equality(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId)


Autodesk.AutoCAD.DatabaseServices.SubentityId.op_Inequality(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId)
