Autodesk.AutoCAD.DatabaseServices.Filters.LayerIndex
This class is an index implementation especially for layers.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerIndex.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerIndex.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Filters.LayerIndex.Compute(Autodesk.AutoCAD.DatabaseServices.LayerTable,Autodesk.AutoCAD.DatabaseServices.BlockTableRecord)
Uses the layer table pLT and the block table record pointed to by record to compute the appropriate filter information.
pLT: Layer table of the Database.
record: Block table record for which the filter should be generated.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerIndex.{dtor}
