Autodesk.AutoCAD.GraphicsInterface.VisualStyleType
Describes the type of Visual Style that is in effect.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.FacePattern
Visual style used to apply a face pattern.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.LinePattern
Visual style used to apply a line pattern.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Brighten
Visual style used for a brightening effect.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Dim
Visual style used for a dimming effect.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Custom
Custom, user defined visual visual style.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Conceptual


Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Basic
Basic default visual style.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Hidden
Hidden visual style.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Wireframe3D
3D wireframe visual style (using 3D graphics system).

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Wireframe2D
2D wireframe visual style (using 2D graphics system).

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.GouraudWithEdges
Gouraud shaded visual style with edges displayed.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Gouraud
Gouraud shaded visual style.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.FlatWithEdges
Flat shaded visual style with edges displayed.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Flat
Flat shaded visual style.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.ColorChange
Visual style used to apply a change of color.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Thicken
Visual style used for a thickening effect.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleType.Realistic
Phong shaded visual style.