Autodesk.AutoCAD.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.Planar
Gets a Boolean indicating whether the curve or region to be revolved is planar.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.EndPointsOnAxis
Gets a Boolean indicating whether the curve or region is open and its endpoints lie on the axis of revolution.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.Closed
Gets a Boolean indicating whether the curve or region is closed.