Autodesk.AutoCAD.DatabaseServices.Trace
The Trace class is the representation for the TRACE entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Trace.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor uses pointer1--pointer4 as the four points for the trace. All points must be in WCS coordinates. The normal vector is initialized to (0,0,1) and the thickness is set to 0.0.
pointer1: First point (in WCS) for trace.
pointer2: Second point (in WCS) for trace.
pointer3: Third point (in WCS) for trace.
pointer4: Fourth point (in WCS) for trace.

Autodesk.AutoCAD.DatabaseServices.Trace.#ctor
Default constructor. Initializes points 0-3 to (0,0,0), the normal vector to (0,0,1), and the thickness to 0.0.

Autodesk.AutoCAD.DatabaseServices.Trace.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Trace.Normal
Gets or sets the unit normal vector of the plane containing the trace.

Autodesk.AutoCAD.DatabaseServices.Trace.Thickness
Gets or sets the thickness of the trace. The thickness is the trace's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.Trace.GetPointAt(System.Int16)
Returns the value of the point in the trace whose index is index. index can have a value of 0, 1, 2, or 3, depending on which point is desired (that is, 0 for the first point, 1 for the second point, etc.). The returned point is in WCS coordinates.
index: Index (0-3) of the desired point in the solid.
Returns: Value of the desired point.

Autodesk.AutoCAD.DatabaseServices.Trace.SetPointAt(System.Int16,Autodesk.AutoCAD.Geometry.Point3d)
Sets the index'th point in the trace to the value pointValue. index must be 0, 1, 2, or 3. pointValue must be in WCS coordinates.
index: Index (0-3) of the point to set in the solid.
pointValue: Point value.

Autodesk.AutoCAD.DatabaseServices.Trace.{dtor}
