Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition
This abstract class handles the linkage to external underlay content. Underlays are similar to raster images, except that users can snap to the content of an underlay.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.Loaded
Gets a Boolean value indicating whether the underlay is currently loaded.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.UnderlayItem
Gets the internal data member that holds the underlay item that this underlay currently references.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.ItemName
Gets or sets the internal data member that holds the name of the underlay item that this underlay currently references.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.ActiveFileName
Gets the name of the file that this underlay references. This name is always a full path.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.SourceFileName
Gets or sets the internal data member that holds the name of the file that this underlay references. This name is in the form (relative or full path) that the user specifie.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.SetUnderlayItem(System.String,System.String,Autodesk.AutoCAD.DatabaseServices.UnderlayItem)
Sets the source path and underlay item that this underlay should reference. Calls Unload() to unload any previous underlay item.
sourceFileName: Source file path.
activeFileName: Current or active file path.
item: The item to be referenced.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.Load(System.String)
Attempts to load the file returned by the ActiveFileName property. If password is null but is necessary to open the file, this method will prompt the user.
password: Optional password.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.GetDictionaryKey(System.Type)
Returns the name of the dictionary that holds the UnderlayDefinition objects in the named objects dictionary.
underlayDefinitionType: The class descriptor of the underlay type for which to retrieve the dictionary name.
Returns: The name of the dictionary that holds the UnderlayDefinition objects in the named objects dictionary.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.{dtor}
