Autodesk.AutoCAD.DatabaseServices.HatchLoop
Encapsulates data for defining a hatch boundary loop.

Autodesk.AutoCAD.DatabaseServices.HatchLoop.#ctor(Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes)


Autodesk.AutoCAD.DatabaseServices.HatchLoop.Curves


Autodesk.AutoCAD.DatabaseServices.HatchLoop.Polyline


Autodesk.AutoCAD.DatabaseServices.HatchLoop.LoopType


Autodesk.AutoCAD.DatabaseServices.HatchLoop.IsPolyline
