Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture
Represents a file based image texture.

Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.SourceFileName
Gets or sets the file name of the image file in which the material texture is stored.

Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.Clone


Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.op_Equality(Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture,Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture)


Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture,Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture)


Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.{dtor}
