Autodesk.AutoCAD.DatabaseServices.SequenceEnd
Represents the SEQEND entity within AutoCAD. Objects of this class are created and handled automatically by AutoCAD for each complex entity that requires them, such as BlockReference,Polyline2d, Polyline3d, etc.

Autodesk.AutoCAD.DatabaseServices.SequenceEnd.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.SequenceEnd.{dtor}
