Autodesk.AutoCAD.DatabaseServices.BeginWblockObjectsEventArgs
Provides data for the BeginWblockObjects event of the database.

Autodesk.AutoCAD.DatabaseServices.BeginWblockObjectsEventArgs.IdMapping
Gets the IdMapping that maps the source objects to the destination objects.

Autodesk.AutoCAD.DatabaseServices.BeginWblockObjectsEventArgs.From
Gets the database being wblocked.