Autodesk.AutoCAD.GraphicsInterface.FontDescriptor
This class encapsulates properties that describe the following font characteristics:type face,character set,pitch and family,bold,italic.

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.#ctor(System.String,System.Boolean,System.Boolean,System.Int32,System.Int32)


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.PitchAndFamily


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.CharacterSet


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.Italic


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.Bold


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.TypeFace


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.ToString(System.IFormatProvider)


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.ToString


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.FontDescriptor,Autodesk.AutoCAD.GraphicsInterface.FontDescriptor)


Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.op_Equality(Autodesk.AutoCAD.GraphicsInterface.FontDescriptor,Autodesk.AutoCAD.GraphicsInterface.FontDescriptor)
