Autodesk.AutoCAD.DatabaseServices.RenderGlobal.DimensionsParameter
This class is a container for the height and width parameters used by the RenderGlobal.Dimensions property.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.DimensionsParameter.#ctor(System.Int32,System.Int32)
Constructor. Constructs a new DimensionsParameter object with the given width and height.
w: Width of the rendered image.
h: Height of the rendered image.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.DimensionsParameter.Width
Gets width of the rendered image.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.DimensionsParameter.Height
Gets height of the rendered image.