Autodesk.AutoCAD.DatabaseServices.Vertex2d
Represents the vertices in 2D polylines.Vertex2d is the only ObjectARX API entity that still passes its position in OCS. This is because the Z coordinate is kept in its owning Polyline2d for historical purposes.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double,System.Double,System.Double)
This constructor initializes the object to use the values passed in for the appropriate vertex values. In addition, the vertex type is initialized to Vertex2dType.SimpleVertex.
position: Position point in OCS coordinates.
bulge: Bulge value.
startWidth: Start width value.
endWidth: End width value.
tangent: Curve-fit tangent angle (in radians).

Autodesk.AutoCAD.DatabaseServices.Vertex2d.#ctor
Default constructor. Initializes the position to (0,0,0), the start and end widths to 0.0, the bulge to 0.0, the curve-fit tangent angle to 0.0, and the vertex type to Vertex2dType.SimpleVertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Vertex2d.Tangent
Gets or sets the curve-fit tangent direction for the vertex. This is the angle (in radians) between the OCS X axis for the polyline containing the vertex and the tangent direction vector.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.TangentUsed
Gets or sets true if the curve-fit tangent direction is in use by this vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.Bulge
Gets or sets the vertex's bulge value. The bulge is the tangent of 1/4 of the included angle for the arc between the selected vertex and the next vertex in the polyline's vertex list. A negative bulge value indicates that the arc goes clockwise from the selected vertex to the next vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.EndWidth
Gets or sets the end width for the vertex. The end width is used as the width at the end of the polyline segment from this vertex to the next vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.StartWidth
Gets or sets the start width for the vertex. The start width is used as the width at this vertex for the polyline segment from this vertex to the next vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.Position
Gets or sets the position value of the vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.VertexType
Gets the Vertex2dType of this vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.{dtor}
