Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.#ctor(System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Constructs a new DBDictionaryEntry object with the given key and value.
key: Dictionary key.
value: Object ID of entry.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.m_key
Dictionary key.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.m_value
Object ID of entry.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.Value
Gets or sets the Value property value.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.Key
Gets or sets the Key property value.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: System.IFormatProvider object.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.op_Explicit(Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry)~System.Collections.DictionaryEntry


Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.op_Explicit(System.Collections.DictionaryEntry)~Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry
