Autodesk.AutoCAD.GraphicsInterface.ShadowDisplayType
Describes the type of shadows in effect.

Autodesk.AutoCAD.GraphicsInterface.ShadowDisplayType.FullAndGround
Full shadows are displayed along with shadows on the ground plane.

Autodesk.AutoCAD.GraphicsInterface.ShadowDisplayType.Full
Full shadows are displayed.

Autodesk.AutoCAD.GraphicsInterface.ShadowDisplayType.GroundPlane
Ground plane shadows are displayed.

Autodesk.AutoCAD.GraphicsInterface.ShadowDisplayType.None
No shadows are displayed.