Autodesk.AutoCAD.DatabaseServices.UnderlayReference
Abstract class that represents underlays in the drawing. Underlays are similar to raster images, but their content is snappable. An UnderlayReference object must reference a compatible UnderlayDefinition object.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.UnderlayReference.DefaultFade
Gets the default fade value.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.FadeUpperLimit
Gets the upper limit of the legal fade values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.FadeLowerLimit
Gets the lower limit of the legal fade values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.DefaultContrast
Gets the default contrast value.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.ContrastUpperLimit
Gets the upper limit of the legal contrast values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.ContrastLowerLimit
Gets the lower limit of the legal contrast values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Monochrome
Gets or sets a Boolean value indicating whether the underlay content is shown inmonochrome.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Fade
Gets or sets the fade value for the underlay ([0-100]).

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Contrast
Gets or sets the contrast value for the underlay ([0-100]).

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.IsOn
Gets or sets a value indicating whether the underlay content is shown.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.IsClipped
Gets or sets a Boolean value indicating whether the clip boundary should be used.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Transform
Gets or sets the transformation matrix from the underlay coordinate system to the world coordinate system (or block space coordinates if the underlay is part of a block).

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.DefinitionId
Gets or sets the Object ID of the UnderlayDefinition that this underlay references.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Normal
Gets or sets the normal of the underlay.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Rotation
Gets or sets the rotation value around the axis defined by the point returned by Position property and the vector returned by Normal property.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.ScaleFactors
Gets or sets the scale factors used to scale the underlay.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Position
Gets or sets the position of the underlay in WCS (or block space coordinates if the reference is part of a block).

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.SetClipBoundary(Autodesk.AutoCAD.Geometry.Point2d[])
Sets the clip boundary of the underlay. The boundary is defined in model coordinates.
points: Clip boundary. An array describing a self intersecting polyline is not allowed. An array of two points is allowed and is treated as the minimum, maximum point of a rectangle.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.GetClipBoundary
Returns an array of points that specify the clip boundary of the underlay. The boundary is defined in model coordinates.
Returns: An array of points that specify the clip boundary of the underlay.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.{dtor}
