Autodesk.AutoCAD.Runtime.DynamicLinkerEventArgs
Provides data for DynamicLinker events.

Autodesk.AutoCAD.Runtime.DynamicLinkerEventArgs.#ctor(System.String)


Autodesk.AutoCAD.Runtime.DynamicLinkerEventArgs.FileName
