Autodesk.AutoCAD.Geometry.PlanarEntity
An abstract base class for all planar surfaces.

Autodesk.AutoCAD.Geometry.PlanarEntity.Coefficients


Autodesk.AutoCAD.Geometry.PlanarEntity.Normal
Gets the unit normal to the plane of this planar entity.

Autodesk.AutoCAD.Geometry.PlanarEntity.PointOnPlane
Gets origin Of PlanarEntity.

Autodesk.AutoCAD.Geometry.PlanarEntity.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.PlanarEntity.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns true, if the plane of this planar entity and the plane of the planar entity linearEntity are perpendicular.
linearEntity: Other planar entity.
Returns: true if the plane of this planar entity and the plane of the planar entity linearEntity are perpendicular.

Autodesk.AutoCAD.Geometry.PlanarEntity.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true, if the plane of this planar entity and the plane of the planar entity linearEntity are perpendicular within the tolerance tolerance.
linearEntity: Other planar entity.
tolerance: Tolerance.
Returns: true if the plane of this planar entity and the plane of the planar entity linearEntity are perpendicular within the tolerance tolerance.

Autodesk.AutoCAD.Geometry.PlanarEntity.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Returns true if the plane of this planar entity and linear entity linearEntity are perpendicular.
linearEntity: Linear entity.
Returns: true if the plane of this planar entity and linear entity linearEntity are perpendicular.

Autodesk.AutoCAD.Geometry.PlanarEntity.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the plane of this planar entity and linear entity linearEntity are perpendicular within the tolerance.
linearEntity: Linear entity.
tolerance: Tolerance.
Returns: true if the plane of this planar entity and linear entity linearEntity are perpendicular within the tolerance.

Autodesk.AutoCAD.Geometry.PlanarEntity.IsParallelTo(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are parallel.
otherPlanarEntity: Other planar entity.
Returns: true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are parallel.

Autodesk.AutoCAD.Geometry.PlanarEntity.IsParallelTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are parallel within the tolerance.
otherPlanarEntity: Other planar entity.
tolerance: Tolerance.
Returns: true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are parallel within the tolerance.

Autodesk.AutoCAD.Geometry.PlanarEntity.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Returns true if the plane of this planar entity and linear entity linearEntity are parallel within the tolerance.
linearEntity: Linear entity.
Returns: true if the plane of this planar entity and linear entity linearEntity are perpendicular within the tolerance.

Autodesk.AutoCAD.Geometry.PlanarEntity.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the plane of this planar entity and linear entity linearEntity are parallel within the tolerance.
linearEntity: Linear entity.
tolerance: Tolerance.
Returns: true if the plane of this planar entity and linear entity linearEntity are perpendicular within the tolerance.

Autodesk.AutoCAD.Geometry.PlanarEntity.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Returns the points from the intersection points if this planar entity intersects the linear entity linearEntity.
linearEntity: Linear entity.
tolerance: Tolerance.
Returns: The intersection points.

Autodesk.AutoCAD.Geometry.PlanarEntity.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the points within the tolerance from the intersection points if this planar entity intersects the linear entity linearEntity.
linearEntity: Linear entity.
tolerance: Tolerance.
Returns: The intersection points.

Autodesk.AutoCAD.Geometry.PlanarEntity.ClosestPointToLinearEntity(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Evaluates the pair of closest points between this planar entity and the linear entity line. The point on this planar entity is returned as a return value.
line: Any LinearEntity3d.
Returns: Closest point on input linear entity and this planar entity.

Autodesk.AutoCAD.Geometry.PlanarEntity.ClosestPointToLinearEntity(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Evaluates the pair of closest points between this planar entity and the linear entity line. The point on this planar entity is returned as a return value.
line: Any LinearEntity3d.
tolerance: Tolerance.
Returns: Closest point on input linear entity and this planar entity.

Autodesk.AutoCAD.Geometry.PlanarEntity.ClosestPointToPlanarEntity(Autodesk.AutoCAD.Geometry.PlanarEntity)
Evaluates the pair of closest points between this planar entity and the planar entity otherPlane. The point on this planar entity is returned as a return value.
otherPlane: Other plane.
Returns: Closest point on otherPlane and this planar entity.

Autodesk.AutoCAD.Geometry.PlanarEntity.ClosestPointToPlanarEntity(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Evaluates the pair of closest points between this planar entity and the planar entity otherPlane. The point on this planar entity is returned as a return value.
otherPlane: Other plane.
tolerance: Tolerance.
Returns: Closest point on otherPlane and this planar entity.

Autodesk.AutoCAD.Geometry.PlanarEntity.IsCoplanarTo(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are equal.
otherPlanarEntity: Other planar entity.
Returns: true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are equal.

Autodesk.AutoCAD.Geometry.PlanarEntity.IsCoplanarTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are equal within the tolerance.
otherPlanarEntity: Other planar entity.
tolerance: Tolerance.
Returns: true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are equal within the tolerance.

Autodesk.AutoCAD.Geometry.PlanarEntity.GetCoordinateSystem
Gets the canonical coordinate system of this planar entity.
Returns: The canonical coordinate system of this planar entity.

Autodesk.AutoCAD.Geometry.PlanarEntity.{dtor}
