Autodesk.AutoCAD.Geometry.Point3dCollection
This collection class provides a container for Point3d objects.

Autodesk.AutoCAD.Geometry.Point3dCollection.#ctor(Autodesk.AutoCAD.Geometry.Point3d[])
Constructor.
values: Point3d values.

Autodesk.AutoCAD.Geometry.Point3dCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.Point3dCollection.Count
Gets the number of elements actually contained in the collection.

Autodesk.AutoCAD.Geometry.Point3dCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.

Autodesk.AutoCAD.Geometry.Point3dCollection.RemoveAt(System.Int32)
Removes the first occurrence of a specific object from the collection.
index: The zero-based index of the element to remove.

Autodesk.AutoCAD.Geometry.Point3dCollection.GetEnumerator
Returns an enumerator object for this collection.
Returns: An enumerator object for this collection.

Autodesk.AutoCAD.Geometry.Point3dCollection.Add(Autodesk.AutoCAD.Geometry.Point3d)
Adds an object to the end of the collection.
value: The object to be added to the end of the collection. The value can be null.
Returns: The collection index at which the value has been added.

Autodesk.AutoCAD.Geometry.Point3dCollection.IndexOf(Autodesk.AutoCAD.Geometry.Point3d)
Searches for the specified object and returns the index of the first occurrence within the collection.
value: The object to locate in the collection. The value can be null.
Returns: The zero-based index of the first occurrence of value within the collection, if found; otherwise, -1.

Autodesk.AutoCAD.Geometry.Point3dCollection.Insert(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Inserts an element into the collection at the specified index.
index: The zero-based index at which value should be inserted.
value: The object to insert. The value can be null.

Autodesk.AutoCAD.Geometry.Point3dCollection.Remove(Autodesk.AutoCAD.Geometry.Point3d)
Removes the first occurrence of a specific object from the collection.
value: The object to remove from the collection. The value can be null.

Autodesk.AutoCAD.Geometry.Point3dCollection.Contains(Autodesk.AutoCAD.Geometry.Point3d)
Determines whether an element is in the collection.
value: The object to locate in the collection. The value can be null.
Returns: true if item is found in the collection; otherwise, false.

Autodesk.AutoCAD.Geometry.Point3dCollection.CopyTo(Autodesk.AutoCAD.Geometry.Point3d[],System.Int32)
Copies the collection to a compatible one-dimensional Array, starting at the specified index of the target array.
array: The one-dimensional Array that is the destination of the elements copied from the collection. The Array must have zero-based indexing.
index: The zero-based index in array at which copying begins.

Autodesk.AutoCAD.Geometry.Point3dCollection.{dtor}
