Autodesk.AutoCAD.DatabaseServices.BooleanOperationType
Enums specify a Boolean operation (union, intersect, or subtract).

Autodesk.AutoCAD.DatabaseServices.BooleanOperationType.BoolSubtract
Performs a subtraction operation.

Autodesk.AutoCAD.DatabaseServices.BooleanOperationType.BoolIntersect
Performs an intersection operation.

Autodesk.AutoCAD.DatabaseServices.BooleanOperationType.BoolUnite
Performs a union operation.