Autodesk.AutoCAD.Geometry.Point2dCollectionEnumerator
Supports a simple iteration over a Point2dCollection.

Autodesk.AutoCAD.Geometry.Point2dCollectionEnumerator.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection)


Autodesk.AutoCAD.Geometry.Point2dCollectionEnumerator.Current
Gets the current element in the collection.

Autodesk.AutoCAD.Geometry.Point2dCollectionEnumerator.MoveNext
Moves the enumerator to the next entry in the collection.
Returns: true if the enumerator was successfully moved to the next entry; false if the enumerator has passed the end of the collection.

Autodesk.AutoCAD.Geometry.Point2dCollectionEnumerator.Reset
Resets the enumerator to the first entry in the collection.