Autodesk.AutoCAD.DatabaseServices.GradientBackground
Represents a gradient background.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.GradientBackground.Rotation
Gets or sets an angle at which you can rotate a gradient background.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.Height
Gets or sets a value representing a percentage of the second color in a three-color gradient.The start point of the second color is determined by the Horizon setting. If the value is 0, the result is a two-color gradient that uses the Top and Bottom colors.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.Horizon
Gets or sets the horizon value indicating the percentage of unrotated height.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.ColorBottom
Gets or sets the current color value of the bottom portion of the background.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.ColorMiddle
Gets or sets the current color value of the middle portion of the background.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.ColorTop
Gets or sets the current color value of the top portion of the background.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.{dtor}
