Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry
This class is responsible for inserting geometry into the graphics cache for later display.

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.PolylineEye(Autodesk.AutoCAD.Geometry.Point3dCollection)
This polyline is similar to the standard Geometry.Polyline(), but it is described using eye coordinates. This polyline cannot be linetyped.
points: List of points in the polyline, in eye coordinates.
Returns: false indicates that the primitive has been successfully stored in the graphics database.true indicates that the operation has been terminated and the application wants to get control back as soon as possible

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.PolygonEye(Autodesk.AutoCAD.Geometry.Point3dCollection)
This polygon is similar to the standard Geometry.Polygon(), but it is described using eye coordinates. This polygon cannot be linetyped.
points: List of points in the polygon, in eye coordinates.
Returns: false indicates that the primitive has been successfully stored in the graphics database.true indicates that the operation has been terminated and the application wants to get control back as soon as possible

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.DeviceContextPolyline(Autodesk.AutoCAD.Geometry.Point3dCollection)
This polyline is similar to the standard Geometry.Polyline(), but it is described using display coordinates. This polyline cannot be linetyped.
points: List of points in the polyline, in display coordinates.
Returns: false indicates that the primitive has been successfully stored in the graphics database.true indicates that the operation has been terminated and the application wants to get control back as soon as possible

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.DeviceContextPolygon(Autodesk.AutoCAD.Geometry.Point3dCollection)
This polygon is similar to the standard Geometry.Polygon(), but it is described using display coordinates. This polygon cannot be linetyped.
points: List of points in the polygon, in display coordinates.
Returns: false indicates that the primitive has been successfully stored in the graphics database.true indicates that the operation has been terminated and the application wants to get control back as soon as possible

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.DeviceContextRasterImage(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.GraphicsInterface.ImageOrg,System.Int32,System.Int32,System.Int16,System.Boolean,Autodesk.AutoCAD.GraphicsInterface.ImageSource,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.GraphicsInterface.ImageOrg,Autodesk.AutoCAD.Geometry.Matrix2d,System.Int32,System.Int32)
This method uses the basic image parameters provided to determine where and what size image to paint and then opens the entity whose ObjectId is entityId and obtains the actual raster data to display.
origin: Image origin.
u: Image "width" orientation.
v: Image "height" orientation.
pixel: Image's pixel coordinate to display coordinate transformation matrix (2D).
entityId: ObjectId of the image entity.
imageOrg: Image organization enum value.
imageWidth: Source image width in pixels.
imageHeight: Source image height in pixels.
imageColorDepth: Number of colors used in the image (2 to the color depth power).
transparency: Boolean indicating whether or not the image contains transparent regions.
source: Value indicating image source.
unRotated: Non-rotated image origin .
originalImage: Original image organization.
unRotatedPixel: Unrotated pixel-to-DC transformation matrix (2D).
unRotatedImageWidth: Unrotated source image width (in pixels).
unRotatedImageHeight: Unrotated source image height (in pixels).
Returns: false indicates that the primitive has been successfully stored in the graphics database.true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.{dtor}
