Autodesk.AutoCAD.DatabaseServices.DragStatus
This enumeration provides status values concerning a drag operation.

Autodesk.AutoCAD.DatabaseServices.DragStatus.DragAbort
A drag operation has just aborted.

Autodesk.AutoCAD.DatabaseServices.DragStatus.DragEnd
A drag operation has just ended.

Autodesk.AutoCAD.DatabaseServices.DragStatus.DragStart
A drag operation has just started.