Autodesk.AutoCAD.DatabaseServices.SectionManager
Manages the section planes in a database. This class cannot be instantiated.

Autodesk.AutoCAD.DatabaseServices.SectionManager.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.SectionManager.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SectionManager.NumSections
Gets the number of section planes in the database.

Autodesk.AutoCAD.DatabaseServices.SectionManager.LiveSection
Gets the currently enabled live section plane in the database. Live sectioning is either enabled or disabled individually per section object. Live sectioning can be active for no more than one section object at a time.

Autodesk.AutoCAD.DatabaseServices.SectionManager.GetSection(System.String)
Gets the section plane in the database by name.
pszName: Name of the section plane to get.
Returns: The section plane in the database by name.

Autodesk.AutoCAD.DatabaseServices.SectionManager.GetEnumerator
Gets an enumerator to iterate the section planes in the database.
Returns: An enumerator that can be used to iterate the section planes in the database.

Autodesk.AutoCAD.DatabaseServices.SectionManager.GetUniqueSectionName(System.String)
Finds a unique section plane name.
pszBaseName: Base name to coin the unique section plane name.
Returns: The unique name.

Autodesk.AutoCAD.DatabaseServices.SectionManager.{dtor}
