Autodesk.AutoCAD.DatabaseServices.SolidBackground
Represents a solid background.

Autodesk.AutoCAD.DatabaseServices.SolidBackground.#ctor
Default constructor. Constructs an empty solid background.

Autodesk.AutoCAD.DatabaseServices.SolidBackground.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SolidBackground.Color
Gets or sets the solid color of the background.

Autodesk.AutoCAD.DatabaseServices.SolidBackground.{dtor}
