Autodesk.AutoCAD.DatabaseServices.AttachmentPoint
Specifies the attachment point for an MText object.

Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.TopMid


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.MiddleMid


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BottomMid


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BaseMid


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.TopFit


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.MiddleFit


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BottomFit


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BaseFit


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.TopAlign


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.MiddleAlign


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BottomAlign


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BaseAlign


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BaseRight


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BaseCenter


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BaseLeft


Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BottomRight
Right-justified,spills up.

Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BottomCenter
Center-justified,spills up.

Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.BottomLeft
Left-justified,spills up.

Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.MiddleRight
Right-justified,spills up and down.

Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.MiddleCenter
Center-justified,spills up and down.

Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.MiddleLeft
Left-justified,spills up and down.

Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.TopRight
Right-justified,spills down.

Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.TopCenter
Center-justified,spills down.

Autodesk.AutoCAD.DatabaseServices.AttachmentPoint.TopLeft
Left-justified,spills down.