Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection
Represents a collection of DynamicDimenionData objects.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.Count
Gets the number of objects in the collection.
Returns: Returns a value representing the number of objects in the collection.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.GetEnumerator
Gets an enumerator for the collection.
Returns: An enumerator that can be used to iterate through the collection.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.Add(Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData)
Adds a new DynamicDimensionData object to the collection.
data: A DynamicDimensionData object to add.
Returns: The position of the newly created item in the collection.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.RemoveAt(System.Int32)
Removes an item from the collection.
i: The position of the item to be removed.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.Clear
Removes all the elements in the collection.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.{dtor}
