Autodesk.AutoCAD.Geometry.PointEntity2d
Abstract base class for 2D point classes.

Autodesk.AutoCAD.Geometry.PointEntity2d.Point
Gets 2D coordinates of point entity.

Autodesk.AutoCAD.Geometry.PointEntity2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.PointEntity2d.{dtor}
