Autodesk.AutoCAD.DatabaseServices.ViewTableRecord
Objects of this class represent stored views within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.#ctor
Default constructor. Initializes IsPaperspaceView to false. The rest of the initialization is done in the base class's default constructors.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.Thumbnail
Gets or sets the packed BITMAPINFO structure of the thumbnail with the thumbnail data following it immediately in memory.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.LiveSection
Gets or sets the live section ID associated with a view.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.ViewAssociatedToViewport
Gets or sets a boolean indicating whether or not the view is associated with a paperspace viewport.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.Layout
Gets or sets the layout of the view.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.LayerState
Gets or sets the name of the layer state of the view.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.CategoryName
Gets or sets the name of the category of the view.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.IsUcsAssociatedToView
Gets true if this view table record has an associated ucs.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.IsPaperspaceView
Gets or sets true if this ViewTableRecord is a Paper Space view.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.DisassociateUcsFromView
Disassociates the ucs from this view. If this method is called, then no ucs will be associated with the view and the ucs will not change when the view is restored.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.{dtor}
