Autodesk.AutoCAD.DatabaseServices.ClipBoundaryType
ClipBoundaryType.

Autodesk.AutoCAD.DatabaseServices.ClipBoundaryType.Poly
Polygon with points entirely within the image boundary.

Autodesk.AutoCAD.DatabaseServices.ClipBoundaryType.Rectangle
Rectangle aligned with the image pixel coordinate system.

Autodesk.AutoCAD.DatabaseServices.ClipBoundaryType.Invalid
Undefined state.