Autodesk.AutoCAD.DatabaseServices.DatabaseIOEventArgs
Provides data for the DwgFileOpened, BeginSave and SaveComplete events of the database.

Autodesk.AutoCAD.DatabaseServices.DatabaseIOEventArgs.FileName
Gets the name of the drawing file being operated on.