Autodesk.AutoCAD.DatabaseServices.Polyline3d
Represents the 3D polyline entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.#ctor(Autodesk.AutoCAD.DatabaseServices.Poly3dType,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Boolean)
This constructor creates a 3D polyline of the type specified by type, with the vertices in the array vertices. If closed is true, then the polyline will be closed (that is, there will be a line drawn from the last vertex to the first vertex); otherwise, the polyline will be open.
type: Polyline type.
vertices: Array of 3D vertex points.
closed: Boolean indicates whether or not the polyline is closed.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.#ctor
Default constructor. Constructs an open polyline with the type initialized to Poly3dType.SimplePoly.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Polyline3d.PolyType
Gets or sets the spline-fit type for this 3D polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.Closed
Gets or sets a boolean indicating whether the polyline is closed.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.ConvertToPolyType(Autodesk.AutoCAD.DatabaseServices.Poly3dType)
Uses the SplineFit() method to convert the polyline to the type specified by the type argument value.
newVal: Type to which the polyline should be converted.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.Straighten
Removes all spline and curve-fit vertices from the polyline or mesh and sets all remaining vertices to be simple vertices. This operation performs the same modification as the PEDIT command "Decurve" option.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.SplineFit(Autodesk.AutoCAD.DatabaseServices.Poly3dType,System.Int32)
Removes any existing spline or curve-fit vertices, converts all remaining vertices to spline-control vertices, and generates a new set of spline-fit vertices. The resultant polyline is spline fit through the new set of vertices. This operation performs the same modification as the PEDIT command "Spline fit" option except that it uses splineType and splineSegs as control parameters for the SplineFit operation rather than the SPLINETYPE and SPLINESEGS database/system variables.
value: Spline type control value to be used for the spline fit operation on the polyline.
segments: Spline segments control value to be used for the spline fit operation on the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.SplineFit
Removes any existing spline or curve-fit vertices, converts all remaining vertices to spline-control vertices, and generates a new set of spline-fit vertices. The resultant polyline or mesh is spline fit through the new set of vertices. This operation performs the same modification as the PEDIT command "Spline fit" option.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.AppendVertex(Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
Appends the PolylineVertex3d object defined by vertexToAppend to the vertex list of the polyline, establishes the polyline as the vertex's owner, and adds the vertex to the Database that contains the polyline (the polyline must be database-resident for this function to succeed).
vertexToAppend: The vertex to add to the polyline.
Returns: Object ID of the added vertex.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
Inserts the PolylineVertex3d object defined by newVertex into the vertex list of the polyline just after the PolylineVertex3d object with objectId indexVertexId, establishes the polyline as the vertex's owner, and adds the vertex to the Database that contains the polyline (the polyline must be database-resident for this function to succeed).
indexVertexId: ObjectId of the vertex in the polyline after which the new vertex is to be inserted.
newVertex: Vertex to be inserted.
Returns: object ID of newVertex.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d,Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
Inserts the PolylineVertex3d object defined by newVertex into the vertex list of the polyline just after the PolylineVertex3d object defined by indexVertex and establishes the polyline as the vertex's owner. In addition, if the polyline is resident within a Database, the vertex will be added to the same database. If the polyline is not database-resident, then when it is added to a database, the vertex will be added as well.
indexVertex: ObjectId of the vertex in the polyline after which the new vertex is to be inserted.
newVertex: Vertex to be inserted.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.GetEnumerator
Gets an enumerator to iterate over the vertices of the polyline.
Returns: An enumerator that can be used to iterate over the vertices of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.{dtor}
