Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection
Provides a container for Autodesk.AutoCAD.DatabaseServices.DBObjectReference objects.

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.Add(Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Adds the object represented by value to this collection.
value: The zero-based index of the newly added collection item.
Returns: The index of the new last element.

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Gets the 0-based index of the collection item that matches value.
value: The object to search for in this collection.
Returns: The zero-based index of the collection item that matches value, or -1 if value does not exist in the collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Inserts an element into the collection at the specified index.
index: The zero-based index at which value should be inserted.
value: Element to be inserted in the collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.Remove(Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Removes the object represented by value from this collection.
value: The item to remove from the collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.Contains(Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Determine if the collection contains value.
value: Value to search for in this collection.
Returns: A value indicating whether the collection contains an object that matches value.

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.DBObjectReference[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.