Autodesk.AutoCAD.DatabaseServices.MlineStyle
Used to store the information about the number, linetypes, and offsets of multi-line line patterns to be used by Mline entities.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.MlineStyle.Elements
Gets elements in the MlineStyle.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.EndAngle
Gets or sets the angle (in radians) to which the end of mlines using this MlineStyle will be "cut." The default value for the end angle is pi/2 radians.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.StartAngle
Gets or sets the angle (in radians) to which the start of Mlines using this MlineStyle will be "cut." An angle of pi/2 radians is perpendicular to the mline's direction.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Filled
Gets or sets true if the MlineStyle has fill set to "on" (that is, mlines referencing the MlineStyle will be filled).

Autodesk.AutoCAD.DatabaseServices.MlineStyle.FillColor
Gets or sets a reference to a Color object representing the fill color for the MlineStyle.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.EndInnerArcs
Gets or sets true if the MlineStyle is set to show inner arcs at the mline ends.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.EndRoundCap
Gets or sets true true if the MlineStyle is set to use round endcaps.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.EndSquareCap
Gets or sets true if the MlineStyle is set to use square endcaps.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.StartInnerArcs
Gets or sets true if the MlineStyle is set to show inner arcs at the mline starts.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.StartRoundCap
Gets or sets true if the MlineStyle is set to use round startcaps.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.StartSquareCap
Gets or sets true if the MlineStyle is set to use square startcaps.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.ShowMiters
Gets or sets true if the MlineStyle is set to show miterlines in the mline joints.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Name
Gets or sets the name string in the MlineStyle. The name string can be up to MSTYLE_NAME_LENGTH in length.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Description
Gets or sets the description string for the MlineStyle object. The description string is not used by AutoCAD--it is provided as a place to store some descriptive text about the MlineStyle. The description string shows up in the "Description" edit box of the MLineStyle dialog in AutoCAD. The description string can be up to MSTYLE_DESCRIPTION_LENGTH in length.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Reset
Initializes or re-initializes the MlineStyle object so that the name and description are empty strings (it does not free any existing strings these may point to), the fill color is 0, the start and end angles are pi/2, and the element list is empty (any existing element information is deleted and the memory freed up).

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Set(Autodesk.AutoCAD.DatabaseServices.MlineStyle,System.Boolean)
Copies the information from source into the MlineStyle.
source: MlineStyle to copy from.
checkIfReferenced: Boolean indicates whether to check if the style is referenced .

Autodesk.AutoCAD.DatabaseServices.MlineStyle.{dtor}
