Autodesk.AutoCAD.DatabaseServices.SectionGeneration
Generation flags to control section creation. There are three groups of flags: type of section to generate, source, and destination. One value from each group should be OR'd to set the generation options.

Autodesk.AutoCAD.DatabaseServices.SectionGeneration.DestinationFile
Saves the generated section in an external file.

Autodesk.AutoCAD.DatabaseServices.SectionGeneration.DestinationReplaceBlock
Replaces an existing block while creating section.

Autodesk.AutoCAD.DatabaseServices.SectionGeneration.DestinationNewBlock
Creates section as a new block.

Autodesk.AutoCAD.DatabaseServices.SectionGeneration.SourceSelectedObjects
The section plane cuts only the selected objects.

Autodesk.AutoCAD.DatabaseServices.SectionGeneration.SourceAllObjects
The section plane cuts all the objects found in the drawing.