Autodesk.AutoCAD.DatabaseServices.AuditPass
Two passes through each object's data are made during the AUDIT command.

Autodesk.AutoCAD.DatabaseServices.AuditPass.Pass2
PASS2 is when audit members should be verifying the existence of related objects and of inter-object links. This is the time to recreate missing objects, redirect references, or whatever can be done to repair an object.

Autodesk.AutoCAD.DatabaseServices.AuditPass.Pass1
PASS1 is when class members should be validating their own data fields and avoiding the validation of other objects, even their existance.