Autodesk.AutoCAD.GraphicsInterface.MaterialMap
Defines material component maps. Maps are described by dimension, source, format, and mapping properties.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.#ctor(Autodesk.AutoCAD.GraphicsInterface.Source,System.String,Autodesk.AutoCAD.GraphicsInterface.MaterialTexture,System.Double,Autodesk.AutoCAD.GraphicsInterface.Mapper)


Autodesk.AutoCAD.GraphicsInterface.MaterialMap.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.Mapper
Gets the mapper (mapping method) associated with this map.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.Texture
Gets the address of the MaterialTexture object contained in this map.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.SourceFileName
Gets the file name of the image file in which the material map is stored.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.Source
Gets the data source of the material map.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.MaterialMap.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.MaterialMap.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MaterialMap,Autodesk.AutoCAD.GraphicsInterface.MaterialMap)


Autodesk.AutoCAD.GraphicsInterface.MaterialMap.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MaterialMap,Autodesk.AutoCAD.GraphicsInterface.MaterialMap)


Autodesk.AutoCAD.GraphicsInterface.MaterialMap.{dtor}
