Autodesk.AutoCAD.DatabaseServices.BlockEnd
Represents the ENDBLK object within AutoCAD. Objects of this class are created and handled automatically by AutoCAD for each BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockEnd.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.BlockEnd.{dtor}
