Autodesk.AutoCAD.Geometry.CircularArc2d
Represents both full circles and circular arcs in 2D space.

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Boolean)
Constructs an arc with the specified start and endpoints. If a line is drawn between startPoint and endPoint, then the distance between this line and the midpoint of the constructed arc is equal to the bulge distance. The direction of the constructed arc is always counterclockwise. startPoint must be different than endPoint. This constructor always constructs a bounded arc and cannot be used to construct a full circle. If bulgeFlag is true, then bulge is interpreted to be the maximum distance between the arc and the chord between the two input points. If bulgeFlag is false, then bulge is interpreted to be the tangent of 1/4 the included angle (tan(ang/4)), where ang is the angle of the arc segment between the two input points.
startPoint: Start point of arc.
endPoint: Endpoint of arc.
bulge: Bulge distance.
bulgeFlag: How to interpret bulge distance for arc calculation.

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs an arc through three points. None of the three points may be coincident and they may not be colinear. This constructor always constructs a bounded arc and cannot be used to construct a full circle.
startPoint: Start point of arc.
point: Point on arc.
endPoint: Endpoint of arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Double,System.Double,Autodesk.AutoCAD.Geometry.Vector2d,System.Boolean)
Constructs a circular arc with the specified center, radius, start angle, and end angle. Angles are measured by drawing a vector between a point on the arc and the center point and taking the angle between this vector and referenceVector. The last parameter specifies whether the angle is to be taken clockwise or counterclockwise. endAngle must be greater than startAngle. To construct a full circle, the difference between endAngle and startAngle should be 2 x Pi.
center: Center of arc.
radius: Radius of arc.
startAngle: Angle of start point of arc.
endAngle: Angle of endpoint of arc.
referenceVector: Reference vector from which arc angles are measured.
isClockWise: Direction of arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Constructs a full circle with the given center and radius. The radius must not be 0.
center: Center of circle.
radius: Radius of circle.

Autodesk.AutoCAD.Geometry.CircularArc2d.EndPoint
Gets endpoint of the arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.StartPoint
Gets startPoint of the arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.ReferenceVector
Gets or sets the reference vector of the arc. The reference vector is the vector from which the start and end angles of the arc are measured. This property is always a unit vector.

Autodesk.AutoCAD.Geometry.CircularArc2d.IsClockWise
Gets a boolean indicating whether arc is oriented in a clockwise direction.

Autodesk.AutoCAD.Geometry.CircularArc2d.EndAngle
Gets angle of the endpoint of the arc with respect to the reference vector.

Autodesk.AutoCAD.Geometry.CircularArc2d.StartAngle
Gets angle of the start point of the arc with respect to the reference vector.

Autodesk.AutoCAD.Geometry.CircularArc2d.Radius
Gets or sets the radius of the arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.Center
Gets or sets the center point of the arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.Create(System.IntPtr,System.Boolean)
Creates a new CircularArc2d object from an unmanaged AcGeCircArc2d pointer.
unmanagedPointer: Unmanaged AcGeCircArc2d pointer.
autoDelete: If true, the system automatically deletes the underlying object when it is no longer used by the wrapper.
Returns: CircularArc2d object from an unmanaged AcGeCircArc2d pointer.

Autodesk.AutoCAD.Geometry.CircularArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.CircularArc2d)
Determines if the input arc intersects this arc.This method calls CircularArc2d.IntersectWith(CircularArc2d arc, Tolerance tolerance) with tolerance set to Global.
arc: Any 2D arc.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.CircularArc2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input arc intersects this arc.
arc: Any 2D arc.
tolerance: Tolerance for tangent intersections.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d)
Determines if the input line intersects the arc.This method calls CircularArc2d.IntersectWith(LinearEntity2d line, Tolerance tolerance) with tolerance set to Global.
line: Any 2D linear entity.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input line intersects the arc.
line: Any 2D linear entity.
tolerance: Tolerance for tangent intersections.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc2d.GetTangent(Autodesk.AutoCAD.Geometry.Point2d)
Gets the tangent line to the circle at the input point if the input point lies on the full circle of the arc.This method calls CircularArc2d.GetTangent(Point2d point, Tolerance tolerance) with tolerance set to Global.
point: Point on full circle.
Returns: Tangent line.

Autodesk.AutoCAD.Geometry.CircularArc2d.GetTangent(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Gets the tangent line to the circle at the input point if the input point lies on the full circle of the arc.
point: Point on full circle.
tolerance: Tolerance.
Returns: Tangent line.

Autodesk.AutoCAD.Geometry.CircularArc2d.IsInside(Autodesk.AutoCAD.Geometry.Point2d)
Treats the arc as a full circle even if it is bounded, and determines if the input point lies inside the full circle.This method calls CircularArc2d.IsInside(Point2d point, Tolerance tolerance) with tolerance set to Global.
point: Any 2D point.
Returns: true if the input point lies inside the full circle.

Autodesk.AutoCAD.Geometry.CircularArc2d.IsInside(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Treats the arc as a full circle even if it is bounded, and determines if the input point lies inside the full circle.
point: Any 2D point.
tolerance: Tolerance.
Returns: true if the input point lies inside the full circle.

Autodesk.AutoCAD.Geometry.CircularArc2d.SetAngles(System.Double,System.Double)
Changes the start and endpoints of the arc to have the specified angles.
startAngle: Start angle of arc.
endAngle: End angle of arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.SetToComplement
Reverses the direction of the arc while keeping the same start and endp.

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,System.Double,System.Double,System.Double)
Changes the definition of the arc to be tangent to the three input curves.
curve1: Any 2D curve.
curve2: Any 2D curve.
curve3: Any 2D curve.
parameter1: Parameter value on curve1 where arc touches curve.
parameter2: Parameter value on curve2 where arc touches curve.
parameter3: Parameter value on curve3 where arc touches curve.

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,System.Double,System.Double,System.Double)
Changes the definition of the arc to be tangent to the two input curves and have the specified radius.
curve1: Any 2D curve.
curve2: Any 2D curve.
radius: Radius of arc.
parameter1: Parameter value on curve1 where arc touches curve.
parameter2: Parameter value on curve2 where arc touches curve.

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Boolean)
Changes the definition of the arc to have the specified start point, endpoint, and bulge distance.
startPoint: Start point of arc.
endPoint: Endpoint of arc.
bulge: Bulge distance.
bulgeFlag: How to interpret bulge distance for arc calculation.

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Changes the definition of the arc to have the specified start and endpoints and pass through point. None of the three points may be coincindent and they may not be colinear.
startPoint: Start point of arc.
point: Point on arc.
endPoint: Endpoint of arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Double,System.Double,Autodesk.AutoCAD.Geometry.Vector2d,System.Boolean)
Changes the definition of the arc to have the specified center, radius, start angle, and end angle.
center: Center of arc.
radius: Radius of arc.
angle1: Angle of start point of arc.
angle2: Angle of endpoint of arc.
referenceVector: Reference vector from which arc angles are measured.
isClockWise: Direction of arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Changes the definition of the arc to have the specified center and radius.
center: Center of arc.
radius: Radius of arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.{dtor}
