Autodesk.AutoCAD.DatabaseServices.LineWeight
This enumerated type provides the line weight (thickness) values used to specify how lines will be displayed and plotted. The lineweights are in 100ths of a millimeter, except for the negative values. The negative values denote the default indicated by their constant's name.

Autodesk.AutoCAD.DatabaseServices.LineWeight.ByLineWeightDefault


Autodesk.AutoCAD.DatabaseServices.LineWeight.ByBlock


Autodesk.AutoCAD.DatabaseServices.LineWeight.ByLayer


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight211


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight200


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight158


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight140


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight120


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight106


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight100


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight090


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight080


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight070


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight060


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight053


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight050


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight040


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight035


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight030


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight025


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight020


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight018


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight015


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight013


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight009


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight005


Autodesk.AutoCAD.DatabaseServices.LineWeight.LineWeight000
