Autodesk.AutoCAD.DatabaseServices.LoftedSurface
Represents a lofted surface entity. It provides methods to create and manipulate ASM surfaces.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.LoftedSurface.LoftOptions
Gets or sets the loft options used to create this surface.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.PathEntity
Gets the path along which the surface is created.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.GuideCurves
Gets the guide curves in use by this surface.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.CrossSections
Gets the cross section curves.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.CreateLoftedSurface(Autodesk.AutoCAD.DatabaseServices.Entity[],Autodesk.AutoCAD.DatabaseServices.Entity[],Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.LoftOptions)


Autodesk.AutoCAD.DatabaseServices.LoftedSurface.{dtor}
