Autodesk.AutoCAD.Geometry.NurbCurve3d
Represents non-uniform rational B-spline in 3D space.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(Autodesk.AutoCAD.Geometry.LineSegment3d)
Constructs spline representing a line segment.
linSegment: Line segment.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(Autodesk.AutoCAD.Geometry.EllipticalArc3d)
Constructs spline geometrically identical to an elliptic arc.
ellipse: Elliptic arc.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3dCollection,System.Boolean)
Constructs a 3D polynomial spline interpolating a given array.
fitPoints: Points interpolating the spline curve.
fitTangents: Vectors interpolating the curve's derivatives at fitPoints.
periodic: Flag indicating if spline is a closed curve.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3dCollection,Autodesk.AutoCAD.Geometry.Tolerance,System.Boolean)
Constructs a 3D polynomial spline interpolating a given array if 2D points within given tolerance.
fitPoints: Points interpolating the spline curve.
fitTangents: Vectors interpolating the curve's derivatives at fitPoints.
fitTolerance: Maximal deviation of the curve from the fitPoints .
periodic: Flag indicating if spline is a closed curve.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection)
Constructs a 3D polynomial spline interpolating a given array.
fitPoints: Points interpolating the spline curve.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs a 3D polynomial spline interpolating a given array if 2D points within given tolerance.
fitPoints: Points interpolating the spline curve.
fitTolerance: Maximal deviation of the curve from the fitPoints.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean,System.Boolean)
Constructs a 3D polynomial spline interpolating a given array of 2D points and having given derivatives at the start point and endpoint.
fitPoints: Array of interpolation points.
startTangent: Start tangent vector of spline.
endTangent: End tangent vector of spline.
startTangentDefined: Flag indicating whether startTangent should be used.
endTangentDefined: Flag indicating whether endTangent should be used.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean,System.Boolean,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs a 3D polynomial spline interpolating a given array of 2D points and having given derivatives at the start point and endpoint.
fitPoints: Array of interpolation points.
startTangent: Start tangent vector of spline.
endTangent: End tangent vector of spline.
startTangentDefined: Flag indicating whether startTangent should be used.
endTangentDefined: Flag indicating whether endTangent should be used.
fitTolerance: Tolerance to which spline will fit the interpolation points.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(System.Int32,Autodesk.AutoCAD.Geometry.PolylineCurve3d,System.Boolean)
Constructs a 3D rational spline by a degree and fit points provided by a polyline.
degree: Degree of spline.
fitPolyline: Polyline whose fit points are interpolated by the spline curve.
periodic: Flag indicating if spline is a closed curve.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(System.Int32,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,System.Boolean)
Constructs a 3D rational spline by a knot vector, control points, and weights. Control points and weights must have same length.
degree: Degree of spline.
knots: Array of knot values, partitioning spline's domain into rational pieces.
controlPoints: Array of 2D control points.
weights: Array of weight values.
periodic: Flag indicating if spline is a closed curve.

Autodesk.AutoCAD.Geometry.NurbCurve3d.#ctor(System.Int32,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Boolean)
Constructs a 3D non-rational spline by a knot vector and control points.
degree: Degree of spline.
knots: Array of knot values, partitioning spline's domain into polynomial pieces.
controlPoints: Array of 2D control points.
periodic: Flag indicating if spline is a closed curve.

Autodesk.AutoCAD.Geometry.NurbCurve3d.DefinitionData
Gets all data that defines the spline. If spline is not rational, weights array will be empty.

Autodesk.AutoCAD.Geometry.NurbCurve3d.FitData
Gets all fit data used to construct the spline.

Autodesk.AutoCAD.Geometry.NurbCurve3d.EvalMode
Gets state of the current evaluation mode.

Autodesk.AutoCAD.Geometry.NurbCurve3d.NumWeights
Gets number of weights for the spline. This will be 0 if the spline is not rational or equal to the number of control points if the spline is rational.

Autodesk.AutoCAD.Geometry.NurbCurve3d.FitTolerance
Gets or sets the fit tolerance used to construct the spline.

Autodesk.AutoCAD.Geometry.NurbCurve3d.NumFitPoints
Gets the number of fit points used to construct the spline.

Autodesk.AutoCAD.Geometry.NurbCurve3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.NurbCurve3d.GetFitTangents
Returns the fit tangents of spline.
Returns: The fit tangents of spline.

Autodesk.AutoCAD.Geometry.NurbCurve3d.GetFitPointAt(System.Int32)
Returns the fit point corresponding to the specified index.
index: Index of fit point.
Returns: The fit point corresponding to the specified index.

Autodesk.AutoCAD.Geometry.NurbCurve3d.GetWeightAt(System.Int32)
Returns the weight at the control point specified by index.
index: Index to weights.
Returns: The weight at the control point specified by index.

Autodesk.AutoCAD.Geometry.NurbCurve3d.GetParametersOfC1Discontinuity
Returns parameter values of points where spline is C1 discontinuous.
Returns: Parameter values of points where spline is C1 discontinuous.

Autodesk.AutoCAD.Geometry.NurbCurve3d.GetParametersOfC1Discontinuity(Autodesk.AutoCAD.Geometry.Tolerance)
Returns parameter values of points where spline is C1 discontinuous.
tolerance: Tolerance.
Returns: Parameter values of points where spline is C1 discontinuous.

Autodesk.AutoCAD.Geometry.NurbCurve3d.GetParametersOfG1Discontinuity
Returns parameter values of points where spline is G1 discontinuous.
Returns: Parameter values of points where spline is G1 discontinuous.

Autodesk.AutoCAD.Geometry.NurbCurve3d.GetParametersOfG1Discontinuity(Autodesk.AutoCAD.Geometry.Tolerance)
Returns parameter values of points where spline is G1 discontinuous.
tolerance: Tolerance.
Returns: Parameter values of points where spline is G1 discontinuous.

Autodesk.AutoCAD.Geometry.NurbCurve3d.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets the fit point at the specified index to the new value.
index: Index of fit point that is to be modified.
point: New fit point.

Autodesk.AutoCAD.Geometry.NurbCurve3d.AddFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Adds a new fit point at the specified index.
index: Index of fit point that is to be added.
point: New fit point.
Returns: false if spline was not created with fit data.

Autodesk.AutoCAD.Geometry.NurbCurve3d.DeleteFitPointAt(System.Int32)
Delete the fit point at the specified index.
index: Index of fit point that is to be deleted.
Returns: false if spline was not created with fit data.

Autodesk.AutoCAD.Geometry.NurbCurve3d.SetFitTangents(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
The spline is recomputed using the new start and end tangent vectors.
startTangent: New start tangent vector .
endTangent: New end tangent vector.
Returns: false if spline was not created with fit data.

Autodesk.AutoCAD.Geometry.NurbCurve3d.SetFitData(System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection)


Autodesk.AutoCAD.Geometry.NurbCurve3d.SetFitData(System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.Geometry.NurbCurve3d.SetFitData(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean)


Autodesk.AutoCAD.Geometry.NurbCurve3d.SetFitData(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance,System.Boolean)


Autodesk.AutoCAD.Geometry.NurbCurve3d.SetFitData(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.NurbCurve3d.SetFitData(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.Geometry.NurbCurve3d.PurgeFitData


Autodesk.AutoCAD.Geometry.NurbCurve3d.AddKnot(System.Double)


Autodesk.AutoCAD.Geometry.NurbCurve3d.InsertKnot(System.Double)


Autodesk.AutoCAD.Geometry.NurbCurve3d.SetWeightAt(System.Int32,System.Double)


Autodesk.AutoCAD.Geometry.NurbCurve3d.SetEvaluateMode(System.Boolean)


Autodesk.AutoCAD.Geometry.NurbCurve3d.JoinWith(Autodesk.AutoCAD.Geometry.NurbCurve3d)


Autodesk.AutoCAD.Geometry.NurbCurve3d.HardTrimByParams(System.Double,System.Double)


Autodesk.AutoCAD.Geometry.NurbCurve3d.MakeRational(System.Double)


Autodesk.AutoCAD.Geometry.NurbCurve3d.MakeClosed


Autodesk.AutoCAD.Geometry.NurbCurve3d.MakePeriodic


Autodesk.AutoCAD.Geometry.NurbCurve3d.MakeNonPeriodic


Autodesk.AutoCAD.Geometry.NurbCurve3d.MakeOpen


Autodesk.AutoCAD.Geometry.NurbCurve3d.ElevateDegree(System.Int32)


Autodesk.AutoCAD.Geometry.NurbCurve3d.{dtor}
