Autodesk.AutoCAD.Geometry.LinearEntity3d
Abstract base class for all 3D line classes.

Autodesk.AutoCAD.Geometry.LinearEntity3d.Direction
Gets direction vector of line. This vector is a unit vector and points in the direction of increasing parameter value.

Autodesk.AutoCAD.Geometry.LinearEntity3d.PointOnLine
Gets an arbitrary point on the line.

Autodesk.AutoCAD.Geometry.LinearEntity3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.LinearEntity3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity)
Determines if line intersects input plane and if so returns their intersection point.
plane: Any planar entity.
Returns: Intersection point between line and plane.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if line intersects input plane and if so returns their intersection point.
plane: Any planar entity.
tolerance: Tolerance.
Returns: Intersection point between line and plane.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Determines if two lines intersect and if so returns their intersection point.
line: Any 3D linear entity.
Returns: Intersection point between two lines.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines intersect and if so returns their intersection point.
line: Any 3D linear entity.
tolerance: Tolerance.
Returns: Intersection point between two lines.

Autodesk.AutoCAD.Geometry.LinearEntity3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d)
Finds the points on the two lines which project into the same point when projected onto a plane whose normal is projectionDirection.
line: Any 3D linear entity.
projectionDirection: Direction of projection.
Returns: Intersection points on this line and input line.

Autodesk.AutoCAD.Geometry.LinearEntity3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the points on the two lines which project into the same point when projected onto a plane whose normal is projectionDirection.
line: Any 3D linear entity.
projectionDirection: Direction of projection.
tolerance: Tolerance.
Returns: Intersection points on this line and input line.

Autodesk.AutoCAD.Geometry.LinearEntity3d.Overlap(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Determines if two lines overlap and if so returns the line that coincides with their region of overlap.
line: Any 3D linear entity.
Returns: Linear entity that is coincident with region of overlap.

Autodesk.AutoCAD.Geometry.LinearEntity3d.Overlap(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines overlap and if so returns the line that coincides with their region of overlap.
line: Any 3D linear entity.
tolerance: Tolerance.
Returns: Linear entity that is coincident with region of overlap.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsOn(Autodesk.AutoCAD.Geometry.Plane)
Determines if line lies on input plane.
plane: Any plane.
Returns: true if line lies on input plane.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsOn(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if line lies on input plane.
plane: Any plane.
tolerance: Tolerance.
Returns: true if line lies on input plane.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsParallelTo(Autodesk.AutoCAD.Geometry.PlanarEntity)
Determines if line is parallel to input plane.
plane: Any planar entity.
Returns: true if line is parallel to input plane.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsParallelTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if line is parallel to input plane.
plane: Any planar entity.
tolerance: Tolerance.
Returns: true if line is parallel to input plane.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Determines if two lines are parallel.
line: Any 3D linear entity.
Returns: true if two lines are parallel.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are parallel.
line: Any 3D linear entity.
tolerance: Tolerance.
Returns: true if two lines are parallel.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.PlanarEntity)
Determines if line is perpendicular to input plane.
plane: Any planar entity.
Returns: true if line is perpendicular to input plane.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if line is perpendicular to input plane.
plane: Any planar entity.
tolerance: Tolerance.
Returns: true if line is perpendicular to input plane.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Determines if two lines are perpendicular.
line: Any 3D linear entity.
Returns: true if two lines are perpendicular.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are perpendicular.
line: Any 3D linear entity.
tolerance: Tolerance.
Returns: true if two lines are perpendicular.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsColinearTo(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Determines if two lines are colinear.
line: Any 3D linear entity.
Returns: true if two lines are colinear.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsColinearTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are colinear.
line: Any 3D linear entity.
tolerance: Tolerance.
Returns: true if two lines are colinear.

Autodesk.AutoCAD.Geometry.LinearEntity3d.GetPerpendicularPlane(Autodesk.AutoCAD.Geometry.Point3d)
Returns a plane that is perpendicular to this line and passes through intersectionPoint.
intersectionPoint: Any 3D point.
Returns: Infinite plane that is perpendicular to this line and passes through intersectionPoint.

Autodesk.AutoCAD.Geometry.LinearEntity3d.GetLine
Returns an infinite line that is coincident with this line.
Returns: Infinite line that is coincident with this line.

Autodesk.AutoCAD.Geometry.LinearEntity3d.{dtor}
