Autodesk.AutoCAD.DatabaseServices.IdMappingEventArgs
Provides data for the various events of the database.

Autodesk.AutoCAD.DatabaseServices.IdMappingEventArgs.IdMapping
Gets the IdMapping that is associated with this event.