Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder
This is a utility class used to populate a DatabaseServices.SweepOptions object.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.#ctor(Autodesk.AutoCAD.DatabaseServices.SweepOptions)


Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.PathEntityTransform
Gets or sets the coordinate system at the start/end of the path curve.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.SweepEntityTransform
Gets or sets the coordinate system for the sweep entity.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.CheckIntersections
Gets or sets the state of the self-intersection check option.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.Bank
Gets or sets a Boolean indicating whether the sweep face or curve will be banked along the sweep path.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.BasePoint
Gets or sets the base point for alignment.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.AlignStart
Gets or sets a Boolean indicating whether to align to the start or the end of the curve.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.Align
Gets or sets the flag indicating which alignment option is in use.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.AlignAngle
Gets or sets the align angle.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.ScaleFactor
Gets or sets the scale factor.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.TwistAngle
Gets or sets the twist angle.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.EndDraftDist
Gets or sets the end draft distance.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.StartDraftDist
Gets or sets the start draft distance.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.DraftAngle
Gets or sets the draft angle. This is the angle by which profile will taper as it is swept.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.SetSweepEntityTransform(Autodesk.AutoCAD.DatabaseServices.Entity[],System.Boolean)
Sets the coordinate system transformation matrix to be applied to the sweep entity, using the sweep entity geometry for calculating the transformation matrix.
sweepEntities: Sweep entity geometry to be used for computation of the sweep entity transformation matrix.
displayErrorMessages: Boolean indicates whether error messages should be displayed.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.SetPathEntityTransform(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
Sets the coordinate system at the start/end of the path curve. The sweep entity transform must be set before this call.
pathEnt: Path entity geometry to be used in the computation of the path entity transformation.
displayErrorMessages: Boolean indicates whether error messages should be displayed.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsBuilder.ToSweepOptions
populates a new DatabaseServices.SweepOptions object.
Returns: A new DatabaseServices.SweepOptions object.