Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition
Encapsulates the data required to define a spatial filter.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.Enabled


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.BackClip


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.FrontClip


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.Elevation


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.Normal


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.GetPoints
Returns the points that define the boundary.
Returns: The points that define the boundary.