Autodesk.AutoCAD.Geometry.Line2dCollection
Provides a container for Autodesk.AutoCAD.Geometry.Line2d objects.

Autodesk.AutoCAD.Geometry.Line2dCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.Line2dCollection.Count


Autodesk.AutoCAD.Geometry.Line2dCollection.Item(System.Int32)


Autodesk.AutoCAD.Geometry.Line2dCollection.RemoveAt(System.Int32)


Autodesk.AutoCAD.Geometry.Line2dCollection.Clear


Autodesk.AutoCAD.Geometry.Line2dCollection.GetEnumerator


Autodesk.AutoCAD.Geometry.Line2dCollection.CopyTo(Autodesk.AutoCAD.Geometry.Line2d[],System.Int32)


Autodesk.AutoCAD.Geometry.Line2dCollection.Add(Autodesk.AutoCAD.Geometry.Line2d)


Autodesk.AutoCAD.Geometry.Line2dCollection.IndexOf(Autodesk.AutoCAD.Geometry.Line2d)


Autodesk.AutoCAD.Geometry.Line2dCollection.Insert(System.Int32,Autodesk.AutoCAD.Geometry.Line2d)


Autodesk.AutoCAD.Geometry.Line2dCollection.Remove(Autodesk.AutoCAD.Geometry.Line2d)


Autodesk.AutoCAD.Geometry.Line2dCollection.Contains(Autodesk.AutoCAD.Geometry.Line2d)
