Autodesk.AutoCAD.Colors.TransparencyMethod
Contains the transparency methods.

Autodesk.AutoCAD.Colors.TransparencyMethod.ErrorValue
Value set if Transparency passes an invalid value.

Autodesk.AutoCAD.Colors.TransparencyMethod.ByAlpha
Use the alpha value in this class.

Autodesk.AutoCAD.Colors.TransparencyMethod.ByBlock
Use the transparency setting for the block.

Autodesk.AutoCAD.Colors.TransparencyMethod.ByLayer
Use the transparency setting for the layer.