Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits
This intermediate class represents a standard, or non-photometric light. It defines properties common to all such lights.

Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits.Shadow
Gets or sets the shadow parameters for this light.

Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits.LightColor
Gets or sets the color of emitted light.

Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits.Intensity
Gets or sets the light intensity. The value is greater than or equal to zero.

Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits.{dtor}
