Autodesk.AutoCAD.Geometry.Ray2d
Represents a half-bounded line in 2D space. An Ray2d object either has a start point but no endpoint, or has an endpoint but no start point.

Autodesk.AutoCAD.Geometry.Ray2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs a ray whose start point is point1 and passes through point2. point1 must be different from point2.
point1: Start point of ray.
point2: Any 2D point different from point1.

Autodesk.AutoCAD.Geometry.Ray2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs a ray whose start point is point and whose direction is vector. vector must not be a zero-length vector.
point: Start point of ray.
vector: Direction vector of ray.

Autodesk.AutoCAD.Geometry.Ray2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Ray2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Changes the definition of the ray so that the start point is point1 and passes through point2. point1 must be different from point2.
point1: Start point of ray.
point2: Any 2D point different from point1.

Autodesk.AutoCAD.Geometry.Ray2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Changes the definition of the ray so the start point is point and whose direction is vector. vector must not be a zero-length vector.
point: Start point of ray.
vector: Direction vector of ray.

Autodesk.AutoCAD.Geometry.Ray2d.{dtor}
