Autodesk.AutoCAD.DatabaseServices.Rectangle3d
Provides a container for the points that define a 3D rectangle.

Autodesk.AutoCAD.DatabaseServices.Rectangle3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)


Autodesk.AutoCAD.DatabaseServices.Rectangle3d.LowerRight


Autodesk.AutoCAD.DatabaseServices.Rectangle3d.LowerLeft


Autodesk.AutoCAD.DatabaseServices.Rectangle3d.UpperRight


Autodesk.AutoCAD.DatabaseServices.Rectangle3d.UpperLeft


Autodesk.AutoCAD.DatabaseServices.Rectangle3d.ToString


Autodesk.AutoCAD.DatabaseServices.Rectangle3d.ToString(System.IFormatProvider)
