Autodesk.AutoCAD.DatabaseServices.CellType
This enumeration provides values for the data types that can be represented by a DataCell object.

Autodesk.AutoCAD.DatabaseServices.CellType.ObjectId
ObjectId.

Autodesk.AutoCAD.DatabaseServices.CellType.Double
double.

Autodesk.AutoCAD.DatabaseServices.CellType.Vector
Vector3d.

Autodesk.AutoCAD.DatabaseServices.CellType.Bool
Boolean.

Autodesk.AutoCAD.DatabaseServices.CellType.SoftPtrId
SoftPointerId.

Autodesk.AutoCAD.DatabaseServices.CellType.HardPtrId
HardPointerId.

Autodesk.AutoCAD.DatabaseServices.CellType.SoftOwnerId
SoftOwnershipId.

Autodesk.AutoCAD.DatabaseServices.CellType.HardOwnerId
HardOwnershipId.

Autodesk.AutoCAD.DatabaseServices.CellType.Point
Point3d.

Autodesk.AutoCAD.DatabaseServices.CellType.CharPtr
char pointer.

Autodesk.AutoCAD.DatabaseServices.CellType.Integer
Signed 32-bit integer.

Autodesk.AutoCAD.DatabaseServices.CellType.Unknown
Unspecified, default cell type.