Autodesk.AutoCAD.DatabaseServices.DBPoint
Represents the point entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.DBPoint.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs a point that uses position for its position value. The normal is initialized to (0,0,1) (in WCS coordinates), the OCS rotation to 0, and the thickness to 0.
position: Position (in WCS coordinates) for the point.

Autodesk.AutoCAD.DatabaseServices.DBPoint.#ctor
Default constructor.Initializes the position to (0,0,0), the normal to (0,0,1), the OCS rotation to 0, and the thickness to 0. The position and normal vector are in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.DBPoint.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DBPoint.EcsRotation
Gets or sets the angle (in radians) between the OCS (formerly ECS) X axis for the point (based on the point's normal vector) and the X axis that will be used when displaying the point. This is used when PDMODE is set to display the point as something other than a ".".

Autodesk.AutoCAD.DatabaseServices.DBPoint.Normal
Gets or sets the unit normal vector for the point in WCS coordinates. The normal is used as the extrusion direction when the point has non-zero thickness. The normal also determines the plane used to display the point when PDMODE is set to display the point as something other than a ".".

Autodesk.AutoCAD.DatabaseServices.DBPoint.Thickness
Gets or sets the point's thickness value. The thickness is the point's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.DBPoint.Position
Gets or sets the points position value in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.DBPoint.{dtor}
