Autodesk.AutoCAD.DatabaseServices.PasswordOptions
Password options.

Autodesk.AutoCAD.DatabaseServices.PasswordOptions.Default


Autodesk.AutoCAD.DatabaseServices.PasswordOptions.IsExternalReference


Autodesk.AutoCAD.DatabaseServices.PasswordOptions.UpperCase
