Autodesk.AutoCAD.DatabaseServices.DeepCloneType
The type of DeepClone() and WblockClone().

Autodesk.AutoCAD.DatabaseServices.DeepCloneType.WblockObjects


Autodesk.AutoCAD.DatabaseServices.DeepCloneType.InsertCopy


Autodesk.AutoCAD.DatabaseServices.DeepCloneType.XrefInsert


Autodesk.AutoCAD.DatabaseServices.DeepCloneType.Objects
Uses DeepClone().

Autodesk.AutoCAD.DatabaseServices.DeepCloneType.Wblock
Uses WblockClone(). Follows hard ownership and hard pointer connections only. All other copy commands that use DeepClone() follow both hard and soft ownership connections from the primary object.

Autodesk.AutoCAD.DatabaseServices.DeepCloneType.SymbolTableMerge


Autodesk.AutoCAD.DatabaseServices.DeepCloneType.XrefBind
Uses WblockClone() to bring the referenced entities into your current drawing.

Autodesk.AutoCAD.DatabaseServices.DeepCloneType.Explode
When you explode an object into its parts, no cloning is performed;When you explode a block reference, AutoCAD deletes the block reference entity and copies the individual entities into the drawing. This version of EXPLODE uses DeepClone().

Autodesk.AutoCAD.DatabaseServices.DeepCloneType.Block
Uses DeepClone(). This command copies the entities into another space and erases the original entities.

Autodesk.AutoCAD.DatabaseServices.DeepCloneType.Copy
Uses DeepClone().

Autodesk.AutoCAD.DatabaseServices.DeepCloneType.Insert
When you insert a drawing,uses DeepClone() to copy the entities into the drawing.