Autodesk.AutoCAD.DatabaseServices.PlotSettings
Stores "what-to-plot" settings as a named plot setup description. The plot settings objects are stored in a PlotSettingsDictionary.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.#ctor(System.Boolean)
This constructor allows you to set whether the new plot setup is a model space type (modelType == true) or a paperspace (layout) type (modelType == false).
modelType: Boolean that determines the plot setup type.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotAsRaster
Gets a boolean indicating whether ot not the viewport will plot as a raster based on the viewport's current shade plot settings.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotWireframe
Gets a boolean indicating whether or not the viewport will plot as vector output based on the viewport's current shade plot settings.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlotId
Gets the ObjectId of the VisualStyle or RenderSettings object referenced by this object.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ModelType
Gets a Boolean indicating whether a named plot setup is a model space type or a paperspace (layout) type.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.DrawViewportsFirst
Gets or sets a Boolean indicating whether the plotting system will plot the objects in paperspace first (if it gets false), or last (if it returns true). This is relative to the floating model space viewports.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PrintLineweights
Gets or sets a Boolean indicating whether lineweights will get plotted.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ScaleLineweights
Gets or sets a Boolean indicating whether lineweights will be scaled proportionately with the plot scale.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.StdScale
Gets the standard scale value as a floating point scale.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.StdScaleType
Gets the standard scale.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.CurrentStyleSheet
Gets the name of the configured plot style table.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.CustomPrintScale
Gets the custom scale, a ratio of paperspace units to media units.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.UseStandardScale
Gets a Boolean indicating whether the layout is currently using the StdScaleType property to calculate the current plot scale.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotViewName
Gets named view indicating the portion of the layout to plot.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotWindowArea
Gets coordinates defining the portion of the layout to plot.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotType
Gets the portion of paperspace to output to the media.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlotCustomDpi
Gets or sets the shade plot custom dpi of the current PlotSettings object.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlotResLevel
Gets or sets the shade plot resolution level of the current PlotSettings object.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlot
Gets or sets the type of shade plot specified in the plot settings.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotHidden
Gets or sets a Boolean indicating whether or not the objects in paperspace are processed through the hidden line algorithm.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotCentered
Gets a Boolean indicating whether the plot will be centered. If true, the paper margins are automatically computed to position the plot in the center of the sheet.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotRotation
Gets the rotation of the plot on the paper.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShowPlotStyles
Gets or sets a Boolean indicating whether the object style is displayed during layout mode.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotPlotStyles
Gets or sets a Boolean indicating whether plot styles are plotted (as opposed to just displayed).

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotViewportBorders
Gets or sets a Boolean indicating whether the floating model space viewport borders are plotted. Note that the viewport borders are always displayed on screen during layout mode.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotPaperUnits
Gets the units used for plotting in the enumeration PlotPaperUnits.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotOrigin
Gets the plot origin offset that is applied inside of the paper margins.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.CanonicalMediaName
Gets the locale-independent name of the currently configured paper.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotPaperSize
Gets the width and height of the configured paper. This is defined as the entire physical paper area including the unprintable area.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotPaperMargins
Gets the printable area of the configured paper. The values returned are in millimeters, regardless of the units selected by the user. The values are in physical media coordinates, so they are not affected by the current scale of the drawing. This property does not take into account plots that may be rotated or mirrored..

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotConfigurationName
Gets name of configured system or PC3 plot device.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotSettingsName
Gets or sets the current name of your plot settings.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.AddToPlotSettingsDictionary(Autodesk.AutoCAD.DatabaseServices.Database)
Adds plot settings to the dictionary.
toWhichDatabase: Database to which to add plot settings object.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.SetShadePlot(Autodesk.AutoCAD.DatabaseServices.PlotSettingsShadePlotType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the plot settings for shaded or rendered plotting.
type: Type of the shade plot object.
shadePlotId: Object ID of the VisualStyle or RenderSettings object to be used as the shade plot object .

Autodesk.AutoCAD.DatabaseServices.PlotSettings.{dtor}
