Autodesk.AutoCAD.DatabaseServices.LayoutCopiedEventArgs
Provides data for LayoutCopied event of the LayoutManager class.

Autodesk.AutoCAD.DatabaseServices.LayoutCopiedEventArgs.NewName
Gets the name of the new layout.

Autodesk.AutoCAD.DatabaseServices.LayoutCopiedEventArgs.Name
Gets the name of the layout that is copied.

Autodesk.AutoCAD.DatabaseServices.LayoutCopiedEventArgs.NewId
Gets the object ID of the new layout.

Autodesk.AutoCAD.DatabaseServices.LayoutCopiedEventArgs.Id
Gets the object ID of the layout that is copied.