Autodesk.AutoCAD.DatabaseServices.IdMapping
Is used by the deep clone operation to map ObjectIds between original objects and their clones.

Autodesk.AutoCAD.DatabaseServices.IdMapping.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.IdMapping.DuplicateRecordCloning
Gets the value for duplicate record cloning, which determines what happens if symbols or dictionary entries are cloned, and a duplicate is found to already exist in the destination database.

Autodesk.AutoCAD.DatabaseServices.IdMapping.DeepCloneContext
Gets context of the deepclone operation the IdMapping object is involved in.

Autodesk.AutoCAD.DatabaseServices.IdMapping.OriginalDatabase
Gets the source database for the deep clone operation.

Autodesk.AutoCAD.DatabaseServices.IdMapping.DestinationDatabase
Gets or sets the destination database for the deep clone operation.

Autodesk.AutoCAD.DatabaseServices.IdMapping.Item(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets or sets the remaining data in the IdMapping object that has a key that matches the key passed in.
key: Name to search for.
Returns: IdPair object containing the remaining data.

Autodesk.AutoCAD.DatabaseServices.IdMapping.Add(Autodesk.AutoCAD.DatabaseServices.IdPair)
Adds an object to the end of the collection.
value: The object to be added to the end of the collection. The value can be null.
Returns: The collection index at which the value has been added.

Autodesk.AutoCAD.DatabaseServices.IdMapping.Lookup(Autodesk.AutoCAD.DatabaseServices.ObjectId)


Autodesk.AutoCAD.DatabaseServices.IdMapping.Change(Autodesk.AutoCAD.DatabaseServices.IdPair)
Searches the IdMapping object's map for the key contained in pairToChange and, if found, replaces the entry with a copy of pairToChange.
pairToChange: IdPair object with key of pairToChange to change.

Autodesk.AutoCAD.DatabaseServices.IdMapping.Delete(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Searches the IdMapping ID map for an entry that has a key matching key. If a matching entry is found, it is deleted from the ID map.
key: ObjectId which is the key of the ID pair to be deleted from the map.

Autodesk.AutoCAD.DatabaseServices.IdMapping.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Determines whether an element is in the IdMapping.
key: The object to search for in this IdMapping.
Returns: true if the IdMapping contains an object that matches value; otherwise, false.

Autodesk.AutoCAD.DatabaseServices.IdMapping.GetEnumerator
Gets an IEnumerator for the IdMapping.
Returns: An System.Collections.IEnumerator that can be used to iterate through the IdMapping.

Autodesk.AutoCAD.DatabaseServices.IdMapping.{dtor}
