Autodesk.AutoCAD.DatabaseServices.Filters.Filter
This class defines a "query."It provides the "key" to the CompositeFilteredBlockIterator.

Autodesk.AutoCAD.DatabaseServices.Filters.Filter.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Filters.Filter.IndexClass
Gets the class descriptor for the Filters.Index for this filter.

Autodesk.AutoCAD.DatabaseServices.Filters.Filter.{dtor}
