Autodesk.AutoCAD.DatabaseServices.XrefBeginOperationEventArgs
Provides data for the XrefBeginRestore, XrefBeginAttached and XrefBeginOtherAttached events of the database.

Autodesk.AutoCAD.DatabaseServices.XrefBeginOperationEventArgs.From
Gets the database being xrefed.