Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator
This class is a base class for iterator classes that are used for iterating over the records in the SymbolTable object.

Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator.Current
Gets the current record in the SymbolTable.

Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator.DeleteUnmanagedObject


Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator.MoveNext
Moves the enumerator to the next record in the SymbolTable.
Returns: true if the enumerator was successfully moved to the next record; false if the enumerator has passed the end of the SymbolTable.

Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator.Reset
Resets the enumerator to the first record in the SymbolTable.

Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator.{dtor}
