Autodesk.AutoCAD.DatabaseServices.TableStyle
Stores the table formatting properties (for example, grid visibility, lineweight, line color, and cell font, height, color, and background fill) used by Table entities.

Autodesk.AutoCAD.DatabaseServices.TableStyle.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.TableStyle.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.TableStyle.IsHeaderSuppressed
Gets or sets a true/false status for the IsHeaderSuppressed flag.

Autodesk.AutoCAD.DatabaseServices.TableStyle.IsTitleSuppressed
Gets or sets a true/false status for the IsTitleSuppressed flag.

Autodesk.AutoCAD.DatabaseServices.TableStyle.VerticalCellMargin
Gets or sets the vertical cell margin value used by the table style.

Autodesk.AutoCAD.DatabaseServices.TableStyle.HorizontalCellMargin
Gets or sets the horizontal cell margin value used by the table style.

Autodesk.AutoCAD.DatabaseServices.TableStyle.FlowDirection
Gets or sets the flow direction of the table.

Autodesk.AutoCAD.DatabaseServices.TableStyle.BitFlags
Gets or sets an unsigned integer representing the operation bit FlowDirection flags set for the TableStyle object.

Autodesk.AutoCAD.DatabaseServices.TableStyle.Description
Gets or sets the description of the table style.

Autodesk.AutoCAD.DatabaseServices.TableStyle.Name
Gets or sets the name of the table style.

Autodesk.AutoCAD.DatabaseServices.TableStyle.TextStyle(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the Object ID of the text style for a given row type currently referenced by the TableStyle object.
rowType: Row type.
Returns: The Object ID of the text style.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetTextStyle(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Sets the table object to use the TextStyleTableRecord specified by ID for the specified row types. Different row types can be OR'd.
id: TextStyleTableRecord Object ID.
rowTypes: Row types.

Autodesk.AutoCAD.DatabaseServices.TableStyle.TextHeight(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the text height for a given row type of the table style object.
rowType: Value specifying the row type for which the text height will be returned.
Returns: The text height for a given row type of the table style object.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetTextHeight(System.Double,System.Int32)
Sets the text height for the specified row types. Different row types can be OR'd.
height: Value indicating the new text height.
rowTypes: Row types for which to set the text height.

Autodesk.AutoCAD.DatabaseServices.TableStyle.Alignment(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the cell alignment for a given row type of the table style object.
rowType: Value specifying the row type for which the cell alignment value will be returned.
Returns: The cell alignment for a given row type of the table style object.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetAlignment(Autodesk.AutoCAD.DatabaseServices.CellAlignment,System.Int32)
Sets the cell alignment for the specified row types. Different row types can be OR'd.
alignment: Value indicating the new cell alignment.
rowTypes: Row types for which to set the alignment.

Autodesk.AutoCAD.DatabaseServices.TableStyle.Color(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the text color for a given row type of the table style object.
rowType: Value specifying the row type for which the Color value will be returned.
Returns: The text color for a given row type of the table style object.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetColor(Autodesk.AutoCAD.Colors.Color,System.Int32)
Sets the text color for the specified row types. Different row types can be OR'd.
color: Value indicating the new color.
rowTypes: Row types for which to set the color.

Autodesk.AutoCAD.DatabaseServices.TableStyle.BackgroundColor(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the background color for a given row type of the table style object.
rowType: Value specifying the row type for which the Color value will be returned.
Returns: The background color for a given row type of the table style object.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetBackgroundColor(Autodesk.AutoCAD.Colors.Color,System.Int32)
Sets the background color for the specified row types. Different row types can be OR'd.
color: Value indicating the new background color.
rowTypes: Row types for which to set the background color.

Autodesk.AutoCAD.DatabaseServices.TableStyle.IsBackgroundColorNone(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns true if the background color for a given row type of the table style object is set to no color value.
rowType: Value specifying the row type for which to return the Boolean indicating whether the background color is set to none.
Returns: True if the background color for a given row type of the table style object is set to no color value.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetBackgroundColorNone(System.Boolean,System.Int32)
Enables or disables the background color for the specified row types. Different row types can be OR'd.
value: Boolean indicating whether to enable the background color for the specified row type.
rowTypes: Row types for which to enable or disable the background color.

Autodesk.AutoCAD.DatabaseServices.TableStyle.GridLineWeight(Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the lineweight for a given grid line type and row type of the table style object.
gridLineType: Value specifying the type of grid line for which to return the lineweight value.
rowType: Value specifying the row type for which to return the lineweight value.
Returns: The lineweight for a given grid line type and row type of the table style object.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetGridLineWeight(Autodesk.AutoCAD.DatabaseServices.LineWeight,System.Int32,System.Int32)
Sets the lineweight for the specified grid line types and row types. Different grid line and row types can be OR'd.
lineWeight: Lineweight value.
gridLineTypes: Grid line types for which to set the lineweight.
rowTypes: Row types for which to set the lineweight.

Autodesk.AutoCAD.DatabaseServices.TableStyle.GridColor(Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the grid color for a given grid line type of the table style object.
gridLineType: Type of grid line for which to return the Color value.
rowType: Row type for which to return the color value.
Returns: The grid color for a given grid line type of the table style object.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetGridColor(Autodesk.AutoCAD.Colors.Color,System.Int32,System.Int32)
Sets the grid color for the specified grid line types and row types. Different border and row types can be OR'd.
color: Color value.
gridLineTypes: Types of grid lines for which to set the color.
rowTypes: Row types for which to set the color.

Autodesk.AutoCAD.DatabaseServices.TableStyle.GridVisibility(Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the grid visibility for a given grid line type of the table style object.
gridLineType: Value specifying the grid line type for which to return the visibility value.
rowType: Value specifying the row type for which to return the visibility value.
Returns: The grid visibility for a given grid line type of the table style object.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetGridVisibility(System.Boolean,System.Int32,System.Int32)
Sets the grid visibility for the specified grid line types and row types. Different grid line and row types can be OR'd.
visible: Visibility value.
gridLineTypes: Grid line types for which to set the visibility.
rowTypes: Row types for which to set the visibility.

Autodesk.AutoCAD.DatabaseServices.TableStyle.PostTableStyleToDatabase(Autodesk.AutoCAD.DatabaseServices.Database,System.String)
Adds a table style to the specified database.
databasePointer: The database to which to add the table style.
styleName: Name for the table style; must be a non-empty string that is less than 256 characters long and conforms to the requirements for DBDictionary key strings.
Returns: Table style object ID if the table style is successfully added to the database.

Autodesk.AutoCAD.DatabaseServices.TableStyle.DataType(Autodesk.AutoCAD.DatabaseServices.RowType)
For internal use only.
rowType: Value specifying the row type for which to return the data type and unit type.
Returns: For internal use only.

Autodesk.AutoCAD.DatabaseServices.TableStyle.UnitType(Autodesk.AutoCAD.DatabaseServices.RowType)


Autodesk.AutoCAD.DatabaseServices.TableStyle.SetDataType(Autodesk.AutoCAD.DatabaseServices.DataType,Autodesk.AutoCAD.DatabaseServices.UnitType,Autodesk.AutoCAD.DatabaseServices.RowType)
For internal use only.
nDataType: Data type to set.
nUnitType: Unit type to set.
rowTypes: Value specifying the row type for which to set the data type and unit type.

Autodesk.AutoCAD.DatabaseServices.TableStyle.Format(Autodesk.AutoCAD.DatabaseServices.RowType)
For internal use only.
rowType: Value specifying the row type for which to return the format.
Returns: For internal use only.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetFormat(System.String,Autodesk.AutoCAD.DatabaseServices.RowType)
For internal use only.
pFormat: Format to set.
rowTypes: Value specifying the row types for which to set the format .

Autodesk.AutoCAD.DatabaseServices.TableStyle.{dtor}
