Autodesk.AutoCAD.GraphicsInterface.Method
This enumeration provides values that define the color method.

Autodesk.AutoCAD.GraphicsInterface.Method.Override
Overrides the current color with the color defined by SetColor().

Autodesk.AutoCAD.GraphicsInterface.Method.Inherit
Uses the last color set in the Autodesk.AutoCAD.GraphicsInterface stream.