Autodesk.AutoCAD.DatabaseServices.FieldEvaluationContext
Specifies the context in which the field is evaluated.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationContext.Preview
Evaluated for preview. If the context is Preview, the field is always evaluated regardless of the evaluation option setting in the database.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationContext.Regen
Evaluated during drawing regeneration.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationContext.Etransmit
Evaluated during eTransmit.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationContext.Save
Evaluated during drawing save.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationContext.Plot
Evaluated during drawing plot.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationContext.Demand
Evaluated upon manual demand by the user.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationContext.Open
Evaluated during drawing open.