Autodesk.AutoCAD.DatabaseServices.PlotType
Plot type.

Autodesk.AutoCAD.DatabaseServices.PlotType.Layout
Layout information.

Autodesk.AutoCAD.DatabaseServices.PlotType.View
Last view.

Autodesk.AutoCAD.DatabaseServices.PlotType.Window
Last window.

Autodesk.AutoCAD.DatabaseServices.PlotType.Limits
Drawing limits.

Autodesk.AutoCAD.DatabaseServices.PlotType.Extents
Drawing extents.

Autodesk.AutoCAD.DatabaseServices.PlotType.Display
Last screen display.