Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits
Represents a gradient background to the underlying display system.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.Rotation
Gets or sets the angle by which the gradient background will be rotated.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.Height
Gets or sets a value representing a percentage of the second color in a three-color gradient. The start point of the second color is determined by the Horizon setting.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.Horizon
Gets or sets the horizon value indicating the percentage of unrotated height.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.ColorBottom
Gets or sets the color of the bottom portion of the background.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.ColorMiddle
Gets or sets the color of the middle portion of the background.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.ColorTop
Gets or sets the color of the top portion of the background.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.{dtor}
