Autodesk.AutoCAD.GraphicsInterface.EdgeStyleMaskValues
This is an enumeration of valid bitmasks for EdgeStyle overrides.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyleMaskValues.OverhangMask
Indicates that the fields of EdgeStyle related to overhung edges should be overridden.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyleMaskValues.JitterMask
Indicates that the fileds of EdgeStyle related to jittered edges should be overridden.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyleMaskValues.NoEdgeStyleMask
The default value for SubEntityTraits. Indicates that no part of a visual style's edge style should be overridden.