Autodesk.AutoCAD.GraphicsSystem.View
A GraphicsSystem.View object corresponds to a portion of a GUI window, a set of camera parameters that define a view, and a collection of objects to be viewed. More specifically, a GraphicsSystem.View can be used to represent an AutoCAD viewport.

Autodesk.AutoCAD.GraphicsSystem.View.#ctor(Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo,System.Boolean)


Autodesk.AutoCAD.GraphicsSystem.View.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsSystem.View.#ctor(System.IntPtr,System.Boolean,System.Boolean)


Autodesk.AutoCAD.GraphicsSystem.View.BackgroundId
Gets or sets the Object ID of the Background-derived object on the view.

Autodesk.AutoCAD.GraphicsSystem.View.VisualStyle
Gets or sets visual style set in this view.

Autodesk.AutoCAD.GraphicsSystem.View.VisualStyleId
Gets or sets the object ID of the visual style set for this view.

Autodesk.AutoCAD.GraphicsSystem.View.Device
Gets or sets the Device to which this view is attached.

Autodesk.AutoCAD.GraphicsSystem.View.StereoParameters
Gets or sets the currently configured values for magnitude and parallax.

Autodesk.AutoCAD.GraphicsSystem.View.EnableStereo
Enable/disable stereo viewing in the current view.

Autodesk.AutoCAD.GraphicsSystem.View.ExceededBounds
Gets a boolean indicating whether any viewing parameters (camera position, camera target, camera field, front/back clip plane distance, and viewing distance) have exceeded their boundaries.

Autodesk.AutoCAD.GraphicsSystem.View.IsVisible
Gets true if the view is visible.

Autodesk.AutoCAD.GraphicsSystem.View.IsValid
Gets true if the view is displaying the correct picture.

Autodesk.AutoCAD.GraphicsSystem.View.Mode
Gets or sets the current algorithm used to render the scene.

Autodesk.AutoCAD.GraphicsSystem.View.ObjectToDeviceMatrix
Gets the transformation from model space to screen space.

Autodesk.AutoCAD.GraphicsSystem.View.WorldToDeviceMatrix
Gets the transformation from world space to screen space.

Autodesk.AutoCAD.GraphicsSystem.View.ScreenMatrix
Gets the screen matrix used to transform from normalized device space to screen space.

Autodesk.AutoCAD.GraphicsSystem.View.ProjectionMatrix
Gets the projection matrix used to transform from view space to normalized device space.

Autodesk.AutoCAD.GraphicsSystem.View.ViewingMatrix
Gets the viewing matrix used to transform from world space to view space.

Autodesk.AutoCAD.GraphicsSystem.View.BackClip
Gets or sets the location of the back clipping plane as a world space distance from the camera target along the eye vector away from the camera position.

Autodesk.AutoCAD.GraphicsSystem.View.EnableBackClip
Gets or sets a Boolean indicating whether to enable the back clipping plane.

Autodesk.AutoCAD.GraphicsSystem.View.FrontClip
Gets or sets the location of the front clipping plane as a world space distance from the camera target along the eye vector towards the camera position.

Autodesk.AutoCAD.GraphicsSystem.View.EnableFrontClip
Gets or sets a Boolean indicating whether to enable the front clipping plane.

Autodesk.AutoCAD.GraphicsSystem.View.FieldHeight
Gets the camera field height.

Autodesk.AutoCAD.GraphicsSystem.View.FieldWidth
Gets the camera field width.

Autodesk.AutoCAD.GraphicsSystem.View.IsPerspective
Gets true if the projection is perspective.

Autodesk.AutoCAD.GraphicsSystem.View.UpVector
Gets the camera up vector.

Autodesk.AutoCAD.GraphicsSystem.View.Target
Gets the camera target.

Autodesk.AutoCAD.GraphicsSystem.View.Position
Gets the camera position.

Autodesk.AutoCAD.GraphicsSystem.View.ViewportBorderVisibility
Gets or sets a boolean indicating whether the viewport border is currently visible.

Autodesk.AutoCAD.GraphicsSystem.View.ViewportBorderProperties
Gets or sets the properties of the viewport border.

Autodesk.AutoCAD.GraphicsSystem.View.Viewport
Gets or sets the extents of the viewport in normalized device coordinates.

Autodesk.AutoCAD.GraphicsSystem.View.ViewportD
Gets or sets the ObjectId the extents of the viewport in normalized device coordinates.

Autodesk.AutoCAD.GraphicsSystem.View.Create(System.IntPtr,System.Boolean,System.Boolean)


Autodesk.AutoCAD.GraphicsSystem.View.SetViewportClipRegion(System.Int32,System.Int32[],System.Drawing.Point[])
This method is used to specify a clip region distinct from the rectangular region supplied via View.Viewport.
contours: Number of polygonal contours and the size of the counts array.
counts: Array; each entry corresponds to the number of device coordinate points used to specify that contour in the points array.
points: Array of points that specify polygonal contours.

Autodesk.AutoCAD.GraphicsSystem.View.RemoveViewportClipRegion
Removes the effect of any previous SetViewportClipRegion() call, restoring the viewport to a rectangular clip region specified in View.Viewport.

Autodesk.AutoCAD.GraphicsSystem.View.SetView(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double)
Sets the camera parameters needed to define the transformation from world space to normalized device coordinates. All values are specified in the world space coordinate system.
position: Camera position.
target: Camera target.
upVector: Camera up vector.
fieldWidth: Width of the projection plane.
fieldHeight: Height of the projection plane.

Autodesk.AutoCAD.GraphicsSystem.View.SetView(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,Autodesk.AutoCAD.GraphicsSystem.Projection)
Sets the camera parameters needed to define the transformation from world space to normalized device coordinates. All values are specified in the world space coordinate system.
position: Camera position.
target: Camera target.
upVector: Camera up vector.
fieldWidth: Width of the projection plane.
fieldHeight: Height of the projection plane.
projection: Parallel or perspective.

Autodesk.AutoCAD.GraphicsSystem.View.Add(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsSystem.Model)
This method specifies which portions of which models are viewed by this view.
drawable: Root of scene graph.
model: Model to which all notifications for the above scene graph are directed.
Returns: Always true.

Autodesk.AutoCAD.GraphicsSystem.View.Erase(Autodesk.AutoCAD.GraphicsInterface.Drawable)
Removes the specified drawable from the list of viewed drawables.
drawable: Drawable to be removed from the view.
Returns: true if the drawable was found.

Autodesk.AutoCAD.GraphicsSystem.View.Invalidate(System.Drawing.Rectangle)
Use this method to indicate that a specific rectangle needs to be redrawn.
rect: Rectangle specified in device coordinates.

Autodesk.AutoCAD.GraphicsSystem.View.BeginInteractivity(System.Double)
Puts the view into the interactive state.
frameRateInHZ: Desired frame rate per second.

Autodesk.AutoCAD.GraphicsSystem.View.FreezeLayer(System.Int32)
Informs the view that the specified layer is frozen in this view. By default all layers are thawed.
layerId: Layer to be treated as frozen.

Autodesk.AutoCAD.GraphicsSystem.View.ThawLayer(System.Int32)
Informs the view that the specified layer should be thawed in this view.
layerId: Layer to be treated as thawed.

Autodesk.AutoCAD.GraphicsSystem.View.Dolly(System.Double,System.Double,System.Double)
Translates the camera target and position by the specified camera space dolly amounts.All other camera parameters are left unaffected. The basis of camera space is as follows: positive Y is along the up vector, positive Z is along the eye vector from the camera position to the camera target, and X is the cross product of those two vectors.
x: Camera space x dolly amount.
y: Camera space y dolly amount.
z: Camera space z dolly amount.

Autodesk.AutoCAD.GraphicsSystem.View.Dolly(Autodesk.AutoCAD.Geometry.Vector3d)
Translates the camera target and position by the specified camera space dolly vector. All other camera parameters are left unaffected. The basis of camera space is as follows: positive Y is along the up vector, positive Z is along the eye vector from the camera position to the camera target, and X is the cross product of those two vectors.
vector: Camera space dolly vector.

Autodesk.AutoCAD.GraphicsSystem.View.Roll(System.Double)
Rotates the camera's up vector about the eye vector by the specified amount in radians. Positive angles correspond to a clockwise rotation when viewed from the camera position to the camera target.
angle: Angular rotation about the eye vector in radians.

Autodesk.AutoCAD.GraphicsSystem.View.Orbit(System.Double,System.Double)
Orbits the camera.
x: Cross product of the up vector and the eye vector.
y: Up vector.

Autodesk.AutoCAD.GraphicsSystem.View.Zoom(System.Double)
Changes the viewing field (the focal length) of the camera to give the effect of dynamically moving in or out of a scene. The camera position and target are not changed. The specified factor must be positive.
factor: Zoom factor.

Autodesk.AutoCAD.GraphicsSystem.View.ZoomExtents(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
modifies the current view such that the input bounding box defined by the two extents points is completely within the view.
minPoint: WCS point representing the corner of the bounding box extents.
maxPoint: WCS point representing the corner of the bounding box extents.

Autodesk.AutoCAD.GraphicsSystem.View.ZoomWindow(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Modifies the current view such that the new window displays the region defined by the input screen coordinates. The aspect ratio is automatically maintained.
lowerLeft: Screen coordinate of the lower-left point of the new zoom window.
upperRight: Screen coordinate of the upper-right point of the new zoom window.

Autodesk.AutoCAD.GraphicsSystem.View.Pan(System.Double,System.Double)
Pans the camera.
x: Cross product of the up vector and the eye vector.
y: Up vector.

Autodesk.AutoCAD.GraphicsSystem.View.PointInView(Autodesk.AutoCAD.Geometry.Point3d)
Returns true if point is visible in the view frustum of this object.
point: WCS point to test.
Returns: true if point is visible in the view frustum of this object.

Autodesk.AutoCAD.GraphicsSystem.View.ExtentsInView(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Returns true if the bounding box defined by minPoint and maxPoint is at least partially visible in the view frustum of the current View object.
minPoint: WCS point of the corner of the bounding box extents.
maxPoint: WCS point of the corner of the bounding box extents.
Returns: true if the bounding box defined by minPoint and maxPoint is at least partially visible in the view frustum of the current View object.

Autodesk.AutoCAD.GraphicsSystem.View.Clone
Returns a new copy of this object.
Returns: A new copy of this object.

Autodesk.AutoCAD.GraphicsSystem.View.Clone(System.Boolean,System.Boolean)
Returns a new copy of this object.
cloneViewParameters: Boolean indicating whether the view parameters of the new view will be identical to the original view.
cloneGeometry: Boolean indicating whether the {Drawable, Model} pairs of the new view will be identical to those of the original view.
Returns: A new copy of this object.

Autodesk.AutoCAD.GraphicsSystem.View.GetSnapshot(System.Drawing.Rectangle)
Gets a snapshot of the current graphics state of the view.
rectangle: The region of the snapshot.
Returns: A snapshot of the current graphics state of the view.

Autodesk.AutoCAD.GraphicsSystem.View.RenderToImage
Returns a rendered image of the graphics state of this view.
Returns: A rendered image of the graphics state of this view.

Autodesk.AutoCAD.GraphicsSystem.View.RenderToImage(Autodesk.AutoCAD.GraphicsInterface.Drawable,System.Drawing.Rectangle)
Returns a rendered image of the graphics state of this view.
settings: RenderSetttings-derived settings object.
rectangle: The complete view or portion of the view to be rendered.
Returns: A rendered image of the graphics state of this view.

Autodesk.AutoCAD.GraphicsSystem.View.EnableDefaultLighting(System.Boolean)
Enable or disable default lighting as well as set the type.
bEnable: Flag to enable or disable default lighting.

Autodesk.AutoCAD.GraphicsSystem.View.EnableDefaultLighting(System.Boolean,Autodesk.AutoCAD.GraphicsSystem.DefaultLightingType)
Enable or disable default lighting as well as set the type.
bEnable: Flag to enable or disable default lighting.
type: Type of default lighting to use.

Autodesk.AutoCAD.GraphicsSystem.View.GetNumPixelsInUnitSquare(Autodesk.AutoCAD.Geometry.Point3d)
Gets a 2D point describing the number of pixels in a unit square for the height and width.
givenWorldpt: WCS point for the center point of the display coordinate unit square.
Returns: Gets a 2D point describing the number of pixels in a unit square for the height and width.

Autodesk.AutoCAD.GraphicsSystem.View.GetNumPixelsInUnitSquare(Autodesk.AutoCAD.Geometry.Point3d,System.Boolean)
Gets a 2D point describing the number of pixels in a unit square for the height and width.
givenWorldpt: WCS point for the center point of the display coordinate unit square.
includePerspective: Boolean indicating perspective mode.
Returns: Gets a 2D point describing the number of pixels in a unit square for the height and width.

Autodesk.AutoCAD.GraphicsSystem.View.DeleteUnmanagedObject


Autodesk.AutoCAD.GraphicsSystem.View.{dtor}
