Autodesk.AutoCAD.DatabaseServices.TableStyleFlags
For internal use only.

Autodesk.AutoCAD.DatabaseServices.TableStyleFlags.TableStyleModified
Indicates the data type of the table style was modified (internal use flag).

Autodesk.AutoCAD.DatabaseServices.TableStyleFlags.HorizontalInsideLineThird
Indicates the horizontal bottom grid line of the subheader row is on top of the draw order.

Autodesk.AutoCAD.DatabaseServices.TableStyleFlags.HorizontalInsideLineSecond
Indicates the horizontal bottom grid line of the header row is on top of the draw order.

Autodesk.AutoCAD.DatabaseServices.TableStyleFlags.HorizontalInsideLineFirst
Indicates the horizontal bottom grid line of the title row is on top of the draw order.