Autodesk.AutoCAD.Geometry.Torus
Represents toroidal segment.

Autodesk.AutoCAD.Geometry.Torus.#ctor(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Constructs a toroidal segment defined by input data.
majorRadius: Major radius.
minorRadius: Minor radius.
origin: Center.
axisOfSymmetry: Axis of rotation.
referenceAxis: Direction to the zero meridian.
startAngleU: Start longitude.
endAngleU: End longitude.
startAngleV: Start latitude.
endAngleV: End latitude.

Autodesk.AutoCAD.Geometry.Torus.#ctor(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a toroidal segment defined by input data.
majorRadius: Major radius.
minorRadius: Minor radius.
origin: Center.
axisOfSymmetry: Axis of rotation.

Autodesk.AutoCAD.Geometry.Torus.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.Torus.IsHollow
Gets true when the major radius is greater than the minor radius, producing a solid with a hole in the middle.

Autodesk.AutoCAD.Geometry.Torus.IsDegenerate
Gets true when the minor radius is less than or equal to zero or when the major radius is less than or equal to the negative of the minor radius.

Autodesk.AutoCAD.Geometry.Torus.IsDoughnut
Gets true when the major radius is greater than the minor radius, producing a solid with a hole in the middle.

Autodesk.AutoCAD.Geometry.Torus.IsVortex
Gets true when the major radius is equal to the minor radius.

Autodesk.AutoCAD.Geometry.Torus.IsApple
Gets true when the major radius is less than the minor radius but greater than zero, producing a solid with a dimple in the middle.

Autodesk.AutoCAD.Geometry.Torus.IsLemon
Gets true when the major radius is less than zero but the absolute value is not as large as the minor radius.

Autodesk.AutoCAD.Geometry.Torus.IsOuterNormal
Gets a flag indicating if the surface normal is pointing outside the closed torus.

Autodesk.AutoCAD.Geometry.Torus.ReferenceAxis
Gets the direction to the zero meridian.

Autodesk.AutoCAD.Geometry.Torus.AxisOfSymmetry
Gets the axis of rotation.

Autodesk.AutoCAD.Geometry.Torus.Center
Gets the center of the torus.

Autodesk.AutoCAD.Geometry.Torus.MinorRadius
Gets or sets the minor radius.

Autodesk.AutoCAD.Geometry.Torus.MajorRadius
Gets or sets the major radius.

Autodesk.AutoCAD.Geometry.Torus.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Torus.GetAnglesInU
Computes start and end longitudes.
Returns: Start and end longitudes.

Autodesk.AutoCAD.Geometry.Torus.GetAnglesInV
Computes start and end latitudes.
Returns: Start and end latitudes.

Autodesk.AutoCAD.Geometry.Torus.SetAnglesInU(System.Double,System.Double)
Changes start and end longitudes to the input data.
startAngle: Start longitude.
endAngle: End longitude.

Autodesk.AutoCAD.Geometry.Torus.SetAnglesInV(System.Double,System.Double)
Changes start and end latitudes to the input data.
startAngle: Start latitude.
endAngle: End latitude.

Autodesk.AutoCAD.Geometry.Torus.Set(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Changes torus definition to the input data.
majorRadius: Major radius.
minorRadius: Minor radius.
origin: Center.
axisOfSymmetry: Axis of rotation.
referenceAxis: Direction to the zero meridian.
startAngleU: Start longitude.
endAngleU: End longitude.
startAngleV: Start latitude.
endAngleV: End latitude.

Autodesk.AutoCAD.Geometry.Torus.Set(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes torus definition to the input data.
majorRadius: Major radius.
minorRadius: Minor radius.
origin: Center.
axisOfSymmetry: Axis of rotation.

Autodesk.AutoCAD.Geometry.Torus.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Computes intersections with a linear entity.
linearEntity: Index of a knot.
Returns: Intersections with a linear entity.

Autodesk.AutoCAD.Geometry.Torus.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Computes intersections with a linear entity.
linearEntity: Index of a knot.
tolerance: Tolerance.
Returns: Intersections with a linear entity.

Autodesk.AutoCAD.Geometry.Torus.{dtor}
