Autodesk.AutoCAD.Geometry.PolylineCurve2d
Represents a piecewise linear spline entity in 2D space.

Autodesk.AutoCAD.Geometry.PolylineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,System.Double)
Constructs a polyline approximating a curve within the specified tolerance.
curve: Curve to be approximated by polyline.
epsilon: Approximation tolerance.

Autodesk.AutoCAD.Geometry.PolylineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point2dCollection)
Description to come.
knots: Description to come.
controlPoints: Description to come.

Autodesk.AutoCAD.Geometry.PolylineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection)
Constructs a polyline with the specified fit points.
points: Array of fit points.

Autodesk.AutoCAD.Geometry.PolylineCurve2d.NumberOfFitPoints
Gets number of fit points.

Autodesk.AutoCAD.Geometry.PolylineCurve2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.PolylineCurve2d.FitPointAt(System.Int32)
Returns fit point at the specified index.
i: Index of a fit point.
Returns: Fit point at the specified index.

Autodesk.AutoCAD.Geometry.PolylineCurve2d.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Resets fit point at the specified index to the input point.
i: Index of a fit point.
point: Fit point.

Autodesk.AutoCAD.Geometry.PolylineCurve2d.{dtor}
