Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits
This class is used to control the current values of the color, layer, linetype, fill type, and graphics system marker attributes for graphics primitives.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.SelectionOnlyGeometry
Gets or sets a Boolean to indicate whether geometry is for selection only.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.ShadowFlags
Gets or sets the shadow flags for a graphics primitive using this SubEntityTraits object.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.DrawFlags
Gets or sets the drawing flags for a graphics primitive. Allows the primitive to be drawn with or without back faces enabled.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.EdgeStyleOverride
Gets or sets the current EdgeStyleMask and EdgeStyle override properties.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.VisualStyle
Gets or sets the object ID of the visual style in the subentity traits.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Sectionable
Gets or sets true if the graphics primitives drawn with this object will participate in sectioning.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Mapper
Gets or sets the current mapper.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Material
Gets or sets the database ID of the current material assignment.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.PlotStyleDescriptor


Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Thickness
Gets or sets an extrusion in WCS units along the positive Z axis.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.LineTypeScale
Gets or sets the scaling factor of linetype.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.LineWeight
Gets or sets the lineweight.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.FillType
Gets or sets the FillType currently set in the SubEntityTraits object.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.LineType
Gets or sets the ObjectId of the LinetypeTableRecord that is currently set in the SubEntityTraits object to be used to when drawing graphics primitives.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Layer
Gets or sets the ObjectId of the LayerTableRecord that is currently set in the SubEntityTraits object to be used to draw graphics primitives on.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.TrueColor
Gets or sets color through EntityColor class.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Color
Gets or sets the AutoCAD color index value currently set within the SubEntityTraits object.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.SetSelectionMarker(System.Int32)
Sets the SubEntityTraits object to use markerId as the graphics marker for all graphics primitives drawn until the next call to this method, or the end of the WorldDraw() or ViewportDraw() execution.
markerId: Non-zero integer to use as graphics system marker.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.{dtor}
