Autodesk.AutoCAD.Geometry.ClipBoundary2d
This class defines a planar clipping object for clipping arbitrary 2D polygons or polylines to 2D convex open or closed polyline curves or rectangles. The implementation is similar to the Sutherland-Hodgman pipeline clipping algorithm.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection)
Constructs a n convex open or closed polyline clip boundary (one or more edges).
clipBoundary: 2d point array.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs an ortho-aligned rectangular clip boundary. Two diagonally opposite corners define the rectangle.Input segments that lie on the boundary are considered "inside".The clip boundary object can be constructed or set once and used repeatedly.
firstCorner: Corner of a rectangle.
secondCorner: Corner of a rectangle.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.#ctor
Default constructor. If this constructor is used, one of the Set methods must be called before the object can be used for clipping.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.ClipBoundary2d.Set(Autodesk.AutoCAD.Geometry.Point2dCollection)
Resets the object to an convex open or closed polyline clip boundary (one or more edges).
clipBoundary: 2d point array.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Resets the object to an ortho-aligned rectangular clip boundary.
firstCorner: Corner of a rectangle.
secondCorner: Corner of a rectangle.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.ClipPolygon(Autodesk.AutoCAD.Geometry.Point2dCollection)
Clips the specified closed polygon against the clip boundary.
rawVertices: 2d point array defining the input polygon. Self-intersecting and winding polygons are allowed.
Returns: ClipBoundary2dData object.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.ClipPolyline(Autodesk.AutoCAD.Geometry.Point2dCollection)
Clips the specified closed polyline against the clip boundary.
rawVertices: 2d point array defining the input polyline. Self-intersecting and winding polylines are allowed.
Returns: ClipBoundary2dData object.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.{dtor}
