Autodesk.AutoCAD.DatabaseServices.Dimension
Is the base class for the classes that represent all the dimension entity types within AutoCAD. The appearance of dimensions is controlled by dimension variable settings and dimension styles.

Autodesk.AutoCAD.DatabaseServices.Dimension.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Dimension.Dimblk2
Gets or sets the object ID of the block reference that is the current DIMBLK2 value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimblk1
Gets or sets the object ID of the block reference that is the current DIMBLK1 value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimblk
Gets or sets the object ID of the block reference that is the current DIMBLK value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimpost
Gets or sets the character string that is the current DIMPOST value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimapost
Gets or sets the character string that is the current DIMAPOST value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimzin
Gets or sets the current DIMZIN value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimupt
Gets or sets the current DIMUPT value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtzin
Gets or sets the current DIMTZIN value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtxt
Gets or sets the current DIMTXT value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtxsty
Gets or sets the objectId of the textStyle specified by the current DIMTXSTY value of the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtvp
Gets or sets the current DIMTVP value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtsz
Gets or sets the current DIMTSZ value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtp
Gets or sets the current DIMTP value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtolj
Gets or sets the current DIMTOLJ value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtol
Gets or sets the current DIMTOL value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtoh
Gets or sets the current DIMTOH value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtofl
Gets or sets the current DIMTOFL value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtmove
Gets or sets the current DIMTMOVE value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtm
Gets or sets the current DIMTM value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtix
Gets or sets the current DIMTIX value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtih
Gets or sets the current DIMTIH value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtfillclr
Gets or sets the current dimension background color (if Dimtfill is set to 1).

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtfill
Gets or sets the dimension background color state.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtfac
Gets or sets the current DIMTFAC value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtdec
Gets or sets the current DIMTDEC value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtad
Gets or sets the current DIMTAD value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsoxd
Gets or sets the current DIMSOXD value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimse2
Gets or sets the current DIMSE2 value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimse1
Gets or sets the current DIMSE1 value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsd2
Gets or sets the current DIMSD2 value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsd1
Gets or sets the current DIMSD1 value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimscale
Gets or sets the current DIMSCALE value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsah
Gets or sets the current DIMSAH value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimrnd
Gets or sets the current DIMRND value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlwe
Gets or sets the current DIMLWE value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlwd
Gets or sets the current DIMLWD value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlunit
Gets or sets the current DIMLUNIT value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimltype
Gets or sets the dimension linetype.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimltex2
Gets or sets the object ID of the linetype of extension line 2.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimltex1
Gets or sets the object ID of the linetype of extension line 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlim
Gets or sets the current DIMLIM value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlfac
Gets or sets the current DIMFAC value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimldrblk
Gets or sets the object ID of the block reference that is the current DIMLDRBLK value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimjust
Gets or sets the current DIMJUST value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimjogang
Gets or sets the current large radial angle.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimgap
Gets or sets the current DIMGAP value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimfxlen
Gets or sets the fixed extension lines value.

Autodesk.AutoCAD.DatabaseServices.Dimension.DimfxlenOn
Gets or sets a value that indicates whether the fixed extension lines are on.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimfrac
Gets or sets the current DIMFRAC value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimexo
Gets or sets the current DIMEXO value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimexe
Gets or sets the current DIMEXE value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimdsep
Gets or sets the current DIMDSEP value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimdli
Gets or sets the current DIMDLI value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimdle
Gets or sets the current DIMDLE value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimdec
Gets or sets the current DIMDEC value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimclrt
Gets or sets the current DIMCLRT value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimclre
Gets or sets the current DIMCLRE value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimclrd
Gets or sets the current DIMCLRD value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimcen
Gets or sets the current DIMCEN value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimazin
Gets or sets the current DIMAZIN value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaunit
Gets or sets the current DIMAUNIT value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimatfit
Gets or sets the current DIMATFIT value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimasz
Gets or sets the current DIMASZ value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimarcsym
Gets or sets the arc length placement value.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltz
Gets or sets the current DIMALTZ value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltu
Gets or sets the current DIMALTU value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimalttz
Gets or sets the current DIMALTTZ value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimalttd
Gets or sets the current DIMALTTD value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltrnd
Gets or sets the current DIMALTRND value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltf
Gets or sets the current DIMALTF value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltd
Gets or sets the current DIMALTD value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimalt
Gets or sets the current DIMALT value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimadec
Gets or sets the current DIMADEC value for the dimension. If the value is overridden for this dimension, then that value is returned; otherwise, gets or sets the value from this dimension's dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.Measurement
Gets the current measurement value for this dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.DimBlockPosition
Gets the relative position point of the block referenced by the dimension (in WCS coordinates).

Autodesk.AutoCAD.DatabaseServices.Dimension.DimBlockId
Gets or sets the object ID of the BlockTableRecord containing the entities that this dimension displays.

Autodesk.AutoCAD.DatabaseServices.Dimension.HorizontalRotation
Gets or sets the horizontal rotation value (in radians) of the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.DimstyleData
Gets or sets the DimstyleData property value.

Autodesk.AutoCAD.DatabaseServices.Dimension.TextLineSpacingFactor
Gets or sets the line spacing factor(a value between 0.25 and 4.00).

Autodesk.AutoCAD.DatabaseServices.Dimension.TextLineSpacingStyle
Gets or sets the line spacing style for the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.TextAttachment
Gets or sets the attachment point value for the text of the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.DimensionStyle
Gets or sets the object ID of the DimStyleTableRecord referenced by the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.TextRotation
Gets or sets the rotation angle (in radians) of the dimension's annotation text.

Autodesk.AutoCAD.DatabaseServices.Dimension.DimensionText
Gets or sets a copy of the user-supplied dimension annotation text string (including any multiline text formatting characters).

Autodesk.AutoCAD.DatabaseServices.Dimension.Elevation
Gets or sets a copy of the dimension's elevation value. Elevation defines the distance from WCS origin to the plane on which the dimension lies.

Autodesk.AutoCAD.DatabaseServices.Dimension.Normal
Gets or sets the unit normal vector (in WCS coordinates) for the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.UsingDefaultTextPosition
Gets or sets true if the text is in the default position for the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.TextPosition
Gets or sets the text position point (in WCS coordinates). This is the middle center point of the text (which is itself an mtext object with middle-center justification).

Autodesk.AutoCAD.DatabaseServices.Dimension.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
Compares the dimstyledata in the record style with the data in the record referenced by the dimension, and applies any differences as dimension variable overrides on the dimension.
style: DimStyleTableRecord whose data is to be applied to this dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.GetDimstyleData
Copies the dimstyle information from the DimStyleTableRecord referenced by the dimension into the DimStyleTableRecord pointed to by the return value. After copying the data, any dimension variable overrides currently applied to the dimension will be copied into the record pointed to by the return value.
Returns: Represents the effective style settings currently in use by this object.

Autodesk.AutoCAD.DatabaseServices.Dimension.RecomputeDimensionBlock(System.Boolean)
Updates the block table record the dimension references to match any changes made to the dimension since the last time the block table record was updated.
forceUpdate: Boolean indicating whether or not to force an update on screen.

Autodesk.AutoCAD.DatabaseServices.Dimension.GenerateLayout
Update the dimension according to the current dimension style.It works similar to the Dim, Update subcommand. It computes dimension geometry, including extension lines, dimension lines, dimension arcs, dimension text, arrowheads from given definition points and dimension style. The generated dimension geometry are maintained internally by member data "mGeom" which is a list of in-memory Entities.

Autodesk.AutoCAD.DatabaseServices.Dimension.RemoveTextField
If this object contains a text field, this method removes it from the extension dictionary and deletes the field object.

Autodesk.AutoCAD.DatabaseServices.Dimension.FieldToMText(Autodesk.AutoCAD.DatabaseServices.MText)
If this object contains a text field, this method copies the field and adds the copy to dimMText.
dimMText: MText object to which the new field will be attached.

Autodesk.AutoCAD.DatabaseServices.Dimension.FieldFromMText(Autodesk.AutoCAD.DatabaseServices.MText)
If dimMText contains a text field, this method copies that field and adds the copy to this object.
dimMText: MText object from which the text field is copied.

Autodesk.AutoCAD.DatabaseServices.Dimension.FormatMeasurement(System.Double,System.String)


Autodesk.AutoCAD.DatabaseServices.Dimension.{dtor}
