Autodesk.AutoCAD.DatabaseServices.DwgVersion
DwgVersion Enum.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.Current
Depends on the current release and may change.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.Max


Autodesk.AutoCAD.DatabaseServices.DwgVersion.Unknown


Autodesk.AutoCAD.DatabaseServices.DwgVersion.Newest


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1800
R18 late version.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1800a
R18 mid version.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1015


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1500


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1014
R14.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1013


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1012
R13.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1011


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1010


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1009
R11 and R12.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1008


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1007


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1006
Release 10.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1005


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1004
Release 9.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1003
AutoCAD 2.6.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1002
AutoCAD 2.5.

Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1001


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC2To22


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC2To21


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC2To10


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC2To20


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1To50


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1To40


Autodesk.AutoCAD.DatabaseServices.DwgVersion.AC1To2


Autodesk.AutoCAD.DatabaseServices.DwgVersion.MC0To0
