Autodesk.AutoCAD.DatabaseServices.Line
Represents the line entity in AutoCAD. A line object is a 3D object that is specified by its start point, endpoint, and normal vector. In addition, the line object supports thickness along its normal vector direction (that is, height or "extrusion").

Autodesk.AutoCAD.DatabaseServices.Line.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor initializes the line object to use start as the start point, and end as the endpoint. Both points must be in WCS coordinates.
pointer1: Line start point (WCS coordinates).
pointer2: Line end point (WCS coordinates).

Autodesk.AutoCAD.DatabaseServices.Line.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Line.Normal
Gets or sets the line's unit normal vector in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Line.Thickness
Gets or sets the line's thickness value. The thickness is the line's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.Line.EndPoint
Gets or sets the line's endpoint in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Line.StartPoint
Gets or sets the line's start point in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Line.{dtor}
