Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
This constructor creates a spline initialized to be an elliptical arc.
center: Center point (in WCS coordinates) of the elliptical arc.
unitNormal: Vector (in WCS coordinates) representing the normal to the elliptical arc.
majorAxis: Major axis vector (in WCS coordinates) of the elliptical arc, measured from the ellipse center point to the ellipse start point.
radiusRatio: Ratio of minor or major axis length.
startAngle: Angle (in radians) of start point of elliptical arc.
endAngle: Angle (in radians) of end point of elliptical arc.

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(System.Int32,System.Boolean,System.Boolean,System.Boolean,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,System.Double,System.Double)
Creates a spline using the parameters passed in.
degree: Specifies degree of spline.
rational: true if the spline is rational.
closed: true if the spline is closed.
periodic: true if the spline is periodic.
controlPoints: Specifies array of control points (in WCS coordinates) of the spline.
knots: Array of doubles that specifies the knot values of the spline.
weights: Array of doubles that specifies the weights at each control point.
controlPointTolerance: Specifies control points tolerance of spline.
knotTolerance: Specifies knot value tolerance of spline.

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Int32,System.Double)
Creates a spline that attempts to fit an order degree curve to the array of points within the tolerance fitTolerance. A fitTolerance of 0 will cause the curve to be interpolated precisely through all the points in the points array.
point: Array of points (in WCS coordinates) through which to fit the curve.
startTangent: Specifies the tangent at the start of the curve.
endTangent: Specifies the tangent at the end of the curve.
order: Order of the spline to be created (in the range 2 to 26).
fitTolerance: Tolerance to which the spline should approximate fitPoints.

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int32,System.Double)
Creates a spline that attempts to fit an order degree curve to the array of points within the tolerance fitTolerance. A fitTolerance of 0 causes the curve to be interpolated precisely through all the points in the points array.
point: Array of points (in WCS coordinates) through which to fit the curve.
order: Order of the spline to be created (in the range 2 to 26).
fitTolerance: Tolerance to which the spline should approximate fitPoints.

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Spline.NurbsData
Gets or sets the NURBS data of the spline.

Autodesk.AutoCAD.DatabaseServices.Spline.FitData
Gets or sets all the fit points (in WCS coordinates), fit tolerance, and, if tangents exist, the start and end tangents of the spline.

Autodesk.AutoCAD.DatabaseServices.Spline.HasFitData
Gets true if and only if the spline has fit data associated with it.

Autodesk.AutoCAD.DatabaseServices.Spline.EndFitTangent
Gets end point tangent vector (in WCS coordinates) of spline.

Autodesk.AutoCAD.DatabaseServices.Spline.StartFitTangent
Gets start point tangent vector (in WCS coordinates) of spline.

Autodesk.AutoCAD.DatabaseServices.Spline.FitTolerance
Gets or sets the tolerance value used for curve fitting. This is the maximum distance (in drawing units) that the spline curve is allowed to deviate from the fit points.

Autodesk.AutoCAD.DatabaseServices.Spline.FitTol
Gets or sets the new fit point tolerance for the spline and then refits the spline curve.

Autodesk.AutoCAD.DatabaseServices.Spline.NumFitPoints
Gets the number of fit points associated with the spline.

Autodesk.AutoCAD.DatabaseServices.Spline.NumControlPoints
Gets the number of control points in the spline.

Autodesk.AutoCAD.DatabaseServices.Spline.Degree
Gets the degree of the spline's polynomial representation. The value is in the range 1 to 25.

Autodesk.AutoCAD.DatabaseServices.Spline.IsRational
Gets true if and only if the spline is rational.

Autodesk.AutoCAD.DatabaseServices.Spline.IsNull
Gets true if this Spline object does not have an gelib object within it.

Autodesk.AutoCAD.DatabaseServices.Spline.ElevateDegree(System.Int32)
Increases the degree (which is the same as the order -1) of the spline to newDegree.
newDegree: New spline degree value (in the range (existing degree) to 25).

Autodesk.AutoCAD.DatabaseServices.Spline.GetControlPointAt(System.Int32)
Returns the value of the control point at position index in the list of control points.
index: Index (0 based) of point to get.
Returns: Point (in WCS coordinates) at index.

Autodesk.AutoCAD.DatabaseServices.Spline.SetControlPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Sets point (in WCS coordinates) to be the control point at the index position in the control points list replacing the point value that was previously at index position.
index: Index (0 based) of control point to replace.
point: New control point (in WCS coordinates).

Autodesk.AutoCAD.DatabaseServices.Spline.GetFitPointAt(System.Int32)
Returns the value of the fit point at position index.
index: Index (0 based) value.
Returns: Fit point (in WCS coordinates) at index.

Autodesk.AutoCAD.DatabaseServices.Spline.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Sets point (in WCS coordinates) to be the fit point at the index position in the fit points list (replacing the point value previously at index) and then refits the spline.
index: Index (0 based) of fit point to replace.
point: New fit point (in WCS coordinates).

Autodesk.AutoCAD.DatabaseServices.Spline.InsertFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Adds point to the list of fit points and refits the spline.point is added at the index position in the fit points list.If index is negative, then point is added at the beginning of the spline. If index is greater than the number of fit points in the spline, then point is added at the end of the spline.
index: Index (0 based) where new fit point is to be inserted.
point: New fit point (in WCS coordinates).

Autodesk.AutoCAD.DatabaseServices.Spline.RemoveFitPointAt(System.Int32)
Removes the fit point at index in the list of fit points of the spline and refits the spline. There must be at least three fit points in the spline for this function to succeed.
index: Index (0 based) of fit point to be removed.

Autodesk.AutoCAD.DatabaseServices.Spline.WeightAt(System.Int32)
Returns the weight of the control point at index.
index: Index (0 based) of control point.
Returns: The weight of the control point at index.

Autodesk.AutoCAD.DatabaseServices.Spline.SetWeightAt(System.Int32,System.Double)
Changes the weight of the point at the index location in the control points array to weight. If the spline is not a rational spline, then it is converted to a rational spline.
index: Index (0 based) of control point at which to change the weight.
weight: New weight value.

Autodesk.AutoCAD.DatabaseServices.Spline.InsertKnot(System.Double)
Inserts a new knot into the spline at the location on the spline defined by value. The value value must be within the spline's parameter range.
value: Parameter where knot is to be added.

Autodesk.AutoCAD.DatabaseServices.Spline.ReverseCurve
Reverses the parameterization of the curve. The start becomes the end and visa versa.

Autodesk.AutoCAD.DatabaseServices.Spline.{dtor}
