Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d
Represents the intersection set of two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval)
Constructs an object that represents the intersection of the two input curves.
curve1: First curve.
curve2: Second curve.
range1: First range interval.
range2: Second range interval.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an object that represents the intersection of the two input curves. Intersection points and overlaps are only returned if they are within the two specified parameter ranges. Intersection points are returned within the accuracy of the specified tolerance (or to within the default tolerance if no tolerance parameter is specified).
curve1: First curve.
curve2: Second curve.
range1: First range interval.
range2: Second range interval.
tolerance: Tolerance value.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d)
Constructs an object that represents the intersection of the two input curves.
curve1: First curve.
curve2: Second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an object that represents the intersection of the two input curves. Intersection points are returned within the accuracy of the specified tolerance (or to within the default tolerance if no tolerance parameter is specified).
curve1: First curve.
curve2: Second curve.
tolerance: Tolerance value.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor
This default constructor would typically be used as a placeholder where the curves would be specified by a subsequent call to one of the Set() Methods. This constructor sets the two curves to be the infinite lines represented by the X and Y axes.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.OverlapDirection
Gets true if the two curves are oriented in the same direction where they overlap.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.OverlapCount
Gets the number of intervals of overlap between the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.NumberOfIntersectionPoints
Gets the number of intersection points between the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Tolerance
Gets the tolerance that will be used when intersecting the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Curve2
Gets the second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Curve1
Gets the first curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetIntersectionRanges
Returns the two intervals for which intersection points.
Returns: The two intervals for which intersection points.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetIntersectionPoint(System.Int32)
Returns the specified intersection point.
number: Index to the intersection desired.
Returns: The specified intersection point.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetIntersectionParameters(System.Int32)
Returns the parameter values on each curve of the specified intersection point.
intersection: Index to the intersection desired.
Returns: The parameter values on each curve of the specified intersection point.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetPointOnCurve1(System.Int32)
Returns the specified intersection point as a PointOnCurve2d object of the first curve.
intersection: Index to the intersection desired.
Returns: Intersection point on the first curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetPointOnCurve2(System.Int32)
Returns the specified intersection point as a PointOnCurve2d object of the second curve.
intersection: Index to the intersection desired.
Returns: Intersection point on the second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.IsTangential(System.Int32)
Returns a boolean indicating whether the specified intersection point is a tangential intersection.
intersection: Index to the intersection desired.
Returns: A boolean indicating whether the specified intersection point is a tangential intersection.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.IsTransversal(System.Int32)
Returns a boolean indicating whether the specified intersection point is a transversal intersection.
intersection: Index to the intersection desired.
Returns: A boolean indicating whether the specified intersection point is a transversal intersection.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetIntersectionPointTolerance(System.Int32)
Returns the tolerance that was used to find the specified intersection point.
intersection: Index to the intersection desired.
Returns: The tolerance that was used to find the specified intersection point.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetOverlapRanges(System.Int32)
Returns the intervals of overlap of each curve of the specified overlap.
overlapNumber: Number of overlaps to get intervals for.
Returns: The intervals of overlap of each curve of the specified overlap.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval)
Resets the two curves that are to be intersected and resets the intervals.
curve1: First curve.
curve2: Second curve.
range1: First range interval.
range2: Second range interval.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Tolerance)
Resets the two curves that are to be intersected and resets the intervals.
curve1: First curve.
curve2: Second curve.
range1: First range interval.
range2: Second range interval.
tolerance: Tolerance value.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d)
Resets the two curves that are to be intersected.
curve1: First curve.
curve2: Second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Tolerance)
Resets the two curves that are to be intersected.
curve1: First curve.
curve2: Second curve.
tolerance: Tolerance value.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.{dtor}
