Autodesk.AutoCAD.DatabaseServices.Intersect
This enum specifies if none, one or both, of the objects are to be extended in order to attempt an intersection.

Autodesk.AutoCAD.DatabaseServices.Intersect.ExtendBoth
Extends both objects.

Autodesk.AutoCAD.DatabaseServices.Intersect.ExtendArgument
Extends the object passed as an argument.

Autodesk.AutoCAD.DatabaseServices.Intersect.ExtendThis
Extends the base object.

Autodesk.AutoCAD.DatabaseServices.Intersect.OnBothOperands
Does not extend either object.