Autodesk.AutoCAD.GraphicsInterface.SolidBackgroundTraits
Represents a solid background to the underlying display system.

Autodesk.AutoCAD.GraphicsInterface.SolidBackgroundTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.SolidBackgroundTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.SolidBackgroundTraits.ColorSolid
Gets or sets the solid color property of background.

Autodesk.AutoCAD.GraphicsInterface.SolidBackgroundTraits.{dtor}
