Autodesk.AutoCAD.DatabaseServices.TableRegion
This struct contains the information that defines a table's dimensions, as measured in rows and columns.

Autodesk.AutoCAD.DatabaseServices.TableRegion.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)


Autodesk.AutoCAD.DatabaseServices.TableRegion.LastColumn


Autodesk.AutoCAD.DatabaseServices.TableRegion.LastRow


Autodesk.AutoCAD.DatabaseServices.TableRegion.FirstColumn


Autodesk.AutoCAD.DatabaseServices.TableRegion.FirstRow


Autodesk.AutoCAD.DatabaseServices.TableRegion.IsNull


Autodesk.AutoCAD.DatabaseServices.TableRegion.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.TableRegion.GetHashCode


Autodesk.AutoCAD.DatabaseServices.TableRegion.op_Equality(Autodesk.AutoCAD.DatabaseServices.TableRegion,Autodesk.AutoCAD.DatabaseServices.TableRegion)


Autodesk.AutoCAD.DatabaseServices.TableRegion.op_Inequality(Autodesk.AutoCAD.DatabaseServices.TableRegion,Autodesk.AutoCAD.DatabaseServices.TableRegion)
