Autodesk.AutoCAD.DatabaseServices.DimStyleTable
The symbol table for DimStyleTableRecords, which represents dimension styles within the drawing database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTable.{dtor}
