Autodesk.AutoCAD.DatabaseServices.RenderGlobal
Container for all global rendering properties. One and only one of these objects is resident in the database, in the named object dictionary as ACAD_RENDER_GLOBAL.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RenderGlobal.HighInfoLevel
Gets or sets a Boolean indicating whether settings/statistics are shown in higher level of detail in the user interface.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.PredefinedPresetsFirst
Gets or sets a Boolean indicating whether predefined (factory) presets appear before the user-defined presets in the user interface.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Dimensions
Gets or sets the dimensions of the rendered image.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.SaveFileName
Gets or sets the full path and file name of the image file to which the rendered image will be saved.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.SaveEnabled
Gets or sets boolean indicating whether to save an image to disk after rendering.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.ProcedureAndDestination
Gets or sets the type of view content to render (the procedure) and the desired output target for rendering.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.{dtor}
