Autodesk.AutoCAD.DatabaseServices.Viewport
Represents the VIEWPORT entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Viewport.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Viewport.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Viewport.PlotAsRaster
Gets a boolean indicating whether or not the viewport will plot as a raster based on the viewport's current shade plot settings.

Autodesk.AutoCAD.DatabaseServices.Viewport.PlotWireframe
Gets a boolean indicating whether or not the viewport will plot as a vector output based on the viewport's current shade plot settings.

Autodesk.AutoCAD.DatabaseServices.Viewport.ShadePlotId
Gets the ObjectId of the shade object associated with this viewport. The shade object is a visual style or render preset that defines how the current viewport will plot.

Autodesk.AutoCAD.DatabaseServices.Viewport.Background
Gets or sets the object ID for the background of the current viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.ShadePlot
Gets or sets the shade plot mode of the current viewport. The shade plot mode specifies how the current viewport will plot.

Autodesk.AutoCAD.DatabaseServices.Viewport.RenderMode
Gets or sets the current render mode for this view.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsPerViewport
Gets or sets true, then the ucs that is saved with this viewport will become active whenever the viewport is made active.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewOrthographic
Gets true if the view direction is orthographic relative to UCSBASE.

Autodesk.AutoCAD.DatabaseServices.Viewport.Elevation
Gets or sets the elevation of the ucs plane for this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsName
Gets the object id of an UcsTableRecord if this viewport's ucs is a named ucs.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsOrthographic
Gets false if this viewport's UCS does not have an orthographic view whose reference UCS matches the database's UCSBASE system variable.

Autodesk.AutoCAD.DatabaseServices.Viewport.NonRectClipEntityId
Gets or sets the ID of the clipping entity associated with a viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.NonRectClipOn
Gets or sets true if non-rectangular clipping is currently turned on for this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.EffectivePlotStyleSheet
Gets the layout's plot style table name.

Autodesk.AutoCAD.DatabaseServices.Viewport.PlotStyleSheet
Gets the style sheet applied to objects in this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.StandardScale
Gets or sets the scale of a viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.CustomScale
Gets or sets the custom scale for the viewport. The custom scale defines the relationship of units in paperspace to units in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.Transparent
Gets or sets true if the viewport is set to be transparent.

Autodesk.AutoCAD.DatabaseServices.Viewport.Locked
Gets or sets true if a viewport's scale is locked. When a viewport is locked, its zoom factor relative to paperspace cannot be changed via AutoCAD commands such as ZOOM and VIEW.

Autodesk.AutoCAD.DatabaseServices.Viewport.VisualStyleId
Gets or sets the object ID of the visual style in effect for this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SunId
Gets the Id for the Sun object associated with this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.AmbientLightColor
Gets or sets the ambient light color for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.Contrast
Gets or sets the contrast factor for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.Brightness
Gets or sets the brightness factor for this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.DefaultLightingType
Gets or sets the type of default lighting being used in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.DefaultLightingOn
Gets or sets true of any kind of default light is on.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridMajor
Gets or sets the number of minor grid lines between each major grid line in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridFollow
Gets or sets true if the grid will follow a dynamic UCS change in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridSubdivisionRestricted
Gets or sets true if subdivisions are allowed below the minor grid spacing in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridAdaptive
Gets or sets true if the grid adapts to display fewer lines in the viewport than the GRIDUNIT setting.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridBoundToLimits
Gets or sets true if the grid is drawn beyond limits for the WCS and user-defined UCS in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.HiddenLinesRemoved
Gets or sets true if the viewport is set to remove hidden lines during plotting.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridIncrement
Gets or sets a Vector2d in which the X value represents the X spacing (in drawing units) of the grid and the Y value represents the Y spacing of the grid.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridOn
Gets or sets true if the grid is currently turned on in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapIsoPair
Gets or sets the snap IsoPair setting for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapIncrement
Gets or sets a Vector2d in which the X value represents the X spacing of the snap grid and the Y value represents the Y spacing of the snap grid. Both values are in drawing units.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapBasePoint
Gets or sets the snap basepoint (in UCS coordinates) for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapAngle
Gets or sets the snap angle setting (in radians) for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapIsometric
Gets or sets true if snap mode is currently set to isometric in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapOn
Gets or sets true if snap mode is currently turned on in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.CircleSides
Gets or sets the circle zoom percent for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.FastZoomOn
Always true and is obsolete and will be removed in a future release.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsIconAtOrigin
Gets or sets true if the viewport is currently set to have the UCS icon follow the current UCS origin, as long as the origin is far enough within the viewport to allow the icon to display properly.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsIconVisible
Gets or sets true if the viewport is currently set to have the UCS icon display.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsFollowModeOn
Gets or sets true if the viewport is set to generate and display a plan view whenever the UCS changes in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.PerspectiveOn
Gets or sets true if the perspective mode is currently turned on in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.BackClipDistance
Gets or sets the distance (along the camera-target line) from the target to the back clipping plane. Positive values indicate that the clipping plane is in front of the target (that is, between the target and the camera) whereas negative values indicate the clipping plane is behind the target.

Autodesk.AutoCAD.DatabaseServices.Viewport.FrontClipDistance
Gets or sets the distance (along the camera-target line) from the target to the front clipping plane. Positive values indicate that the clipping plane is in front of the target (that is, between the target and the camera) whereas negative values indicate the clipping plane is behind the target.

Autodesk.AutoCAD.DatabaseServices.Viewport.FrontClipAtEyeOn
Gets or sets true if the front clipping plane is currently located at the camera.

Autodesk.AutoCAD.DatabaseServices.Viewport.BackClipOn
Gets or sets true if the back clipping plane is currently turned on in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.FrontClipOn
Gets or sets true if the front clipping plane is currently turned on in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.LensLength
Gets or sets the lens length used when perspective mode is on in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.TwistAngle
Gets or sets the twist angle (in radians) of the view in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewCenter
Gets or sets the view center (in display coordinate system coordinates) of the view in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewHeight
Gets or sets the height (in display coordinate system coordinates) of the Model Space view within the viewport. Zooming the view out within the viewport increases this value and zooming in decreases this value.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewDirection
Gets or sets a Vector3d, which is the vector (in Model Space WCS coordinates) from the view's target to the view's camera.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewTarget
Gets or sets a Point3d which is the location (in Model Space WCS coordinates) of the view's target.

Autodesk.AutoCAD.DatabaseServices.Viewport.On
Gets or sets false for any viewport in an inactive layout's paperspace.

Autodesk.AutoCAD.DatabaseServices.Viewport.Number
Gets the viewport ID number. This is the number that is reported by the AutoCAD CVPORT system variable when the viewport is the current viewport in the AutoCAD editor. If the viewport is inactive, -1 is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.CenterPoint
Gets or sets the center point of the viewport entity in WCS coordinates (within Paper Space).

Autodesk.AutoCAD.DatabaseServices.Viewport.Width
Gets or sets the width of the viewport entity's window in drawing units. This is the width in Paper Space of the viewport itself, not the width of the Model Space view within the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.Height
Gets or sets the height of the viewport entity's window in drawing units.

Autodesk.AutoCAD.DatabaseServices.Viewport.FreezeLayersInViewport(System.Collections.IEnumerator)
Freezes, in this viewport only, the layers whose ids are in layerIds.
layerIds: Array of object IDs of layers to be frozen in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.ThawLayersInViewport(System.Collections.IEnumerator)
Thaws, in this viewport only, the layers whose IDs are in layerIds.
layerIds: Array of object IDs of layers to be thawed in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.GetFrozenLayers
Returns the ObjectIds of the LayerTableRecords currently frozen in the viewport.
Returns: The ObjectIds of the LayerTableRecords currently frozen in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.IsLayerFrozenInViewport(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the LayerTableRecord with ObjectId layerId is frozen in the viewport.
layerId: Id of the LayerTableRecord in question.
Returns: true if the LayerTableRecord with ObjectId layerId is frozen in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.UpdateDisplay
Updates the onscreen display to reflect any changes made to the viewport's view parameters. If no changes have been made, or the viewport is not on, or is not onscreen, then this function does nothing.

Autodesk.AutoCAD.DatabaseServices.Viewport.SetSun(Autodesk.AutoCAD.DatabaseServices.DBObject)
Sets the object Id of the Sun object associated with this viewport.
sun: A sun object.
Returns: Object ID of the Sun object.

Autodesk.AutoCAD.DatabaseServices.Viewport.GetUcs(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the origin, x-axis, and y-axis of the ucs for this viewport.
origin: The origin.
x: The X axis.
y: The Y axis.

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcs(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the UCS for this viewport. The new UCS will be named and UcsId must reference a valid UcsTableRecord object.
userCoordinateSystemId: Reference to a valid UcsTableRecord object.

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcs(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets the UCS for this viewport to the orthographic UCS defined by view (relative to UCSBASE).
view: Orthographic UCS.

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcs(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the UCS for this viewport as defined by origin, x, and y. The resulting UCS will be unnamed.
origin: The origin.
x: The X axis.
y: The Y axis.

Autodesk.AutoCAD.DatabaseServices.Viewport.SetViewDirection(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets the view direction of this viewport to the specified orthographic view (relative to UCSBASE).
view: Orthographic view.

Autodesk.AutoCAD.DatabaseServices.Viewport.SetShadePlot(Autodesk.AutoCAD.DatabaseServices.ShadePlotType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the shade plot mode and shade plot object associated with this viewport. The shade plot object is a visual style or render preset that defines how the current viewport will plot.
type: Type of shade plot.
shadePlotId: Object Id for VisualStyle or RenderSettings object to be used as the new shade plot object.

Autodesk.AutoCAD.DatabaseServices.Viewport.{dtor}
