Autodesk.AutoCAD.Geometry.Vector2d
Represents a vector in 3D space.

Autodesk.AutoCAD.Geometry.Vector2d.#ctor(System.Double[])
Constructor.
xy: X,Y coordinates.

Autodesk.AutoCAD.Geometry.Vector2d.#ctor(System.Double,System.Double)
Constructor. Constructs a 2D vector with coordinates x, y correspondingly.
x: X coordinate.
y: Y coordinate.

Autodesk.AutoCAD.Geometry.Vector2d.LengthSqrd
Gets the square of the Euclidean length of this vector.

Autodesk.AutoCAD.Geometry.Vector2d.Length
Gets the square of the Euclidean length of this vector.

Autodesk.AutoCAD.Geometry.Vector2d.Angle
Gets the angle between this vector and X axis in the range [0, 2 * Pi].

Autodesk.AutoCAD.Geometry.Vector2d.Coordinate(System.Int32)


Autodesk.AutoCAD.Geometry.Vector2d.Y
Gets first coordinate.

Autodesk.AutoCAD.Geometry.Vector2d.X
Gets zeroth coordinate.

Autodesk.AutoCAD.Geometry.Vector2d.YAxis
Gets vector(0, 1).

Autodesk.AutoCAD.Geometry.Vector2d.XAxis
Gets vector(1, 0).

Autodesk.AutoCAD.Geometry.Vector2d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Transform this vector by pre-multiplying it by the matrix leftSide.
leftSide: Matrix.
Returns: The transformed vector.

Autodesk.AutoCAD.Geometry.Vector2d.RotateBy(System.Double)
Returns 2D vector which is the result of rotation of this vector.
angle: Rotation angle.
Returns: 2D vector which is the result of rotation of this vector.

Autodesk.AutoCAD.Geometry.Vector2d.Mirror(Autodesk.AutoCAD.Geometry.Vector2d)
Returns the 2D vector which is the result of mirroring of this vector with respect to 2D line line in the same plane.
line: Line.
Returns: The 3D vector which is the result of mirroring of this vector.

Autodesk.AutoCAD.Geometry.Vector2d.Add(Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Vector2d.Subtract(Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Vector2d.DivideBy(System.Double)


Autodesk.AutoCAD.Geometry.Vector2d.MultiplyBy(System.Double)


Autodesk.AutoCAD.Geometry.Vector2d.Negate
Negates this vector, namely sets it to be equal to the vector (-x, -y).
Returns: The negative vector.

Autodesk.AutoCAD.Geometry.Vector2d.GetPerpendicularVector
Returns a vector orthogonal to this vector.
Returns: A vector orthogonal to this vector.

Autodesk.AutoCAD.Geometry.Vector2d.GetAngleTo(Autodesk.AutoCAD.Geometry.Vector2d)
Returns the angle between this vector and the vector vec in the range [0, Pi].
vector: Vector.
Returns: The angle between this vector and the vector vec in the range [0, Pi].

Autodesk.AutoCAD.Geometry.Vector2d.GetNormal
Returns the unit vector codirectional to this vector.
Returns: The unit vector codirectional to this vector.

Autodesk.AutoCAD.Geometry.Vector2d.GetNormal(Autodesk.AutoCAD.Geometry.Tolerance)
Returns the unit vector codirectional to this vector.
tolerance: Tolerance.
Returns: The unit vector codirectional to this vector.

Autodesk.AutoCAD.Geometry.Vector2d.IsUnitLength
Returns true if this vector is equal to its normalization.
Returns: true if this vector is equal to its normalization.

Autodesk.AutoCAD.Geometry.Vector2d.IsUnitLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to its normalization.
tolerance: Tolerance.
Returns: true if this vector is equal to its normalization.

Autodesk.AutoCAD.Geometry.Vector2d.IsZeroLength
Returns true if this vector is equal to zero vector.
Returns: true if this vector is equal to zero vector.

Autodesk.AutoCAD.Geometry.Vector2d.IsZeroLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to zero vector.
tolerance: Tolerance.
Returns: true if this vector is equal to zero vector.

Autodesk.AutoCAD.Geometry.Vector2d.IsParallelTo(Autodesk.AutoCAD.Geometry.Vector2d)
Checks if this vector is parallel to the vector vector.
vector: Vector.
Returns: true if this vector is parallel to the vector vector.

Autodesk.AutoCAD.Geometry.Vector2d.IsParallelTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is parallel to the vector vector.
vector: Vector.
tolerance: Tolerance.
Returns: true if this vector is parallel to the vector vector.

Autodesk.AutoCAD.Geometry.Vector2d.IsCodirectionalTo(Autodesk.AutoCAD.Geometry.Vector2d)
Checks if this vector is codirectional to the vectorv vector.
vector: Vector.
Returns: true if this vector is codirectional to the vectorv vector.

Autodesk.AutoCAD.Geometry.Vector2d.IsCodirectionalTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is codirectional to the vectorv vector.
vector: Vector.
tolerance: Tolerance.
Returns: true if this vector is codirectional to the vectorv vector.

Autodesk.AutoCAD.Geometry.Vector2d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.Vector2d)
Checks if this vector is perpendicular to the vector vector.
vector: Vector.
Returns: true if this vector is perpendicular to the vector vector.

Autodesk.AutoCAD.Geometry.Vector2d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is perpendicular to the vector vector.
vector: Vector.
tolerance: Tolerance.
Returns: true if this vector is perpendicular to the vector vector.

Autodesk.AutoCAD.Geometry.Vector2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Vector2d)
Checks if this vector is equal the vector vector.
vector: Vector.
Returns: true if this vector is equal the vector vector.

Autodesk.AutoCAD.Geometry.Vector2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is equal the vector vector.
vector: Vector.
tolerance: Tolerance.
Returns: true if this vector is equal the vector vector.

Autodesk.AutoCAD.Geometry.Vector2d.DotProduct(Autodesk.AutoCAD.Geometry.Vector2d)
Returns the dot product of this vector and the vector v.
v: Vector.
Returns: The dot product of this vector and the vector v.

Autodesk.AutoCAD.Geometry.Vector2d.Equals(System.Object)


Autodesk.AutoCAD.Geometry.Vector2d.GetHashCode


Autodesk.AutoCAD.Geometry.Vector2d.ToString(System.IFormatProvider)


Autodesk.AutoCAD.Geometry.Vector2d.ToString


Autodesk.AutoCAD.Geometry.Vector2d.ToArray
Returns an array of type Double containing the X and Y coordinate values for this vector.
Returns: An array of type Double containing the X and Y coordinate values for this vector.

Autodesk.AutoCAD.Geometry.Vector2d.op_Inequality(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Vector2d.op_Equality(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Vector2d.op_Addition(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Vector2d.op_Subtraction(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Vector2d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Vector2d.op_Multiply(System.Double,Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Vector2d.op_Multiply(Autodesk.AutoCAD.Geometry.Vector2d,System.Double)


Autodesk.AutoCAD.Geometry.Vector2d.op_Division(Autodesk.AutoCAD.Geometry.Vector2d,System.Double)


Autodesk.AutoCAD.Geometry.Vector2d.op_UnaryNegation(Autodesk.AutoCAD.Geometry.Vector2d)
