Autodesk.AutoCAD.DatabaseServices.MTextFragment
Used to describe a fragment of text as extracted by the ExplodeFragments() method. Each fragment consists of a piece of text with a unique combination of style information (font, size, color, and so on).

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Italic
Gets true if text is TrueType and is italic.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Bold
Gets true if text is true type and is bold.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.TrueTypeFont
Gets TrueType font name (null if not TrueType text).

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Overlined
Gets true if overlining is on.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Underlined
Gets true if underlining is on.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.StackBottom
Gets true if text is bottom part of stacked text.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.StackTop
Gets true if text is top part of stacked text.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Color
Gets the color of stacked text.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.TrackingFactor
Gets text tracking factor.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.ObliqueAngle
Gets text oblique angle.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.WidthFactor
Gets text width factor.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.CapsHeight
Gets text height.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Extents
Gets text extents. X-coord is extents box width. Y-coord is extents box height.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.BigFont
Gets text bigfont.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.ShxFont
Gets text font.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Text
Gets text string.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Direction
Gets text flow direction vector.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Normal
Gets normal vector.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Location
Gets text insertion point.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.GetUnderLinePoints
Gets start and end points of underline vector.
Returns: Start and end points of underline vector.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.GetOverLinePoints
Gets start and end points of overline vector.
Returns: Start and end points of overline vector.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.{dtor}
