Autodesk.AutoCAD.DatabaseServices.ConstrainType
Special constrain type values. A constraint is used to make a variable constant. When using the height constraint, changes to any other parameters will not change the height.

Autodesk.AutoCAD.DatabaseServices.ConstrainType.Turns
Constrain turns.

Autodesk.AutoCAD.DatabaseServices.ConstrainType.TurnHeight
Constrain turn height.

Autodesk.AutoCAD.DatabaseServices.ConstrainType.Height
Constrain height.