Autodesk.AutoCAD.DatabaseServices.UnitsValue
Specifies a drawing-units value for automatic scaling of blocks, images, or xrefs inserted or attached to a drawing.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Parsecs
Parsecs.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.LightYears
LightYears.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Astronomical
Astronomical.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Gigameters
Gigameters.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Hectometers
Hectometers.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Dekameters
Dekameters.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Decimeters
Decimeters.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Microns
Microns.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Nanometers
Nanometers.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Angstroms
Angstroms.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Yards
Yards.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Mils
Mils.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.MicroInches
MicroInches.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Kilometers
Kilometers.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Meters
Meters.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Centimeters
Centimeters.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Millimeters
Millimeters.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Miles
Miles.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Feet
Feet.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Inches
Inches.

Autodesk.AutoCAD.DatabaseServices.UnitsValue.Undefined
Undefined.