Autodesk.AutoCAD.DatabaseServices.RevolvedSurface
Represents a revolved surface entity. It provides methods to create and manipulate ASM surfaces.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.RevolveOptions
Gets or sets the revolve options object associated with this surface.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.StartAngle
Gets the start angle of rotation, in radians.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.RevolveAngle
Gets or sets the angle of rotation in radians.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.AxisDirection
Gets or sets a vector representing the axis of revolution.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.AxisPoint
Gets or sets a point on the axis of revolution. This point coupled with the axis direction define the axis of revolution.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.RevolveEntity
Gets the entity that is to be revovled. This entity can be a planar curve, region, or planar surface.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.CreateRevolvedSurface(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
Creates a revolved surface of revolution from a given curve, region, or planar surface and an axis of revolution defined by a point and vector. The starting angle and revolve angles are also specified. revolveEntity will be revolved counterclockwise about the axisDirection vector.
revolveEntity: The planar curve, region, or planar surface that is to be revolved.
axisPoint: Point on the axis of revolution.
axisDirection: Direction of the axis of revolution.
revolveAngle: Angle of rotation in radians.
startAngle: Start angle of rotation, in radians. If 0, then rotation will start from current position of revolveEntity.
revolveOptions: Revolve options.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.SetRevolve(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
Sets all the defining data for the revolved surface.
axisPoint: Axis point.
axisDirection: Axis vector.
revolveAngle: Angle of rotation in radians.
revolveOptions: Revolve options.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.{dtor}
