Autodesk.AutoCAD.GraphicsInterface.DefaultLightingType
Enumerates the types of default lights available for viewports and full renders.

Autodesk.AutoCAD.GraphicsInterface.DefaultLightingType.TwoDistantLights
Default lighting is provided by two distant lights and one ambient light. This is the default in AutoCAD 2007.

Autodesk.AutoCAD.GraphicsInterface.DefaultLightingType.OneDistantLight
Default lighting is provided by one distant light and one ambient light. This matches the display characteristics of previous AutoCAD releases.