Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground
Represents a ground plane background.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorGroundPlaneFar
Gets or sets the far ground plane color.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorGroundPlaneNear
Gets or sets the near ground plane color.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorUndergroundAzimuth
Gets or sets the underground azimuth color.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorUndergroundHorizon
Gets or sets the underground horizon color.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorSkyHorizon
Gets or sets the color of the sky horizon.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorSkyZenith
Gets or sets the color at the sky zenith.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.{dtor}
