Autodesk.AutoCAD.Geometry.SplineEntity3d
Represents different spline entities in 3D space.

Autodesk.AutoCAD.Geometry.SplineEntity3d.HasFitData
Gets true if the spline is constructed by using any interpolating fit data.

Autodesk.AutoCAD.Geometry.SplineEntity3d.EndPoint
Gets the point on the spline at the maximal parametric value.

Autodesk.AutoCAD.Geometry.SplineEntity3d.StartPoint
Gets the point on the curve at the minimal parameter value.

Autodesk.AutoCAD.Geometry.SplineEntity3d.EndParameter
Gets the maximal parameter on the spline.

Autodesk.AutoCAD.Geometry.SplineEntity3d.StartParameter
Gets the minimal parameter on the curve.

Autodesk.AutoCAD.Geometry.SplineEntity3d.NumberOfControlPoints
Gets the number of control points in the control array.

Autodesk.AutoCAD.Geometry.SplineEntity3d.Knots
Gets the spline's knot vector. The intervals between two consecutive knots partition the spline into polynomial or rational pieces.

Autodesk.AutoCAD.Geometry.SplineEntity3d.NumberOfKnots
Gets the number of knots in the knot vector.

Autodesk.AutoCAD.Geometry.SplineEntity3d.Order
Gets spline's order. The curve is defined on the interval between knot values indexed by order - 1 and NumberOfKnots - order. In the case of a B-spline, the order is greater than spline degree by 1. In the case of a polyline, the order is equal to 1.

Autodesk.AutoCAD.Geometry.SplineEntity3d.Degree
Gets the degree of spline.

Autodesk.AutoCAD.Geometry.SplineEntity3d.IsRational
Gets a flag indicating if the spline is a polynomial or rational.

Autodesk.AutoCAD.Geometry.SplineEntity3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.SplineEntity3d.GetContinuityAtKnot(System.Int32)
Returns the degree of the highest derivative that is continuous at a knot. For example, if the spline does not have its first derivative at the knot indexed by index, then the value 0 is returned.
index: Knot index.
Returns: The degree of the highest derivative that is continuous at a knot.

Autodesk.AutoCAD.Geometry.SplineEntity3d.GetContinuityAtKnot(System.Int32,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the degree of the highest derivative that is continuous at a knot. For example, if the spline does not have its first derivative at the knot indexed by index, then the value 0 is returned.
index: Knot index.
tolerance: Tolerance.
Returns: The degree of the highest derivative that is continuous at a knot.

Autodesk.AutoCAD.Geometry.SplineEntity3d.KnotAt(System.Int32)
Returns a knot value from the spline's knot vector.
index: Index of a knot.
Returns: A knot value from the spline's knot vector.

Autodesk.AutoCAD.Geometry.SplineEntity3d.SetKnotAt(System.Int32,System.Double)
Resets the value of a knot at a given index.
index: Index of a knot.
value: Value of a knot.

Autodesk.AutoCAD.Geometry.SplineEntity3d.ControlPointAt(System.Int32)
Returns a control point from the array of the spline's control points.
index: Index of a control point.
Returns: A control point from the array of the spline's control points.

Autodesk.AutoCAD.Geometry.SplineEntity3d.SetControlPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets a control point from the spline's control array.
index: Index of a control point in the control array.
point: Value of the point.

Autodesk.AutoCAD.Geometry.SplineEntity3d.{dtor}
