Autodesk.AutoCAD.DatabaseServices.DataCellCollection
Provides a container for Autodesk.AutoCAD.DatabaseServices.DataCell objects.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Count
Gets the number of objects in the collection.
Returns: Returns a value representing the number of objects in the collection.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.RemoveAt(System.Int32)
Removes the object whose index in the collection is index.
index: Index of the desired element to remove.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Clear
Removes all the elements in the collection.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.GetEnumerator
Gets an enumerator for the collection.
Returns: An enumerator that can be used to iterate through the collection.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Add(Autodesk.AutoCAD.DatabaseServices.DataCell)
Adds the object represented by value to this collection.
value: DataCell object to be appended to this collection.
Returns: The zero-based index of the newly added collection item.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.DataCell)
Gets the 0-based index of the collection item that matches value.
value: The object to search for in this collection.
Returns: The zero-based index of the collection item that matches value, or -1 if value does not exist in the collection.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
Inserts an element into the collection at the specified index.
index: The zero-based index at which value should be inserted.
value: Element to be inserted in the collection.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Remove(Autodesk.AutoCAD.DatabaseServices.DataCell)
Removes the object represented by value from this collection.
value: The item to remove from the collection.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Contains(Autodesk.AutoCAD.DatabaseServices.DataCell)
Determine if the collection contains value.
value: Value to search for in this collection.
Returns: A value indicating whether the collection contains an object that matches value.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.DataCell[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.{dtor}
