Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface
Represents an extruded surface entity. It provides methods to create and manipulate ASM surfaces.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.SweepOptions
Gets or sets the options used to create this extruded surface.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.Height
Gets or sets the extrusion height.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.SweepVec
Gets or sets the sweep vector.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.SweepEntity
Gets the sweep entity used to create the extruded sruface.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.CreateExtrudedSurface(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Creates an extruded surface by sweeping a planar curve, region, or planar surface in the direction of the given vector using a distance equal to the length of the vector. Optional parameters may be set through the sweepOptions parameter such as draft angle.
sweepEnt: The curve, region, or planar surface to be swept.
directionVec: The vector that indicates the direction and distance of the sweep operation.
sweepOptions: Sweep options.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.SetExtrude(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Sets all defining data for the extruded surface.
sweepVec: Extrusion vector.
sweepOptions: Sweep options.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.{dtor}
