Autodesk.AutoCAD.DatabaseServices.UcsTable
This class is the symbol table for UCSTableRecord, which represents stored user coordinate systems (UCS) within the drawing database.

Autodesk.AutoCAD.DatabaseServices.UcsTable.{dtor}
