Autodesk.AutoCAD.Geometry.CurveBoundaryData
Contains data that defines a CurveBoundary object.

Autodesk.AutoCAD.Geometry.CurveBoundaryData.Orientation2d
Gets logical orientation applicable to each element of 2dGeometry.

Autodesk.AutoCAD.Geometry.CurveBoundaryData.Orientation3d
Gets logical orientation applicable to each element of 3dGeometry.

Autodesk.AutoCAD.Geometry.CurveBoundaryData.GetCurve3ds
Returns the array of 3D curves for this object.
Returns: The array of 3D curves for this object.

Autodesk.AutoCAD.Geometry.CurveBoundaryData.GetCurve2ds
Returns the array of 2D curves for this object.
Returns: The array of 2D curves for this object.

Autodesk.AutoCAD.Geometry.CurveBoundaryData.Equals(System.Object)


Autodesk.AutoCAD.Geometry.CurveBoundaryData.IsEqualTo(Autodesk.AutoCAD.Geometry.CurveBoundaryData)


Autodesk.AutoCAD.Geometry.CurveBoundaryData.GetHashCode


Autodesk.AutoCAD.Geometry.CurveBoundaryData.op_Inequality(Autodesk.AutoCAD.Geometry.CurveBoundaryData,Autodesk.AutoCAD.Geometry.CurveBoundaryData)


Autodesk.AutoCAD.Geometry.CurveBoundaryData.op_Equality(Autodesk.AutoCAD.Geometry.CurveBoundaryData,Autodesk.AutoCAD.Geometry.CurveBoundaryData)
