Autodesk.AutoCAD.DatabaseServices.Vertex2dType
Vertex2dType of Vertex2d.

Autodesk.AutoCAD.DatabaseServices.Vertex2dType.CurveFitVertex
A vertex that was automatically generated as the result of a curve-fit operation. This type of vertex can go away or change automatically during subsequent editing operations on the polyline.

Autodesk.AutoCAD.DatabaseServices.Vertex2dType.SplineFitVertex
A vertex that was automatically generated as the result of a spline-fit operation. This type of vertex can go away or change automatically during subsequent editing operations on the polyline.

Autodesk.AutoCAD.DatabaseServices.Vertex2dType.SplineControlVertex
A control point for a spline or curve-fit polyline.

Autodesk.AutoCAD.DatabaseServices.Vertex2dType.SimpleVertex
A standard vertex within a 2D polyline.