Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorType
These values categorize the surface/surface intersection component.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorType.AntiTangent
Tangent intersection. Surface normals opposite at any point within the component.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorType.Tangent
Tangent intersection. Surface normals identical at any point within the component.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorType.Transverse
Non-tangent intersection.