Autodesk.AutoCAD.DatabaseServices.Poly3dType
Polyline3d type.

Autodesk.AutoCAD.DatabaseServices.Poly3dType.CubicSplinePoly
A spline-fit polyline that has a Cubic B-spline path. This reflects that the third bit of DXF group code 70 is set and that DXF group code 75 is set to 6.

Autodesk.AutoCAD.DatabaseServices.Poly3dType.QuadSplinePoly
A spline-fit polyline that has a Quadratic B-spline path. This reflects that the third bit of DXF group code 70 is set and that DXF group code 75 is set to 5.

Autodesk.AutoCAD.DatabaseServices.Poly3dType.SimplePoly
A standard polyline with no spline fitting.