Autodesk.AutoCAD.Runtime.ExtensionApplicationAttribute
Defines a custom attribute that marks an assembly as an ObjectDBX/AutoCAD extension. The type that this attribute represents must implement the IExtensionApplication interface. When the assembly is loaded, this attribute is used to create an instance of the application's entry point type.

Autodesk.AutoCAD.Runtime.ExtensionApplicationAttribute.#ctor(System.Type)


Autodesk.AutoCAD.Runtime.ExtensionApplicationAttribute.Type
