Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo
This struct contains the viewport ID, AutoCAD window ID, viewport object ID, and a pointer to the contextual colors object for the viewport.

Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo.ViewportObjectId
Gets or sets value returned by ViewportDraw.ViewportObjectId.

Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo.AcadWindowId
Gets or sets value returned by Viewport.AcadWindowId.

Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo.ViewportId
Gets or sets value returned by Viewport.ViewportId.