Autodesk.AutoCAD.GraphicsInterface.Projection
This enumeration provides values that describe the mapping projection of the mapper.

Autodesk.AutoCAD.GraphicsInterface.Projection.Planar
Maps 2D image coordinates directly to XY coordinates.

Autodesk.AutoCAD.GraphicsInterface.Projection.Sphere
Maps 2D image coordinates to sphere with poles on Z axis.

Autodesk.AutoCAD.GraphicsInterface.Projection.Cylinder
Maps 2D image coordinates to cylinder along Z axis.

Autodesk.AutoCAD.GraphicsInterface.Projection.Box
Maps 2D image coordinates to plane normal to major axis.

Autodesk.AutoCAD.GraphicsInterface.Projection.InheritProjection
Inherit projection method from current material's mapper.