Autodesk.AutoCAD.DatabaseServices.SystemVariableChangingEventArgs
Provides data for the SystemVariableChanging event of the database.

Autodesk.AutoCAD.DatabaseServices.SystemVariableChangingEventArgs.Name
Gets the name of the system variable that is changing.