Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge
Represents a large radial dimension, also known as a jogged radius dimension.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Primary constructor. Creates a RadialDimensionLarge object.
center: Center point of the arc being dimensioned by the jogged radius dimension.
chordPoint: Chord point on the arc dimensioned by the jogged radius dimension.
overrideCenter: Overriden center point used by the jogged radius dimension.
jogPoint: Jog point used by the jogged radius dimension.
jogAngle: Jog angle used by the jogged radius dimension.
dimensionText: Dimension text to use instead of calculated value.
dimensionStyle: Dimension style Object ID.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.OverrideCenter
Gets or sets the overidden center point used by the jogged radius dimension.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.JogPoint
Gets or sets the jog point used by the jogged radius dimension.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.ChordPoint
Gets or sets the chord point on the arc dimensioned by the jogged radius dimension.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.Center
Gets or sets the center point of the arc dimensioned by the jogged radius dimension.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.JogAngle
Gets or sets the jog angle used by the jogged radius dimension.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.{dtor}
