Autodesk.AutoCAD.DatabaseServices.Field
This class is used to represent a field. The field can evaluate to one of the supported data types. The field object acts as a container to store the field expression, evaluated result, and other data. An evaluator is required for evaluating the field.

Autodesk.AutoCAD.DatabaseServices.Field.#ctor(System.String,System.Boolean)
Constructor that sets the field code.It does not evaluate the field.
fieldCode: Field code.
textField: Flag indicating whether this is a text field.

Autodesk.AutoCAD.DatabaseServices.Field.#ctor(System.String)
Constructor.Calls Field(field,false).
fieldCode: Field code.

Autodesk.AutoCAD.DatabaseServices.Field.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Field.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Field.HyperLink
Gets or sets the hyperlink associated with the field.

Autodesk.AutoCAD.DatabaseServices.Field.Value
Gets the field evaluation result as string after formatting the string using the format set in the field.Gets a blank string if the field is not yet evaluated.

Autodesk.AutoCAD.DatabaseServices.Field.DataType
Gets the data type of the field evaluation result.

Autodesk.AutoCAD.DatabaseServices.Field.Format
Gets or sets the output format set in the field.Gets or sets a blank string if there is no output format set.

Autodesk.AutoCAD.DatabaseServices.Field.IsTextField
Gets true if this field is a text field, which is text with embedded fields.

Autodesk.AutoCAD.DatabaseServices.Field.EvaluatorId
Gets or sets the ID of the evaluator used by the field for evaluation.Gets or sets null if there is no evaluator set in the field, or if an evaluator could not be found and assigned to the field.

Autodesk.AutoCAD.DatabaseServices.Field.FilingOption
Gets or sets the filing option set in the field.

Autodesk.AutoCAD.DatabaseServices.Field.EvaluationOption
Gets or sets the evaluation option explicitly set in the field.

Autodesk.AutoCAD.DatabaseServices.Field.EvaluationStatus
Gets the evaluation status set by the evaluator.

Autodesk.AutoCAD.DatabaseServices.Field.State
Gets the field state.

Autodesk.AutoCAD.DatabaseServices.Field.SetFieldCodeWithChildren(Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags,Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren)
Sets the field code containing child fields.
flag: Flag.
fieldCode: Field code containing child fields.

Autodesk.AutoCAD.DatabaseServices.Field.SetFieldCodeWithChildren(Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren)
Sets the field code containing child fields.Calls SetFieldCodeWithChildren(FieldCodeFlags.TextField,fieldCode).
fieldCode: Field code containing child fields.

Autodesk.AutoCAD.DatabaseServices.Field.ConvertToTextField
Converts the field to a text field.A text field encapsulates text with embedded fields.

Autodesk.AutoCAD.DatabaseServices.Field.GetFieldCode(Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags)
Gets a field code in various forms.
flags: Flag.
Returns: String that is the field code.

Autodesk.AutoCAD.DatabaseServices.Field.GetFieldCode
Gets a field code in various forms.Calls GetFieldCode(FieldCodeFlags.TextField).
Returns: String that is the field code.

Autodesk.AutoCAD.DatabaseServices.Field.SetFieldCode(System.String)
Sets the field code.
fieldCode: Field code to set.

Autodesk.AutoCAD.DatabaseServices.Field.GetFieldCodeWithChildren(Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags)
Gets a field code in various forms.
flags: Flag.
Returns: String that is the field code.

Autodesk.AutoCAD.DatabaseServices.Field.GetFieldCodeWithChildren
Gets a field code in various forms.
Returns: String that is the field code.

Autodesk.AutoCAD.DatabaseServices.Field.GetChildren
Gets the child field.
Returns: The child field.

Autodesk.AutoCAD.DatabaseServices.Field.Evaluate
Evaluates the field. After creating a field object and setting the field code, call this method to evaluate the field.

Autodesk.AutoCAD.DatabaseServices.Field.Evaluate(System.Int32,Autodesk.AutoCAD.DatabaseServices.Database)
Evaluates the field. After creating a field object and setting the field code, call this method to evaluate the field.
evaluationOptions: Evaluation Options.
database: Database to be used for the evaluation, which can be null.

Autodesk.AutoCAD.DatabaseServices.Field.GetStringValue
Gets the field evaluation result as string after formatting the string using the format set in the field.
Returns: The field evaluation.

Autodesk.AutoCAD.DatabaseServices.Field.GetData(System.String)
Gets data from the field object using a key.
key: Key to get the data;the key cannot be null or an empty string.
Returns: The data.

Autodesk.AutoCAD.DatabaseServices.Field.SetData(System.String,System.Object,System.Boolean)
Sets data in the field object using a key.The data will be copied and stored in the field object,and filed in and filed out with it. If the data contains an object ID, it will be properly translated during wblock operations.
key: Key to set the data;the key cannot be null or an empty string.
data: The object that contains the data.
recursive: True if the data is to be set in all child fields,false if it is to be set only in this field.

Autodesk.AutoCAD.DatabaseServices.Field.SetData(System.String,System.Object)
Sets data in the field object using a key. The data will be copied and stored in the field object, and filed in and filed out with it. If the data contains an object ID, it will be properly translated during wblock operations.
key: Key to set the data;the key cannot be null or an empty string.
data: The object that contains the data.

Autodesk.AutoCAD.DatabaseServices.Field.{dtor}
