Autodesk.AutoCAD.DatabaseServices.LoftOptionsCheckCurvesOut
This class is a container for the Boolean values output by the LoftOptions.CheckLoftCurves ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsCheckCurvesOut.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsCheckCurvesOut.AllPlanar


Autodesk.AutoCAD.DatabaseServices.LoftOptionsCheckCurvesOut.AllClosed


Autodesk.AutoCAD.DatabaseServices.LoftOptionsCheckCurvesOut.AllOpen
