Autodesk.AutoCAD.GraphicsInterface.Tiling
This enumeration provides values that describe the tiling method of the mapper.

Autodesk.AutoCAD.GraphicsInterface.Tiling.Clamp
Clamps material map to between 0.0 and 1.0 in image axis.

Autodesk.AutoCAD.GraphicsInterface.Tiling.Crop
Crops material map below 0.0 and above 1.0 in image axis.

Autodesk.AutoCAD.GraphicsInterface.Tiling.Tile
Repeats material map along image axis.

Autodesk.AutoCAD.GraphicsInterface.Tiling.InheritTiling
Inherit tiling method from current material's mapper.