Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh
Represents the PolyFaceMesh special polyline entity type within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.NumFaces
Gets the number of faces in the PolyFaceMesh.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.NumVertices
Gets the number of point coordinate vertices in the vertex list of the PolyFaceMesh. This count does not include the FaceRecords in the vertex list.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.AppendVertex(Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex)
Appends the PolyFaceMeshVertex object defined by vertexToAppend to the end of the vertex list of the PolyFaceMesh, establishes the PolyFaceMesh as the vertex's owner, and adds the vertex to the Database that contains the PolyFaceMesh (the PolyFaceMesh must be database-resident for this method to succeed).
vertexToAppend: The vertex to append.
Returns: Object ID of the vertex just added.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.AppendFaceRecord(Autodesk.AutoCAD.DatabaseServices.FaceRecord)
appends the FaceRecord object defined by toAppend to the end of the facelist of the PolyFaceMesh, establishes the PolyFaceMesh as the FaceRecord's owner, and adds the FaceRecord to the Database that contains the PolyFaceMesh (the PolyFaceMesh must be database-resident for this function to succeed).
toAppend: FaceRecord to append to mesh.
Returns: Object ID of FaceRecord.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.GetEnumerator
Gets an enumerator that can be used to iterate over the vertices and FaceRecords of the PolyFaceMesh.
Returns: An enumerator that can be used to iterate over the vertices and FaceRecords of the PolyFaceMesh.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.{dtor}
