Autodesk.AutoCAD.Geometry.LineSegment3d
Represents a bounded line segment in 3D space.

Autodesk.AutoCAD.Geometry.LineSegment3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs a line segment between point1 and point2. point1 and point2 must not be the same point.
point1: Start point of line segment.
point2: Endpoint of line segment.

Autodesk.AutoCAD.Geometry.LineSegment3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a line segment whose start point is point and whose endpoint is point+vector. vector must not be a zero-length vector.
point: Start point of line segment.
vector: Vector between endpoint and start point of line segment.

Autodesk.AutoCAD.Geometry.LineSegment3d.Length
Gets the length of the line segment (the distance between the start point and endpoint).

Autodesk.AutoCAD.Geometry.LineSegment3d.EndPoint
Gets the endpoint of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment3d.MidPoint
Gets the midpoint of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment3d.StartPoint
Gets the start point of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.LineSegment3d.GetBisector
Gets the unbounded plane that is perpendicular to the line segment and passes through its midpoint.
Returns: Bisecting plane.

Autodesk.AutoCAD.Geometry.LineSegment3d.BaryComb(System.Double)
Returns the point that is the weighted average of the start point and endpoint of the line segment.
blendCoefficient: Any real number.
Returns: The point that is the weighted average of the start point and endpoint of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Point3d,System.Double)
Changes the definition of the line segment so that the line segment passes through the input point and is tangent to the input curve. On input, parameter is assumed to contain an initial guess value to the parameter of the tangent point.
curve: Any 3D curve.
point: Any 3D point.
parameter: Point on curve where line segment is tangent to curve.

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double)
Changes the definition of the line segment so that the line segment is tangent to the two input curves. On input, parameter1 and parameter2 are assumed to contain initial guess values to the parameters of the two tangent points.
curve1: Any 3D curve.
curve2: Any 3D curve.
parameter1: Point on curve1 where line segment is tangent to curve.
parameter2: Point on curve2 where line segment is tangent to curve.

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes the definition of the line segment so that the start point is point1 and the endpoint is point2. point1 and point2 must not be the same point.
point1: Start point of line segment.
point2: Endpoint of line segment.

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes the definition of the line segment so that the start point is point and the endpoint is point+vector. vector must not be a zero-length vector.
point: Start point of line segment.
vector: Vector between endpoint and start point of line segment.

Autodesk.AutoCAD.Geometry.LineSegment3d.{dtor}
