Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator
Provides a method to process a query on an index.Used by the CompositeFilteredBlockIterator class.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.BuffersForComposition
Gets true if the index iterator needs to buffer output if it is not used as the primary index iterator.Default is false.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.EstimatedHitFraction
Gets the estimated fraction in the interval (0.0 to 1.0) of the amount of the contents of the index that will be hit based on the Filter query.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.Id
Gets the ObjectId at the current iterator position,or ObjectId.Null if the traversal has completed.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.Next
Advances the cursor and gets the next ObjectId, or ObjectId.Null if the traversal has completed.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.Seek(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Position the iterator at the record identified by id.
id: ObjectId to seek to.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.Accepts(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the id is accepted.
id: Object ID that is being composed.
Returns: True if the id is accepted.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.AddToBuffer(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds the id to an internal buffer maintained by an index iterator.
id: Object ID that is being composed.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.{dtor}
