Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection
A collection of Hyperlink objects.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Count
Gets the number of objects in the collection.
Returns: Returns a value representing the number of objects in the collection.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.RemoveAt(System.Int32)
Removes the element at the specified index of the collection.
index: The zero-based index of the element to remove.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.GetEnumerator
Gets an enumerator for the collection.
Returns: An enumerator that can be used to iterate through the collection.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.HyperLink[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Add(Autodesk.AutoCAD.DatabaseServices.HyperLink)
Adds an object to the end of the collection.
value: The object to be added to the end of the collection. The value can be null.
Returns: The collection index at which the value has been added.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.HyperLink)
Gets the 0-based index of the collection item that matches value.
value: The object to search for in this collection.
Returns: The zero-based index of the collection item that matches value, or -1 if value does not exist in the collection.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.HyperLink)
Inserts an element into the collection at the specified index.
index: The zero-based index at which value should be inserted.
value: Element to be inserted in the collection.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Remove(Autodesk.AutoCAD.DatabaseServices.HyperLink)
Removes the object represented by value from this collection.
value: The item to remove from the collection.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Contains(Autodesk.AutoCAD.DatabaseServices.HyperLink)
Determines whether an element is in the collection.
value: The object to search for in this collection.
Returns: true if the collection contains an object that matches value; otherwise, false.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.{dtor}
