Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord
Encapsulates the three output parameters used by the DBObject.DecomposeForSave() ObjectARX method. These values represent the replacement object if it is non-database-resident, the replacement object's object ID if it is database-resident, and a flag indicating whether xdata should be transferred to the replacement object.

Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Constructor.
replacement: Object ID of the object to be used as the replacement for the object.
exchangeXData: Boolean indicating whether or not ObjectARX should transfer xdata.

Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord.#ctor(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
Constructor.
replacement: The non-database-resident object to be used as the replacement for the object.
exchangeXData: Boolean indicating whether or not ObjectARX should transfer xdata.

Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord.ExchangeXData
Gets boolean indicating whether or not ObjectARX should transfer xdata.

Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord.ReplacementId
Gets object ID of the object to be used as the replacement for the object this property is called on.

Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord.ReplacementObject
Gets the non-database-resident object to be used as the replacement for the object this property is called on.