Autodesk.AutoCAD.DatabaseServices.DataTable
Provides a general-purpose repository for simple numeric, character, 3D point, or object ID information arranged in a two-dimensional table.

Autodesk.AutoCAD.DatabaseServices.DataTable.#ctor
Default constructor.Creates a table consisting of zero columns and zero rows and a name consisting of an empty string

Autodesk.AutoCAD.DatabaseServices.DataTable.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DataTable.TableName
Gets or sets the name of the table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumColsGrowSize
Gets or sets the grow size for the number of columns in the table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumColsPhysicalSize
Gets or sets the number of columns allocated for the table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumRowsGrowSize
Gets or sets the grow size for the number of rows of a table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumRowsPhysicalSize
Gets or sets the number of rows allocated for the physical size of the table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumRows
Gets or sets the actual number of rows in the table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumColumns
Gets or sets the actual number of columns in the table.

Autodesk.AutoCAD.DatabaseServices.DataTable.Assign(Autodesk.AutoCAD.DatabaseServices.DataTable)
The table is assigned the name and columns of the input table.
other: DataTable to be assigned.

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnAt(System.Int32)
Gets the column at the specified column index.
index: Index of column.
Returns: Column at the specified column index.

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnNameAt(System.Int32)
Gets the name of the column at the specified column index.
index: Column index.
Returns: Name of column at the specified index.

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnTypeAt(System.Int32)
Gets the type of the column at the specified column index.
index: Column index.
Returns: Type of column at the specified index.

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnIndexAtName(System.String)
Gets the index of the column with the specified column name.
name: Name of column.
Returns: Column index of column with the specified name.

Autodesk.AutoCAD.DatabaseServices.DataTable.AppendColumn(Autodesk.AutoCAD.DatabaseServices.CellType,System.String)
Creates a new column and adds it as the last column of the table. If the table already has rows in it, the new column is created with a cell for each row that has a default value.
type: Type of the column being added.
columnName: Name of the column.

Autodesk.AutoCAD.DatabaseServices.DataTable.InsertColumnAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.CellType,System.String)
Creates a new column and inserts it into the table at the specified column index. If the table already has rows in it, the new column is created with a cell for each row that has a default value.
index: Column index at which to insert the new column.
type: Type of new column.
columnName: Name of new column.

Autodesk.AutoCAD.DatabaseServices.DataTable.RemoveColumnAt(System.Int32)
Removes the specified column from the table.
index: Index of column to remove.

Autodesk.AutoCAD.DatabaseServices.DataTable.GetRowAt(System.Int32)
Gets the row of data at the specified row index.
index: Row index.
Returns: Row of data at the specified index.

Autodesk.AutoCAD.DatabaseServices.DataTable.SetRowAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
Replaces the row at the specified index.
index: Row index of the row to be replaced.
row: New row of data.
validate: Validation flag.

Autodesk.AutoCAD.DatabaseServices.DataTable.AppendRow(Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
Appends a row to the end of the table.
row: Row being added.
validate: Validation flag.

Autodesk.AutoCAD.DatabaseServices.DataTable.InsertRowAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
Inserts a row of data into the table immediately before the row at the specified index.
index: Row index of position at which to insert the row.
row: Row of data to insert.
validate: Validation flag.

Autodesk.AutoCAD.DatabaseServices.DataTable.RemoveRowAt(System.Int32)
Removes the specified row from the table.
index: Index of row to remove.

Autodesk.AutoCAD.DatabaseServices.DataTable.GetCellAt(System.Int32,System.Int32)
Gets the cell at the specified row and column indexes.
row: Row index of cell to access.
col: Column index of cell to access.
Returns: Cell found in the table at the specified row and column.

Autodesk.AutoCAD.DatabaseServices.DataTable.SetCellAt(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
Replaces the cell in the table at the specified row and column with the specified cell.
row: Row index of the cell to be replaced.
col: Column index of the cell to be replaced.
cell: New cell.

Autodesk.AutoCAD.DatabaseServices.DataTable.{dtor}
