Autodesk.AutoCAD.DatabaseServices.StandardScaleType
The standard scale type.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1ftAnd1ft
1'= 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale6inAnd1ft
6"= 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale3inAnd1ft
3"= 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1inAnd1ft
1"= 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale3To4inchAnd1ft
3/4" = 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To2inchAnd1ft
1/2" = 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale3To8inchAnd1ft
3/8" = 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To4inchAnd1ft
1/4" = 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale3To16inchAnd1ft
3/16"= 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To8inchAnd1ft
1/8" = 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale3To32inchAnd1ft
3/32"= 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To16inchAnd1ft
1/16"= 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To32inchAnd1ft
1/32"= 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To64inchAnd1ft
1/64"= 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To128inAnd1ft
1/128"= 1'.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale100To1
100:1.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale10To1
10:1.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale8To1
8:1.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale4To1
4:1.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale2To1
2:1.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To100
1:100.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To50
1:50.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To40
1:40.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To30
1:30.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To20
1:20.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To16
1:16.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To10
1:10.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To8
1:8.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To4
1:4.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To2
1:2.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.Scale1To1
1:1.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.CustomScale
Custom scale.

Autodesk.AutoCAD.DatabaseServices.StandardScaleType.ScaleToFit
Scaled to Fit.