Autodesk.AutoCAD.DatabaseServices.RenderEnvironment
This is a container class for environment-related properties, including fog / depth cue and the global environment image.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.EnvironmentImageFileName
Gets or sets the full path and file name of the environment image.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.EnvironmentImageEnabled
Gets or sets a Boolean value indicating whether to use an image for the environment.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.Distances
Gets or sets the near and far distances of the fog effect.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.FogDensity
Gets or sets the density of the fog effect.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.FogColor
Gets or sets the color of the fog effect.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.FogBackgroundEnabled
Gets or sets a Boolean value indicating whether the fog affects the background.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.FogEnabled
Gets or sets a Boolean value indicating whether a fog effect is applied to the rendered image.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.{dtor}
