Autodesk.AutoCAD.GraphicsInterface.EdgeData
This class is a container for the optional data that can be specified for a set of edges in a mesh or shell graphics primitive.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetTrueColors(Autodesk.AutoCAD.Colors.EntityColor[])
Sets the edge colors to be used by the EdgeData object.
colors: Array of EntityColor objects.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetLayers(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets layers to be the array of LayerTableRecord object IDs used by the EdgeData object. The array must have exactly the same number of elements as there are edges in the mesh or shell it is used with.
layers: Array of LayerTableRecord object IDs.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetLineTypes(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets linetypes to be the array of LinetypeTableRecord object IDs used by the EdgeData object.
lineTypes: Array of LinetypeTableRecord object IDs.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetTrueColors
Returns an array of EntityColor objects: one for each edge in the mesh or shell with which the EdgeData object is used.
Returns: An array of EntityColor objects.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetLayers
Returns the array of LayerTableRecord object IDs, one for each edge in the mesh or shell with which this object is used. If the layer ID array has not been set, an empty array is returned.
Returns: The array of LayerTableRecord object IDs.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetLineTypes
Returns the array of LinetypeTableRecord object IDs, one for each edge in the mesh or shell with which this object is used. If the linetype ID array has not been set, an empty array is returned.
Returns: The array of LinetypeTableRecord object IDs.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetSelectionMarkers
Returns an array of graphic system selection markers (gsmarkers), one for each edge in the mesh or shell the EdgeData object is used with.
Returns: An array of graphic system selection markers.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetVisibility
Returns an array of visibility flags (that is, 0 == invisible, 1 == visible), one for each edge in the mesh or shell the EdgeData object is used with.
Returns: An array of visibility flags.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetSelectionMarkers(System.Int32[])
Sets SelectionMarkers to be the array of graphics system selection markers, or gsmarkers, used by this object.
selectionMarkers: Array of non-zero graphic system selection markers.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetVisibility(System.Byte[])
Sets visibility to be the array of edge visibility flags used by this object.
visibility: Array of visibility flags.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetColors(System.Int16[])
Sets colors to be the array of edge color indices used by this object.
colors: Array of AutoCAD color indices.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetColors
Returns an array of AutoCAD color indices, one for each edge in the mesh or shell the EdgeData object is used with.
Returns: An array of AutoCAD color indices, one for each edge in the mesh or shell the EdgeData object is used with.