Autodesk.AutoCAD.DatabaseServices.ProxyEntity
This abstract class provides an interface to the description data for the entities stored within ProxyEntities in drawings. It also provides access to an explode method that results in a set of entities that are copies of the graphics metafile data stored in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.GraphicsMetafileType
Gets a GraphicsMetafileType value indicating what kind of data is in the proxy's graphics metafile (if it has one).

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.ApplicationDescription
Gets the string that represents the application description of the class stored within the proxy entity.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.OriginalDxfName
Gets a string that is the DXF name of the custom entity stored in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.OriginalClassName
Gets a string that is the C++ class name of the custom object stored in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.ProxyFlags
Gets the proxy edit flags bit settings for the class of the custom entity contained in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.GetReferences
Returns all reference ObjectIds in the data of the custom entity contained in the proxy.
Returns: All reference ObjectIds in the data of the custom entity contained in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.{dtor}
