Autodesk.AutoCAD.GraphicsInterface.VisualStyleTraits
Defines the visual style traits.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.VisualStyleTraits.AcGiVisualStyle
Gets or sets the visual style that is currently captured in this traits object.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleTraits.{dtor}
