Autodesk.AutoCAD.DatabaseServices.DefaultLightingType
Enumerates the types of default lights available for viewports and full renders.One of these types is used when no user lights are specified, or when user lights are overridden by a call to DefaultLightingOn.

Autodesk.AutoCAD.DatabaseServices.DefaultLightingType.TwoDistantLights
Default lighting is provided by two distant lights and one ambient light. This is the default in AutoCAD 2007.

Autodesk.AutoCAD.DatabaseServices.DefaultLightingType.OneDistantLight
Default lighting is provided by one distant light and one ambient light. This matches the display characteristics of previous AutoCAD releases.