Autodesk.AutoCAD.DatabaseServices.Image
Abstract base class for immediate mode raster-based entities, including RasterImage.

Autodesk.AutoCAD.DatabaseServices.Image.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Image.{dtor}
