Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.Count
Gets the number of elements in the MlineStyle. This can be up to MLINE_MAX_ELEMENTS.
Returns: Returns a value representing the number of objects in the collection.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.Add(Autodesk.AutoCAD.DatabaseServices.MlineStyleElement,System.Boolean)
Adds a new element to the end of the collection.
element: The object to be added to the end of the collection. The value can be null.
checkIfReferenced: Boolean indicating whether to check if the style is referenced.
Returns: Zero-based index of element added.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.RemoveAt(System.Int32)
Removes the element at the specified index of the collection.
index: The zero-based index of the element to remove.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.GetEnumerator
Gets an enumerator for the collection.
Returns: An enumerator that can be used to iterate through the collection.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.MlineStyleElement[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.