Autodesk.AutoCAD.Geometry.ClipBoundary2dData
Contains data used by various ClipBoundary2d operations.

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.ClippedSegmentSourceLabel
Gets segment label information identifying the source of each segment in the clipped object.

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.ClipCondition
Gets information about the spatial relationship between the input object and the clip boundary.

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.ClippedVertices
Gets 2d point array defines the clipped result object.

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.Equals(System.Object)


Autodesk.AutoCAD.Geometry.ClipBoundary2dData.IsEqualTo(Autodesk.AutoCAD.Geometry.ClipBoundary2dData)


Autodesk.AutoCAD.Geometry.ClipBoundary2dData.GetHashCode


Autodesk.AutoCAD.Geometry.ClipBoundary2dData.op_Inequality(Autodesk.AutoCAD.Geometry.ClipBoundary2dData,Autodesk.AutoCAD.Geometry.ClipBoundary2dData)


Autodesk.AutoCAD.Geometry.ClipBoundary2dData.op_Equality(Autodesk.AutoCAD.Geometry.ClipBoundary2dData,Autodesk.AutoCAD.Geometry.ClipBoundary2dData)
