Autodesk.AutoCAD.Runtime.Interop
This class is a collection of various methods that assist interoperation with unmanaged code.

Autodesk.AutoCAD.Runtime.Interop.Check(System.Int32)
Checks returnValue as an Acad::ErrorStatus value, and throws an exception if it does not equal eOk.
returnValue: Value.

Autodesk.AutoCAD.Runtime.Interop.CheckAdsForCancel(System.Int32)
Returns true if returnValue is RTNORM or RTNONE, or false if it is RTCAN. If returnValue is any other value, this method throws an eInvalidInput exception.
returnValue: Value.
Returns: true if returnValue is RTNORM or RTNONE.

Autodesk.AutoCAD.Runtime.Interop.CheckAds(System.Int32)
Throws an eInvalidInput exception if returnValue is anything other than RTNORM.
returnValue: Value.

Autodesk.AutoCAD.Runtime.Interop.CheckBool(System.Boolean)
This method throws System::InvalidOperationException if returnValue is false.
returnValue: Value.

Autodesk.AutoCAD.Runtime.Interop.CheckBoolean(System.Int32)
This method throws System::InvalidOperationException if returnValue evaluates to false.
returnValue: Value.

Autodesk.AutoCAD.Runtime.Interop.CheckNull(System.IntPtr)
If returnValue is null (or System::IntPtr::Zero), this method throws System::NullReferenceException.
returnValue: Value.

Autodesk.AutoCAD.Runtime.Interop.ThrowExceptionForErrorStatus(System.Int32)
This method throws a new Autodesk.AutoCAD.Runtime.Exception exception with the errorStatus value appended to the exception information in an AcadErrorStatus field.
errorStatus: Value.

Autodesk.AutoCAD.Runtime.Interop.SetAutoDelete(Autodesk.AutoCAD.Runtime.DisposableWrapper,System.Boolean)
Sets a Boolean indicating whether the given wrapper object owns the underlying unmanaged resource. When the wrapper owns the resource the Dispose method will delete the resource.
obj: The wrapper.
value: Boolean that is true if the wrapper is to own the object; otherwise, false.

Autodesk.AutoCAD.Runtime.Interop.AttachUnmanagedObject(Autodesk.AutoCAD.Runtime.DisposableWrapper,System.IntPtr,System.Boolean)
Attaches the wrapper to an unmanaged resource. The wrapper must be compatible with the unmanaged resource.
obj: The wrapper.
unmanagedPointer: The unmanaged resource.
autoDelete: Boolean indicating whether the given wrapper object owns the underlying unmanaged resource.

Autodesk.AutoCAD.Runtime.Interop.DetachUnmanagedObject(Autodesk.AutoCAD.Runtime.DisposableWrapper)
Detaches the wrapper from the underlying unmanaged resource.
obj: The wrapper.