Autodesk.AutoCAD.DatabaseServices.GraphNode
Provides a generic graph node implementation.

Autodesk.AutoCAD.DatabaseServices.GraphNode.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.GraphNode.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.GraphNode.IsCycleNode
Gets true if this node is part of a cyclical reference.

Autodesk.AutoCAD.DatabaseServices.GraphNode.NumCycleIn
Gets the number of incoming cyclical references.

Autodesk.AutoCAD.DatabaseServices.GraphNode.NumCycleOut
Gets the number of outgoing cyclical references.

Autodesk.AutoCAD.DatabaseServices.GraphNode.Owner
Gets the Graph to which this node is attached.

Autodesk.AutoCAD.DatabaseServices.GraphNode.NextCycleNode
Gets the next outgoing cyclical reference.

Autodesk.AutoCAD.DatabaseServices.GraphNode.NumIn
Gets the number of incoming references to this node.

Autodesk.AutoCAD.DatabaseServices.GraphNode.NumOut
Gets the number of outgoing references from this node.

Autodesk.AutoCAD.DatabaseServices.GraphNode.Data
Gets the data associated with this node.

Autodesk.AutoCAD.DatabaseServices.GraphNode.In(System.Int32)
Returns the incoming reference at index.
index: Desired node index.
Returns: The incoming reference at index.

Autodesk.AutoCAD.DatabaseServices.GraphNode.Out(System.Int32)
Returns the outgoing reference at index.
index: Desired node index.
Returns: The outgoing reference at index.

Autodesk.AutoCAD.DatabaseServices.GraphNode.CycleIn(System.Int32)
When FindCycles() is called, it creates an internal duplicate set of references used to detect and break cycles. This method returns a node's incoming cycle reference at "index".
index: Desired node index.
Returns: A node's incoming cycle reference at "index".

Autodesk.AutoCAD.DatabaseServices.GraphNode.CycleOut(System.Int32)
When FindCycles() is called, it creates an internal duplicate set of references used to detect and break cycles. This method returns a node's outgoing cycle reference at "index".
index: Desired node index.
Returns: A node's outgoing cycle reference at "index".

Autodesk.AutoCAD.DatabaseServices.GraphNode.AddRefTo(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Creates a reference from this node to an outgoing node.
outGoingNode: Outgoing node.

Autodesk.AutoCAD.DatabaseServices.GraphNode.RemoveRefTo(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Removes the entry from the Out() array,and removes this node from the referenced node's In() array.
nodeToRemoveReference: Node to remove reference of.

Autodesk.AutoCAD.DatabaseServices.GraphNode.IsMarkedAs(System.Int32)
Returns true if the flag bit(s) passed in match set flag bit(s) in this node.
flag: Flag values to check for this node.
Returns: True if the flag bit(s) passed in match set flag bit(s) in this node.

Autodesk.AutoCAD.DatabaseServices.GraphNode.MarkAs(System.Byte)
Sets the flag bit(s) passed in.
flags: Flag values to set for this node.

Autodesk.AutoCAD.DatabaseServices.GraphNode.Clear(System.Byte)
Clears the flag bit(s) passed in.
flags: Flag values to clear for this node.

Autodesk.AutoCAD.DatabaseServices.GraphNode.MarkTree(System.Byte,Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection)
Marks this node and all nested Out() nodes with the GraphNode.Flags value supplied.
flags: Flag values to set for this node and all nested out nodes.
appendedTo: Array that this node and all nested out nodes should optionally be appended to.

Autodesk.AutoCAD.DatabaseServices.GraphNode.SetEdgeGrowthRate(System.Int32,System.Int32)
Sets the number of outgoing and incoming edges that are allocated at a time on a graph node.
outEdgeRate: Number of outgoing edges allocated at one time.
inEdgeRate: Number of incoming edges allocated at one time.

Autodesk.AutoCAD.DatabaseServices.GraphNode.DeleteUnmanagedObject


Autodesk.AutoCAD.DatabaseServices.GraphNode.{dtor}
