Autodesk.AutoCAD.DatabaseServices.SectionType
Options for section generation. This enum is used to get and set properties for generated section geometry. There are two groups of flags: type of section and type of generated geometry.

Autodesk.AutoCAD.DatabaseServices.SectionType.LiveSection
Live sectioning.

Autodesk.AutoCAD.DatabaseServices.SectionType.Section3d
2d section.

Autodesk.AutoCAD.DatabaseServices.SectionType.Section2d
3d section.