Autodesk.AutoCAD.DatabaseServices.FlowDirection
Specifies the direction that the MText or Table follows from its start to its finish.

Autodesk.AutoCAD.DatabaseServices.FlowDirection.ByStyle
Flow direction is by style.

Autodesk.AutoCAD.DatabaseServices.FlowDirection.BottomToTop
Flow direction of bottom to top.

Autodesk.AutoCAD.DatabaseServices.FlowDirection.TopToBottom
Flow direction of top to bottom (default).

Autodesk.AutoCAD.DatabaseServices.FlowDirection.RightToLeft
Flow direction of right to left.

Autodesk.AutoCAD.DatabaseServices.FlowDirection.LeftToRight
Flow direction of left to right.

Autodesk.AutoCAD.DatabaseServices.FlowDirection.NotSet
Flow direction is not set.