Autodesk.AutoCAD.GraphicsInterface.Glyph
Provides the graphics primitives for drawing a glyph during snap operations.

Autodesk.AutoCAD.GraphicsInterface.Glyph.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.Glyph.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.Glyph.Id
Not used for a Glyph.

Autodesk.AutoCAD.GraphicsInterface.Glyph.IsPersistent
Not used for a Glyph.

Autodesk.AutoCAD.GraphicsInterface.Glyph.SetAttributes(Autodesk.AutoCAD.GraphicsInterface.DrawableTraits)
This method is not used for an AcGiGlyph.
traits: A DrawableTraits object.
Returns:

Autodesk.AutoCAD.GraphicsInterface.Glyph.WorldDraw(Autodesk.AutoCAD.GraphicsInterface.WorldDraw)
If you do want WorldDraw to be called, then you must override this method or else the system will go directly to the ViewportDrawmember, after invoking SetLocation().
wd: WorldDraw interface.
Returns:

Autodesk.AutoCAD.GraphicsInterface.Glyph.ViewportDrawLogicalFlags(Autodesk.AutoCAD.GraphicsInterface.ViewportDraw)
This method should be implemented, accounting for location, pixel display coordinate size ratio, and the OSNAPGLYPHSIZE system variable setting.
vd: ViewportDraw interface.
Returns:

Autodesk.AutoCAD.GraphicsInterface.Glyph.SetLocation(Autodesk.AutoCAD.Geometry.Point3d)
This method is invoked from a host application immediately prior to invoking ViewportDraw() or WorldDraw() on the glyph.The glyph should be drawn with viewport-specific graphics, typically using the device coordinate members (denoted with dc in their names) of Viewport Geometry, however the location of the position to draw them at is computed as a WCS point.
point: Display coordinate system (DCS) point.

Autodesk.AutoCAD.GraphicsInterface.Glyph.{dtor}
