Autodesk.AutoCAD.DatabaseServices.XrefSubCommandEventArgs
Provides data for the XrefSubCommand event.

Autodesk.AutoCAD.DatabaseServices.XrefSubCommandEventArgs.paths


Autodesk.AutoCAD.DatabaseServices.XrefSubCommandEventArgs.btrNames


Autodesk.AutoCAD.DatabaseServices.XrefSubCommandEventArgs.btrIds


Autodesk.AutoCAD.DatabaseServices.XrefSubCommandEventArgs.xrefOp
