Autodesk.AutoCAD.DatabaseServices.DgnDefinition
Reserved for future use.

Autodesk.AutoCAD.DatabaseServices.DgnDefinition.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.DgnDefinition.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DgnDefinition.{dtor}
