Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode
A custom OSNAP mode is defined by registering an instance of CustomObjectsnapMode.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.#ctor(System.String,System.String,System.String,Autodesk.AutoCAD.GraphicsInterface.Glyph)


Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.GlyphSize
Indicates size of OSNAP glyphs in pixels, the same as APERTURE and PICKBOX system variables.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.ToolTipText
Gets the OSNAP mode glyph and default tooltip string.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.Glyph
Gets the custom Autodesk.AutoCAD.GraphicsInterface.Glyph. Gets null if a custom glyph is not used.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.GlobalModeString
Gets the global custom OSNAP keyword string that user must type in which is the actual text string which AutoCAD point acquisition and running OSNAP modes will recognize.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.LocalModeString
Gets the local custom OSNAP keyword string the user must type.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.ApplyToEntityType(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.DatabaseServices.AddObjectSnapInfo)


Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.RemoveFromEntityType(Autodesk.AutoCAD.Runtime.RXClass)


Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.Activate(System.String)
Activate an OSNAP mode.
mode: Custom OSNAP mode string.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.Deactivate(System.String)
Deactivate an OSNAP mode.
mode: Custom OSNAP mode string.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.IsActive(System.String)
Query whether a specified OSNAP mode is active.
mode: Custom OSNAP mode string.
Returns: true if the mode is registered and active; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.{dtor}
