Autodesk.AutoCAD.DatabaseServices.SectionSubItem
Hit flags for section plane.This enum value is returned by the method Section.HitTest.

Autodesk.AutoCAD.DatabaseServices.SectionSubItem.VerticalLineBottom
The hit test point is on one of the vertical lines on bottom half of the section plane.

Autodesk.AutoCAD.DatabaseServices.SectionSubItem.VerticalLineTop
The hit test point is on one of the vertical lines on top half of the section plane.

Autodesk.AutoCAD.DatabaseServices.SectionSubItem.BackLineBottom
The hit test point is on one of the back lines at the bottom line level.

Autodesk.AutoCAD.DatabaseServices.SectionSubItem.BackLineTop
The hit test point is on one of the back lines at the top line level.

Autodesk.AutoCAD.DatabaseServices.SectionSubItem.BackLine
The hit test point is on one of the back lines at the section line level.

Autodesk.AutoCAD.DatabaseServices.SectionSubItem.SectionLineBottom
The hit test point is on the bottom line of the section plane.

Autodesk.AutoCAD.DatabaseServices.SectionSubItem.SectionLineTop
The hit test point is on the top line of the section plane.

Autodesk.AutoCAD.DatabaseServices.SectionSubItem.SectionLine
The hit test point is on the section line.

Autodesk.AutoCAD.DatabaseServices.SectionSubItem.SectionSubItemNone
The hit test point is not on the section plane.