Autodesk.AutoCAD.DatabaseServices.Leader
Represents the LEADER entity within AutoCAD. Leaders are considered as dimensions in AutoCAD, which means they are controlled by dimension variable settings and dimension styles.

Autodesk.AutoCAD.DatabaseServices.Leader.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Leader.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Leader.Dimtxt
Gets or sets the current DIMTXT value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimtxsty
Gets or sets the object ID of the text style specified by the current DIMTXSTY value of the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimtad
Gets or sets the current DIMTAD value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimscale
Gets or sets the current DIMSCALE value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimsah
Gets or sets the current DIMSAH value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimldrblk
Gets or sets the object ID of the block reference that is the current DIMLDRBLK value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimlwd
Gets or sets the current DIMLWD value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimgap
Gets or sets the current DIMGAP value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimclrd
Gets or sets the current DIMCLRD value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimasz
Gets or sets the current DIMASZ value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.AnnoWidth
Gets the annotation width.

Autodesk.AutoCAD.DatabaseServices.Leader.AnnoHeight
Gets the annotation height.

Autodesk.AutoCAD.DatabaseServices.Leader.AnnoType
Gets the leader's annotation type.

Autodesk.AutoCAD.DatabaseServices.Leader.AnnotationOffset
Gets or sets the annotation offset for the leader.The values may be retrieved for any leader, but they will affect the geometry only if the leader has associated annotation.

Autodesk.AutoCAD.DatabaseServices.Leader.Annotation
Gets or sets the ObjectId of the annotation object associated with this leader. This annotation object can be an Mtext entity, a block reference entity,or a tolerance entity.

Autodesk.AutoCAD.DatabaseServices.Leader.DimstyleData
Gets or sets any dimension variable overrides currently applied to this object.

Autodesk.AutoCAD.DatabaseServices.Leader.DimensionStyle


Autodesk.AutoCAD.DatabaseServices.Leader.IsSplined
Gets or sets true if this leader is spline-fit.

Autodesk.AutoCAD.DatabaseServices.Leader.HasHookLine
Gets true if this leader has a hookline.The "hookline" is the small horizontal line at the end of the leader line just before the annotation.

Autodesk.AutoCAD.DatabaseServices.Leader.HasArrowHead
Gets or sets true if arrowhead is currently enabled for this leader.

Autodesk.AutoCAD.DatabaseServices.Leader.LastVertex
Gets the leader's last vertex in WCS coordinates. This is the vertex at the end where the annotation is attached.

Autodesk.AutoCAD.DatabaseServices.Leader.FirstVertex
Gets the leader's start point in WCS coordinates. This will be the start of the arrowhead if enabled.

Autodesk.AutoCAD.DatabaseServices.Leader.NumVertices
Gets the number of vertices in the leader's vertex list.

Autodesk.AutoCAD.DatabaseServices.Leader.Normal
Gets the unit normal vector (in WCS coordinates) of the plane that contains the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.SetPlane(Autodesk.AutoCAD.Geometry.Plane)
Sets the plane that will contain the leader object. This leader's data members will be updated to reflect the change of plane. To do this, a transformation matrix will be created that will translate all points from the current plane's coordinate system to the new plane's coordinate system--a projection is not used.
value: Desired plane within which the leader will reside.

Autodesk.AutoCAD.DatabaseServices.Leader.AppendVertex(Autodesk.AutoCAD.Geometry.Point3d)
Appends vertex to the end of the vertex list for this leader. If vertex is not in the plane of the leader, then it will be projected parallel the leader's normal onto the leader's plane and the projection will be appended to the leader's vertex list. If the new vertex is too close to the one next to it (that is, within 1.e-10 for X, Y, and Z), the new vertex will not be appended.
pointToAdd: Point (in WCS coordinates) to add to the vertex list.
Returns: True if the vertex is successfully appended.

Autodesk.AutoCAD.DatabaseServices.Leader.VertexAt(System.Int32)
Returns the Point3d that is the vertex at the location index (0 based) in this leader's vertex array.
value: Index number (0 based) of the vertex desired.
Returns: The Point3d that is the vertex at the location index (0 based) in this leader's vertex array.

Autodesk.AutoCAD.DatabaseServices.Leader.SetVertexAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets the vertex at index to the point point projected (along the plane normal) onto the plane containing the leader. It doesn't reset the vertex if that would cause one of the segments to become zero length (within 1e-10).
index: Index number (0 based) of the vertex to change.
pointValue: New point value (in WCS) to use.
Returns: True if the new vertex value is successfully set.

Autodesk.AutoCAD.DatabaseServices.Leader.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)


Autodesk.AutoCAD.DatabaseServices.Leader.GetDimstyleData


Autodesk.AutoCAD.DatabaseServices.Leader.{dtor}
