Autodesk.AutoCAD.GraphicsInterface.LightingModel
Describes the type of lighting to apply to the faces of graphical entities to which this face style is applied.

Autodesk.AutoCAD.GraphicsInterface.LightingModel.Constant
Faces are drawn in a constant color.

Autodesk.AutoCAD.GraphicsInterface.LightingModel.Gooch
Faces are drawn with a non-photorealistic lighting model based on practice in traditional technical illustration, where the lighting model uses both luminance and changes in hue to indicate surface orientation, reserving extreme lights and darks for edge lines and highlights.

Autodesk.AutoCAD.GraphicsInterface.LightingModel.Phong
Faces are drawn to approximate realistic direct lighting.

Autodesk.AutoCAD.GraphicsInterface.LightingModel.Invisible
Faces are not drawn.