Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter
This class is a container for the MentalRayRenderSettingsTraits.SamplingContrastColor property.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter.#ctor(System.Single,System.Single,System.Single,System.Single)


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter.A


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter.B


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter.G


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsFloatParameter.R
