Autodesk.AutoCAD.GraphicsInterface.WorldGeometry
This class is responsible for inserting geometry into the graphics cache for later display. An object of this class is part of every WorldDraw object which is passed into an entity's WorldDraw() method when graphics generation is required for the entity. Geometry generated with the methods of this class is used in all viewports. If viewport-specific graphics are desired, then ViewportDraw() must be used instead of WorldDraw().

Autodesk.AutoCAD.GraphicsInterface.WorldGeometry.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.WorldGeometry.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.WorldGeometry.SetExtents(Autodesk.AutoCAD.DatabaseServices.Extents3d)
Sets the extents of the current entity to extents.
extents: An array of two points.

Autodesk.AutoCAD.GraphicsInterface.WorldGeometry.StartAttributesSegment
If this drawable is a block and has Attributes, it must call this method exactly once before sending the attributes to Draw(). Once this method is called, the object may draw only attributes and no more primitives. The attributes must be the last objects rendered.

Autodesk.AutoCAD.GraphicsInterface.WorldGeometry.{dtor}
