Autodesk.AutoCAD.DatabaseServices.ShadePlotResLevel
Defines the shade plot resolution level of the current PlotSettings object. The shade plot resolution level specifies the resolution at which shaded and rendered viewports will plot.

Autodesk.AutoCAD.DatabaseServices.ShadePlotResLevel.Custom
Plot at the current device resolution, to a maximum dpi specified by the shade plot custom dpi.

Autodesk.AutoCAD.DatabaseServices.ShadePlotResLevel.Presentation
Plot at the current device resolution, to a maximum of 600 dpi.

Autodesk.AutoCAD.DatabaseServices.ShadePlotResLevel.Preview
Plot at one quarter of the current device resolution, to a maximum of 150 dpi.

Autodesk.AutoCAD.DatabaseServices.ShadePlotResLevel.Draft
Plot as wireframe; this setting is legacy mode.

Autodesk.AutoCAD.DatabaseServices.ShadePlotResLevel.Maximum
Plot at the current device resolution, with no maximum.

Autodesk.AutoCAD.DatabaseServices.ShadePlotResLevel.Normal
Plot at half the current device resolution, to a maximum of 300 dpi; this is the default setting.