Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame
Represents Feature Control Frames for Geometric Dimensioning and Tolerancing.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.#ctor(System.String,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructor.
codes: Text string containing the codes to specify the feature control symbols and the tolerance for this object. If this value is null, this is just like calling the default constructor.
insertionPoint: Insertion point (WCS) of this FeatureControlFrame object.
normalVector: Normal vector (WCS) of the plane containing this FeatureControlFrame object.
x: X-direction vector (WCS) of this FeatureControlFrame object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimtxt
Gets or sets the current DIMTXT value for the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimtxsty
Gets or sets the objectId of the textStyle specified by the current DIMTXSTY value of the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimscale
Gets or sets the current DIMSCALE value for the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimgap
Gets or sets the current DIMGAP value for the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimclrt
Gets or sets the current DIMCLRT value for the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimclrd
Gets or sets the current DIMCLRD value for the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.DimensionStyle
Gets or sets the objectId of the object's DimensionStyle.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.DimstyleData
Gets or sets the DimStyle information from the DimStyleTableRecord referenced by this object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Direction
Gets the X-direction vector (in WCS) for the object. The X-direction vector determines the direction that the object goes away from its "location" point.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Normal
Gets the unit normal vector (in WCS) of the plane containing the FeatureControlFrame object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Location
Gets or sets the insertion point (in WCS) of the FeatureControlFrame object.The "insertion" point for a FeatureControlFrame is the middle of the left edge of its first line.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Text


Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.SetOrientation(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets norm to be the FeatureControlFrame plane normal and dir to be the X-direction for the FeatureControlFrame. Both values are specified in WCS coordinates.dir must be perpendicular to norm.
norm: Vector (in WCS) to be used to define the new plane that will contain the FeatureControlFrame.
dir: X-Direction vector (WCS) for the FeatureControlFrame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetBoundingPoints
Returns with points defining the bounding box of this FeatureControlFrame object.
Returns: Points defining the bounding box of this FeatureControlFrame object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetBoundingPolyline
Returns with points defining the bounding pline of this FeatureControlFrame object.
Returns: Points defining the bounding pline of this FeatureControlFrame object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
Compares the DimStyle data in the record pointed to by style with the data in the record referenced by the feature control frame, and applies any differences as dimension variable overrides on the leader. So, when this method is finished, the combination of the referenced DimStyleTableRecord and the newly applied dimension variable overrides will make the dimension display as though it were actually referencing the DimStyleTableRecord style.
style: The DimStyleTableRecord whose data is to be applied to this dimension.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetDimstyleData
Copies the DimStyle information from the DimStyleTableRecord referenced by this object into the return value. After copying the data, any dimension variable overrides currently applied to this object will be copied into the return record.
Returns: A non-database-resident record.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.{dtor}
