Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDiagnosticGridModeParameter
This class is a container for the MentalRayRenderSettingsTraits.DiagnosticGridMode property.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDiagnosticGridModeParameter.#ctor(Autodesk.AutoCAD.GraphicsInterface.DiagnosticGridMode,System.Single)


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDiagnosticGridModeParameter.Size


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDiagnosticGridModeParameter.Mode
