Autodesk.AutoCAD.DatabaseServices.ImageDisplayOptions
Specifies display options.

Autodesk.AutoCAD.DatabaseServices.ImageDisplayOptions.Transparent
Use transparent background for bitonal images (or use opaque background color).

Autodesk.AutoCAD.DatabaseServices.ImageDisplayOptions.Show
Show image (or draw frame only).

Autodesk.AutoCAD.DatabaseServices.ImageDisplayOptions.Clip
Clip image.

Autodesk.AutoCAD.DatabaseServices.ImageDisplayOptions.ShowUnaligned
Show rotates images (or draw frame only).