Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.#ctor(Autodesk.AutoCAD.DatabaseServices.RevolveOptions)


Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.CloseToAxis
Gets or sets a Boolean value for the close to axis option.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.TwistAngle
Gets or sets the angle by which the profile will be twisted as it revolves around the axis. Default value of this option is 0.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.DraftAngle
Gets or sets  the angle by which the profile will taper as it is revolved around the axis. The default value of this option is 0.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.ToRevolveOptions
Returns a RevolveOptions object created from this object.
Returns: A RevolveOptions object created from this object.