Autodesk.AutoCAD.Geometry.PointOnCurve2d
Represents a point on a 2D parametric curve. This class encapsulates all of the geometric information of a point on a 2D curve, including its parameter value, 2D coordinates, and derivatives.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,System.Double)
Constucts a point on the input curve at the specified parameter value.
curve: Any 2D curve.
parameter: Parameter value on curve.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d)
Constructs a point on the input curve at the parameter value 0.0.
curve: Any 2D curve.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.PointOnCurve2d.Point
Gets the coordinates of the point on curve.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.Parameter
Gets or sets the parameter value of the point on curve.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.Curve
Gets or sets the curve on which the point lies.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.PointOnCurve2d.GetPointAtParameter(System.Double)
Returns the coordinates of the point on curve at the specified parameter value. This method resets the parameter value of the point on curve.
parameter: Parameter value.
Returns: The coordinates of the point on curve at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.GetPointOnCurve(Autodesk.AutoCAD.Geometry.Curve2d,System.Double)
Returns the coordinates of the point on the input curve at the specified parameter value. This method resets the underlying curve and parameter value of the point on curve.
curve: Any 2D curve.
parameter: Parameter value.
Returns: The coordinates of the point on curve at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.GetDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Curve2d,System.Double)
Returns the derivative of the specified order on the input curve at the specified parameter value. order must be greater than 0 and no larger than 2. This method resets the underlying curve and parameter value of the point on curve.
order: Order of derivative.
curve: Any 2D curve.
parameter: Parameter value on curve.
Returns: The derivative of the specified order on the input curve at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.GetDerivative(System.Int32,System.Double)
Returns the derivative of the specified order at the specified parameter value. order must be greater than 0 and no larger than 2. This method resets the parameter value of the point on curve.
order: Order of derivative.
parameter: Parameter value on curve.
Returns: The derivative of the specified order at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.GetDerivative(System.Int32)
Returns the derivative of the specified order. order must be greater than 0 and no larger than 2.
parameter: Parameter value on curve.
Returns: The derivative of the specified order.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.{dtor}
