Autodesk.AutoCAD.DatabaseServices.LayoutManager
Interface class for database-specific routines that manipulate and access Layout objects.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutCount
Gets the number of items in the layout dictionary which should represent the number of Layout objects in the drawing. This includes the Model tab, which is always present.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.CurrentLayout
Gets the name of the current, or active, Layout object.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.Current
Gets or sets the current layout in the active database.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.GetLayoutId(System.String)
Returns ObjectId of the Layout object associated with the given input name.
name: Name of Layout object to search for.
Returns: ObjectId of the Layout object associated with the given input name.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.CopyLayout(System.String,System.String)
Makes a copy of an existing Layout object with the given copyname and creates a new copy with the layout name of newname.
copyName: Name of Layout object to be copied.
newName: Name for new copy of Layout object.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.DeleteLayout(System.String)
Removes the Layout object associated with the given layout name from the current database.
deleteName: Name of Layout object to delete.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.CreateLayout(System.String)
Creates a new Layout object given a unique layout name. The default viewports for the new layout are not created until the layout is first activated.
newName: Name to give new Layout object.
Returns: ObjectId of the newly created Layout object.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.RenameLayout(System.String,System.String)
Renames Layout object by the given oldname to the new name given by newname.
oldName: Name of Layout object to rename.
newName: New name for renamed Layout object.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.CloneLayout(System.String,System.String,System.Int32)
Clones the given Layout object and sets the cloned layout to the given layout name and tab order.
copyName: Layout name.
newName: Name for new layout.
newTabOrder: Integer specifying new tab order.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.GetNonRectangularViewportIdFromClipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns the ObjectId for the non rectangular viewport ID associated with the given clipId.
clipId: ObjectId of clip entity to get the nonrectangular viewport ID from.
Returns: The ObjectId for the non rectangular viewport ID associated with the given clipId.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutsReordered


Autodesk.AutoCAD.DatabaseServices.LayoutManager.PlotStyleTableChanged


Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutSwitched


Autodesk.AutoCAD.DatabaseServices.LayoutManager.AbortLayoutRename


Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutRenamed


Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutToBeRenamed


Autodesk.AutoCAD.DatabaseServices.LayoutManager.AbortLayoutCopied


Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutCopied


Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutToBeCopied


Autodesk.AutoCAD.DatabaseServices.LayoutManager.AbortLayoutRemoved


Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutRemoved


Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutToBeRemoved


Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutCreated


Autodesk.AutoCAD.DatabaseServices.LayoutManager.{dtor}
