Autodesk.AutoCAD.DatabaseServices.ResultBuffer
Result buffer structure that handles all AutoCAD basic data types.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.#ctor(Autodesk.AutoCAD.DatabaseServices.TypedValue[])
Constrctor.
values: Array of TypeValue objects.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.Create(System.IntPtr,System.Boolean)
Creates a managed ResultBuffer object from an unmanaged resbuf pointer.
buffer: An unmanaged resbuf pointer.
autoDelete: System.Boolean object.
Returns: A managed ResultBuffer object.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.GetEnumerator
Returns an enumerator object for this ResultBuffer object.
Returns: An enumerator object for this ResultBuffer object.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.Add(System.Object)
If value can be coerced to type TypedValue, then it is added to the end of this ResultBuffer's list.
value: Object to add.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.Add(Autodesk.AutoCAD.DatabaseServices.TypedValue)
Adds value to the end of this ResultBuffer's list.
value: TypedValue object to add.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.AsArray
Returns an array of typed values representing the nodes in the ResultBuffer.
Returns: An array of typed values representing the nodes in the ResultBuffer.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj: An object.
Returns: true if this object is identical to the argument object.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.GetHashCode


Autodesk.AutoCAD.DatabaseServices.ResultBuffer.ToString


Autodesk.AutoCAD.DatabaseServices.ResultBuffer.ToString(System.IFormatProvider)


Autodesk.AutoCAD.DatabaseServices.ResultBuffer.op_Inequality(Autodesk.AutoCAD.DatabaseServices.ResultBuffer,Autodesk.AutoCAD.DatabaseServices.ResultBuffer)


Autodesk.AutoCAD.DatabaseServices.ResultBuffer.op_Equality(Autodesk.AutoCAD.DatabaseServices.ResultBuffer,Autodesk.AutoCAD.DatabaseServices.ResultBuffer)


Autodesk.AutoCAD.DatabaseServices.ResultBuffer.{dtor}
