Autodesk.AutoCAD.DatabaseServices.Xrecord
A data storage class that was implemented primarily to allow ADSRX and AutoLISP programs a means to store data in pieces larger than the xdata's 16KB-per-object limit. Each Xrecord object is capable of storing up to 2GB. By establishing an object's extension dictionary as the xrecord's owner, it's possible to associate large amounts of data with that object.

Autodesk.AutoCAD.DatabaseServices.Xrecord.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Xrecord.MergeStyle
Gets or sets the merge style for insert operations.

Autodesk.AutoCAD.DatabaseServices.Xrecord.XlateReferences
Gets or sets true if the xrecord is currently set to translate any object IDs in its data chain during DeepClone or WblockClone operations.

Autodesk.AutoCAD.DatabaseServices.Xrecord.Data
Gets or sets the data list for the xrecord.

Autodesk.AutoCAD.DatabaseServices.Xrecord.{dtor}
