Autodesk.AutoCAD.Geometry.BoundBlock3d
Provides spatial dimensional bounding volume implementation.Bounding blocks may exist in two forms: as an ordinary coordinate-aligned bounding box and as a parallelepiped.

Autodesk.AutoCAD.Geometry.BoundBlock3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a parallelepiped given a vertex and two sides.
point1: Origin vertex a corner of the bounding box.
dir1: Direction and size for first side of the bounding box.
dir2: Direction and size for second side of the bounding box.
dir3: Direction and size for third side of the bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.IsBox
Gets or sets true if the block is a coordinate box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Direction3
Gets direction and size for third side of the bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Direction2
Gets direction and size for second side of the bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Direction1
Gets direction and size for first side of the bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.BasePoint
Gets origin vertex a corner of the bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.BoundBlock3d.GetMaximumPoint
Returns third corner vertex for bounding box.
Returns: Third corner vertex for bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.GetMinimumPoint
Returns first corner vertex for bounding box.
Returns: First corner vertex for bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the block as a parallelepiped with given vertex and sides.
basePoint: Origin vertex a corner of the bounding box.
dir1: Direction and size for first side of the bounding box.
dir2: Direction and size for second side of the bounding box.
dir3: Direction and size for third side of the bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Sets the block as a parallelepiped contracted to a segment between two points.
basePoint: Origin vertex a corner of the bounding box.
maximumPoint: Direction and size for third side of the bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Extend(Autodesk.AutoCAD.Geometry.Point3d)
Extends the block to include the new point.
pointToInclude: Extension point.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Swell(System.Double)
Swells the block by moving the sides for the distance.
distance: Distance to expand the block.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Contains(Autodesk.AutoCAD.Geometry.Point3d)
Gets true if the point belongs to the block.
pointToTest: Point to test whether the point belongs to the block.
Returns: true if the point belongs to the block.

Autodesk.AutoCAD.Geometry.BoundBlock3d.IsDisjoint(Autodesk.AutoCAD.Geometry.BoundBlock3d)
Gets true if the input block does not intersect with this block.
block: Another BoundBlock3d object.
Returns: true if the input block does not intersect with this block.

Autodesk.AutoCAD.Geometry.BoundBlock3d.{dtor}
