Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext
This class represents the input parameters of the DatabaseServices.Entity.GetObjectSnapPoints() ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext.ViewTransform
Gets transformation matrix to transform from WCS to DCS.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext.LastPoint
Gets point (in WCS coordinates) selected just before PickPoint.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext.PickPoint
Gets point (in WCS coordinates) picked during the object snap operation.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext.GraphicsSystemSelectionMark
Gets graphic system marker of the subentity involved in the object snap operation.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext.PickedObject
Gets entity involved in the object snap operation.