Autodesk.AutoCAD.GraphicsSystem.RenderType
Provides a hint to the Graphic System about how the model's geometry should be rendered.

Autodesk.AutoCAD.GraphicsSystem.RenderType.Count
Count of RenderTypes.

Autodesk.AutoCAD.GraphicsSystem.RenderType.Direct
Skip Z-buffer test.

Autodesk.AutoCAD.GraphicsSystem.RenderType.Highlight
Render directly onto the device (skipping the frame buffer and the z-test).

Autodesk.AutoCAD.GraphicsSystem.RenderType.Sprite
Use alternate Z-buffer, for sprites.

Autodesk.AutoCAD.GraphicsSystem.RenderType.Main
Use main Z-buffer.