Autodesk.AutoCAD.DatabaseServices.Ellipse
Represents the ELLIPSE entity in AutoCAD. It contains the methods to create, modify, and obtain properties of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
This constructor is used to create an Ellipse using the values passed in. The center, unitNormal and majorAxis are used to calculate the start point. The majorAxis vector represents half the major axis of the ellipse (that is, from the center point to the start point of the ellipse) and is the zero angle for startAngle and endAngle. Positive angles are counter-clockwise when looking down the normal vector (that is, right-hand rule). A startAngle of 0 and endAngle of 2pi will produce a closed Ellipse.
center: Center of the ellipse.
unitNormal: Vector specifying normal, which determines the plane of the ellipse.
majorAxis: Vector which represents 1/2 the major axis of the ellipse.
radiusRatio: Ratio of the major radius to the minor radius.
startAngle: Start angle of the ellipse in radians.
endAngle: End angle of the ellipse in radians.

Autodesk.AutoCAD.DatabaseServices.Ellipse.#ctor
The default constructor for this class. Initializes to circle of radius 1 in XY plane with center (0,0,0).

Autodesk.AutoCAD.DatabaseServices.Ellipse.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Ellipse.IsNull
Gets true if this Ellipse has no gelib object within itself.

Autodesk.AutoCAD.DatabaseServices.Ellipse.EndParam
Gets or sets the end parameter of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.StartParam
Gets or sets the start parameter of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.EndAngle
Gets or sets the first period equivalent of the end angle (in radians) of the ellipse. The angle will be in the range -pi to pi.

Autodesk.AutoCAD.DatabaseServices.Ellipse.StartAngle
Gets or sets the first period equivalent of the start angle (in radians) of the ellipse. The angle will be in the range -pi to pi.

Autodesk.AutoCAD.DatabaseServices.Ellipse.RadiusRatio
Gets or sets the ratio of the ellipse's major radius to its minor radius. The value will be in the range 1e-6 to 1.0.

Autodesk.AutoCAD.DatabaseServices.Ellipse.MinorAxis
Gets the minor axis vector (in WCS coordinates) of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.MajorAxis
Gets the major axis vector (in WCS coordinates) of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.Normal
Gets the unit normal vector (in WCS coordinates) of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.Center
Gets or sets the center point (in WCS Coordinates) of the Ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.GetParameterAtAngle(System.Double)
Returns the first period parameter value at angle (in radians). The parameter value is in the range 0 to 2pi.
angle: Angle (in radians) at which the parameter is desired.
Returns: The first period parameter value at angle (in radians).

Autodesk.AutoCAD.DatabaseServices.Ellipse.GetAngleAtParameter(System.Double)
Returns the first period equivalent of the angle at the param location on the ellipse. The returned angle will be in the range -pi to pi.
value: Parameter to evaluate.
Returns: The first period equivalent of the angle at the param location on the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
Sets the properties of the ellipse to the values specified in the arguments.
center: Center point (in WCS coordinates) for the ellipse.
unitNormal: Normal vector (in WCS coordinates) which defines the plane in which the ellipse lies.
majorAxis: Major axis (in WCS coordinates) for the ellipse.
radiusRatio: Desired ratio of the major radius to the minor radius.
startAngle: Start angle (in radians) for the ellipse.
endAngle: End angle (in radians) for the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.{dtor}
