Autodesk.AutoCAD.LayerManager.LayerGroup
This class is derived from LayerFilter and serves as the access to layer group filters. It allows the client to specify and retrieve a set of layer IDs.

Autodesk.AutoCAD.LayerManager.LayerGroup.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.LayerManager.LayerGroup.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.LayerManager.LayerGroup.LayerIds
Gets the array of layer IDs of this layer group filter.

Autodesk.AutoCAD.LayerManager.LayerGroup.DeleteUnmanagedObject


Autodesk.AutoCAD.LayerManager.LayerGroup.{dtor}
