Autodesk.AutoCAD.GraphicsInterface.WoodTexture
Represents a "wood" procedural texture.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.WoodTexture.GrainThickness
Gets or sets the thickness of the wood grain.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.AxialNoise
Gets or sets the axial noise level of the wood grain.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.RadialNoise
Gets or sets the radial noise level of the wood grain.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.Color2
Gets or sets the color property of the second wood grain.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.Color1
Gets or sets the color property of the first wood grain.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.Clone


Autodesk.AutoCAD.GraphicsInterface.WoodTexture.Set(Autodesk.AutoCAD.GraphicsInterface.WoodTexture)


Autodesk.AutoCAD.GraphicsInterface.WoodTexture.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.WoodTexture.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.WoodTexture.op_Equality(Autodesk.AutoCAD.GraphicsInterface.WoodTexture,Autodesk.AutoCAD.GraphicsInterface.WoodTexture)


Autodesk.AutoCAD.GraphicsInterface.WoodTexture.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.WoodTexture,Autodesk.AutoCAD.GraphicsInterface.WoodTexture)


Autodesk.AutoCAD.GraphicsInterface.WoodTexture.{dtor}
