Autodesk.AutoCAD.DatabaseServices.RenderSettings
This class is a container for all properties relating to a generic high-fidelity renderer. A dictionary of these objects is resident in the database, in the named object dictionary as ACAD_RENDER_SETTINGS. They are indexed by the name of the setting objects. In the user interface, the contents of this dictionary correspond to user-defined render presets (not predefined presets).

Autodesk.AutoCAD.DatabaseServices.RenderSettings.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RenderSettings.PreviewImageFileName
Gets or sets the full path and file name of the preview image.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.ShadowsEnabled
Gets or sets a Boolean value indicating whether shadows are rendered or not.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.BackFacesEnabled
Gets or sets a boolean indicating whether back-facing faces are rendered.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.TextureSampling
Gets or sets a boolean indicating whether sampling (filtering) of image textures is on or off.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.MaterialsEnabled
Gets or sets a Boolean value indicating whether materials are used per-object. When false, all objects are rendered with the global material.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.DiagnosticBackgroundEnabled
Gets or sets a Boolean indicating whether the diagnostic (checker) background is used for rendering.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.DisplayIndex
Gets or sets the display index of this render setting.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.Description
Gets or sets the description of the render settings.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.Name
Gets or sets the user-defined name of the render settings.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.{dtor}
