Autodesk.AutoCAD.DatabaseServices.DwfDefinition
Represents DWF underlays in the drawing. Underlays are similar to raster images but their content is snappable.

Autodesk.AutoCAD.DatabaseServices.DwfDefinition.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.DwfDefinition.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DwfDefinition.{dtor}
