Autodesk.AutoCAD.GraphicsSystem.ViewportBorderProperties.#ctor(System.Drawing.Color,System.Int32)


Autodesk.AutoCAD.GraphicsSystem.ViewportBorderProperties.Weight


Autodesk.AutoCAD.GraphicsSystem.ViewportBorderProperties.Color
