Autodesk.AutoCAD.DatabaseServices.GraphicsMetafileType
Indicates what kind of data is in the proxy's graphics metafile.

Autodesk.AutoCAD.DatabaseServices.GraphicsMetafileType.FullGraphics


Autodesk.AutoCAD.DatabaseServices.GraphicsMetafileType.BoundingBox


Autodesk.AutoCAD.DatabaseServices.GraphicsMetafileType.NoMetafile
