Autodesk.AutoCAD.DatabaseServices.MatchProperties
An abstract base class for a series of protocol extension classes that add the ability to copy properties between entities.

Autodesk.AutoCAD.DatabaseServices.MatchProperties.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.MatchProperties.CopyProperties(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,System.Int32)
This method is expected to copy any appropriate properties from sourceEntity to targetEntity.
sourceEntity: Entity from which properties will be copied.
targetEntity: Entity to which properties will be copied.
flag: Bit flags indicating which properties to copy.

Autodesk.AutoCAD.DatabaseServices.MatchProperties.{dtor}
