Autodesk.AutoCAD.GraphicsInterface.VertexData
This class is a container for the optional data that can be specified for a set of vertices for meshes and shells.

Autodesk.AutoCAD.GraphicsInterface.VertexData.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.VertexData.OrientationFlag
Gets or sets the current orientation type for vertices. The orientation type indicates the direction the vertices in a mesh or shell appear to follow when viewed in order while looking down the normal axis towards any given vertex. Essentially the orientation type defines the normal's positive or negative direction at the vertices.

Autodesk.AutoCAD.GraphicsInterface.VertexData.SetNormalVectors(Autodesk.AutoCAD.Geometry.Vector3d[])
Sets the VertexData object to use the vertex normal array pointed to by normal.
normal: Array of normal vectors.

Autodesk.AutoCAD.GraphicsInterface.VertexData.SetTrueColors(Autodesk.AutoCAD.Colors.EntityColor[])
This method is analogous to FaceData.SetColors(). The same memory restrictions apply. The only difference is that SetTrueColors() takes an array of EntityColor objects instead of an array of short.
colors: Array of colors.

Autodesk.AutoCAD.GraphicsInterface.VertexData.GetTrueColors
This method is analogous to FaceData.GetColors(). The same memory restrictions apply. The only difference is that GetTrueColors() returns an array of EntityColor objects instead of an array of type short.
Returns: An array of EntityColor.

Autodesk.AutoCAD.GraphicsInterface.VertexData.GetNormalVectors
Gets the vertex normal array currently in use by the VertexData object.
Returns: The vertex normal array currently in use by the VertexData object.