Autodesk.AutoCAD.Geometry.PolylineCurve3d
Represents a piecewise linear spline entity in 3D space.

Autodesk.AutoCAD.Geometry.PolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Constructs a polyline approximating a curve within the specified tolerance.
curve: Curve to be approximated by polyline.
epsilon: Approximation tolerance.

Autodesk.AutoCAD.Geometry.PolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point3dCollection)
Description to come.
knots: Description to come.
controlPoints: Description to come.

Autodesk.AutoCAD.Geometry.PolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection)
Constructs a polylines with the specified fit points.
points: Array of fit points.

Autodesk.AutoCAD.Geometry.PolylineCurve3d.NumberOfFitPoints
Gets number of fit points.

Autodesk.AutoCAD.Geometry.PolylineCurve3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.PolylineCurve3d.FitPointAt(System.Int32)
Returns fit point at the specified index.
i: Index of a fit point.
Returns: Fit point at the specified index.

Autodesk.AutoCAD.Geometry.PolylineCurve3d.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets fit point at the specified index to the input point.
i: Index of a fit point.
point: Fit point.

Autodesk.AutoCAD.Geometry.PolylineCurve3d.{dtor}
