Autodesk.AutoCAD.GraphicsInterface.MaterialColor
Defines material component colors by color method and color value.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.#ctor(Autodesk.AutoCAD.GraphicsInterface.Method,System.Double,Autodesk.AutoCAD.Colors.EntityColor)


Autodesk.AutoCAD.GraphicsInterface.MaterialColor.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.Color
Gets the current color value.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.Factor
Gets the current scale factor. A scale factor of 0.0 indicates black. A scale factor of 1.0 indicates that the colors are left unchanged.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.Method
Gets the current color method.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.MaterialColor.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.MaterialColor.{dtor}
