Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty
Encapsulates a property on a dynamic block reference, and provides a mutator for the property's value.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.Value
Gets or sets the current value of the property on the block as an Object.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.UnitsType
Gets the format type of the property.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.Description
Gets the property description as a String object.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.Show
Gets true if the property is displayed in the Properties palette when the block reference containing the property is selected.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.ReadOnly
Gets whether the property is read only.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.PropertyTypeCode
Gets the property type.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.PropertyName
Gets the name of the property as a String.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.BlockId
Gets the ObjectId of the dynamic block reference containing the property represented by the DynamicBlockReferenceProperty.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.GetAllowedValues
Returns the allowed values for the property.
Returns: Object array that upon a successful return is populated with the allowed property values.