Autodesk.AutoCAD.Runtime.Marshaler.BitmapInfoToBitmap(System.IntPtr)


Autodesk.AutoCAD.Runtime.Marshaler.BitmapToBitmapInfo(System.Drawing.Bitmap)


Autodesk.AutoCAD.Runtime.Marshaler.CopyToUnmanagedFullSubentityPath(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.IntPtr)


Autodesk.AutoCAD.Runtime.Marshaler.CopyToManagedFullSubentityPath(System.IntPtr)


Autodesk.AutoCAD.Runtime.Marshaler.GetInternalArray(Autodesk.AutoCAD.Geometry.Vector3dCollection)


Autodesk.AutoCAD.Runtime.Marshaler.GetInternalArray(Autodesk.AutoCAD.Geometry.Vector2dCollection)


Autodesk.AutoCAD.Runtime.Marshaler.GetInternalArray(Autodesk.AutoCAD.Geometry.Point2dCollection)


Autodesk.AutoCAD.Runtime.Marshaler.GetInternalArray(Autodesk.AutoCAD.Geometry.IntegerCollection)


Autodesk.AutoCAD.Runtime.Marshaler.GetInternalArray(Autodesk.AutoCAD.Geometry.DoubleCollection)


Autodesk.AutoCAD.Runtime.Marshaler.SetInternalArray(Autodesk.AutoCAD.Geometry.Vector3dCollection,Autodesk.AutoCAD.Geometry.Vector3d[],System.Int32)


Autodesk.AutoCAD.Runtime.Marshaler.SetInternalArray(Autodesk.AutoCAD.Geometry.Vector2dCollection,Autodesk.AutoCAD.Geometry.Vector2d[],System.Int32)


Autodesk.AutoCAD.Runtime.Marshaler.SetInternalArray(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Point2d[],System.Int32)


Autodesk.AutoCAD.Runtime.Marshaler.SetInternalArray(Autodesk.AutoCAD.Geometry.IntegerCollection,System.Int32[],System.Int32)


Autodesk.AutoCAD.Runtime.Marshaler.SetInternalArray(Autodesk.AutoCAD.Geometry.DoubleCollection,System.Double[],System.Int32)
