Autodesk.AutoCAD.DatabaseServices.Graph
Provides a generic graph container implementation.

Autodesk.AutoCAD.DatabaseServices.Graph.#ctor(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Constructor.The first node in the graph is considered the root node.
root: Root node.

Autodesk.AutoCAD.DatabaseServices.Graph.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Graph.IsEmpty
Gets true if the graph is empty.

Autodesk.AutoCAD.DatabaseServices.Graph.NumNodes
Gets the number of nodes in the graph.

Autodesk.AutoCAD.DatabaseServices.Graph.RootNode
Gets the root, or first, node in the graph.Gets null if the first node is null; that is, the graph is empty.

Autodesk.AutoCAD.DatabaseServices.Graph.Node(System.Int32)
Returns the node at index index.
index: Desired node index.
Returns: The node at index index.

Autodesk.AutoCAD.DatabaseServices.Graph.AddNode(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Adds a new node to the graph. The node must be created on the heap and should not be deleted once it has been added to the graph. The graph will take care of deleting it when necessary. You cannot add a node to more than one graph.
nodeToAdd: Node to add.

Autodesk.AutoCAD.DatabaseServices.Graph.AddEdge(Autodesk.AutoCAD.DatabaseServices.GraphNode,Autodesk.AutoCAD.DatabaseServices.GraphNode)
Adds an edge between two nodes to the graph. Neither node can be null, and must have already been added to this same graph.
from: The node to begin the edge at.
toPointer: The node to end the edge at.

Autodesk.AutoCAD.DatabaseServices.Graph.DelNode(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Completely removes a node from the graph. It also disconnects the references from other nodes to this node, if present.
nodeToDelete: Node to delete.

Autodesk.AutoCAD.DatabaseServices.Graph.ClearAll(System.Byte)
Used to clear the GraphNode.Flags bit(s) in all the nodes in the graph.
flags: Flag values to clear for all nodes in the graph.

Autodesk.AutoCAD.DatabaseServices.Graph.GetOutgoing
Gets all of the outgoing nested nodes.
Returns: Array of GraphNode.

Autodesk.AutoCAD.DatabaseServices.Graph.FindCycles(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Sets up the internal cycle graph in order to find and label all nodes which cause circular references.
start: The node to begin the search for cycles at.
Returns: True if the graph has circular references.

Autodesk.AutoCAD.DatabaseServices.Graph.BreakCycleEdge(Autodesk.AutoCAD.DatabaseServices.GraphNode,Autodesk.AutoCAD.DatabaseServices.GraphNode)
This method is used to break a cycle at a particular point. It removes both the cycle reference and the real reference between from and toPointer.It then calls FindCycles() to update the cycle information changes which result from the break.
from: The node that the edge begins at.
toPointer: The node that the edge ends at.

Autodesk.AutoCAD.DatabaseServices.Graph.SetNodeGrowthRate(System.Int32)
Sets the number of nodes that are allocated to the graph at a time.
rate: Number of nodes to allocate at once.

Autodesk.AutoCAD.DatabaseServices.Graph.DeleteUnmanagedObject


Autodesk.AutoCAD.DatabaseServices.Graph.{dtor}
