Autodesk.AutoCAD.GraphicsInterface.TextStyle
This class is used to set the display attributes of text.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.#ctor(System.String,System.String,System.Double,System.Double,System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)
Constructor.
fontName: File name of font file to use.
bigFontName: File name of bigfont to use.
textSize: Text size.
x: Relative X scale factor.
obliqueAngle: Text obliquing angle.
trackingPercent: Tracking percent.
isBackward: Boolean indicating text should be backward.
isUpsideDown: Boolean indicating text should be upside down.
isVertical: Boolean indicating text to be vertical or horizontal.
isOverLined: Boolean indicating text should be overlined.
isUnderlined: Boolean indicating text should be underlined.
styleName: Name to use for this style.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.PreLoaded
For internal use only.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Font
Gets or sets the font definition from the TextStyle object. The values are the typeface, the bold and italics style attributes, the character set, and the pitch and family attributes.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.StyleName
Gets or sets the styleName of the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.BigFontFileName
Gets or sets the big font file name in use by the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.FileName
Gets or sets the font file name in use by the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Overlined
Gets or sets true if the TextStyle object is set to display text with a line over it (that is, similar to underlining, but over the text instead of under it).

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Underlined
Gets or sets true if the TextStyle object is set to display underlined text.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Vertical
Gets or sets true if the TextStyle object is set to display text vertically rather than horizontally.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.UpsideDown
Gets or sets true if the TextStyle object is set to display text upside down.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Backward
Gets or sets true if the TextStyle object is set to display text backwards.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.TrackingPercent
Gets or sets the tracking percent in use by the TextStyle object. The value may be between 0.75 and 4.0. The tracking percent is a factor applied to the distance between the starting points of successive characters. A value of 1.0 indicates that the characters have no spacing adjustment (that is, they are spaced based only on the character definitions in the font file).

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ObliquingAngle
Gets or sets the text obliquing angle (in radians) currently in use by the TextStyle object.The obliquing angle is the slant of the text from vertical. A positive angle slants the text forward at the top (for non-backwards text).

Autodesk.AutoCAD.GraphicsInterface.TextStyle.XScale
Gets or sets the X scale factor currently in use by the TextStyle object. The X scale factor is applied to the character cell widths as each character is drawn to allow the width to be adjusted independently of the height.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.TextSize
Gets or sets the text height currently in use by the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.LoadStyleRec


Autodesk.AutoCAD.GraphicsInterface.TextStyle.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.TextStyle.ExtentsBox(System.String,System.Boolean,System.Boolean,Autodesk.AutoCAD.GraphicsInterface.WorldDraw)
Provides the means to find out the extents of the text string value1 when using the TextStyle.
value1: A text string for which the extents are to be determined.
includeSpaces: Boolean indicating if leading and trailing spaces are to be included.
raw: Boolean indicating if the AutoCAD escape sequences are to be interpreted.
context: WorldDraw object; if null, the AutoCAD default regen pipeline is used to calculate extents.
Returns: Lower-left and upper-right corner of text extents box.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.SetTrackKerning(System.Double)
For internal use only.
trackPercent: For internal use.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.{dtor}
