Autodesk.AutoCAD.Geometry.OffsetSurface
Represents an offset object.

Autodesk.AutoCAD.Geometry.OffsetSurface.#ctor(Autodesk.AutoCAD.Geometry.Surface,System.Double)
Constructs an offset object defined by input data.
baseSurface: Base surface.
offsetDistance: Offset distance.

Autodesk.AutoCAD.Geometry.OffsetSurface.#ctor
Default constructor. Initializes the base surface pointer to null and the offset distance to 0.0.

Autodesk.AutoCAD.Geometry.OffsetSurface.OffsetDist
Gets offset distance.

Autodesk.AutoCAD.Geometry.OffsetSurface.ConstructionSurface
Gets the base surface.

Autodesk.AutoCAD.Geometry.OffsetSurface.OriginalSurface
Gets a simple surface by converting this offset surface.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsTorus
Gets a flag indicating if offset is a torus.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsCone
Gets flag indicating if offset is a cone surface.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsCylinder
Gets flag indicating if offset is a cylinder surface.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsSphere
Gets flag indicating if offset is a sphere surface.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsBoundedPlane
Gets flag indicating if offset is a bounded plane.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsPlane
Gets flag indicating if offset is a plane.

Autodesk.AutoCAD.Geometry.OffsetSurface.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.OffsetSurface.Set(Autodesk.AutoCAD.Geometry.Surface,System.Double)
Changes offset definition to the one specified by input data.
baseSurface: Base surface.
offsetDistance: Offset distance.

Autodesk.AutoCAD.Geometry.OffsetSurface.{dtor}
