Autodesk.AutoCAD.Geometry.OffsetCurve2d
Represents a curve that is an exact offset of another curve (base curve).

Autodesk.AutoCAD.Geometry.OffsetCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,System.Double)
Constructs an offset curve that is an exact offset of the specified base curve. The direction of offset is determined by the sign of the offsetDistance parameter.
baseCurve: Base curve.
offsetDistance: Offset distance.

Autodesk.AutoCAD.Geometry.OffsetCurve2d.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.OffsetCurve2d.Transformation
Gets transformation matrix that was applied to this curve by calling TransformBy().

Autodesk.AutoCAD.Geometry.OffsetCurve2d.ParameterDirection
Gets true if this curve has the same parameter direction as the base curve, false if this curve has an opposite parameter direction as the base curve.

Autodesk.AutoCAD.Geometry.OffsetCurve2d.OffsetDistance
Gets or sets the signed distance that this curve is offset from the base curve.

Autodesk.AutoCAD.Geometry.OffsetCurve2d.Curve
Gets or sets the base curve of which this curve is an offset.

Autodesk.AutoCAD.Geometry.OffsetCurve2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.OffsetCurve2d.{dtor}
