Autodesk.AutoCAD.Geometry.Interval
Represents a finite or semi-infinite interval as the real axis whose bounds are defined with some given tolerance.

Autodesk.AutoCAD.Geometry.Interval.#ctor(Autodesk.AutoCAD.Geometry.Interval)
Copy constructor.
other: The Interval to be copied into this object.

Autodesk.AutoCAD.Geometry.Interval.#ctor(System.Int32,System.Double,System.Double)
Constructor that creates an interval with the upper bound equal to bound.
boundedBelow: Whether to set a lower bound or leave interval unbounded below.
bound: Upper or lower bound.
tolerance: Tolerance.

Autodesk.AutoCAD.Geometry.Interval.#ctor(System.Double,System.Double,System.Double)
Constructor that creates the finite interval with the lower bound equal to lower and the upper bound equal to upper.
lower: Lower bound.
upper: Upper bound.
tolerance: Tolerance.

Autodesk.AutoCAD.Geometry.Interval.#ctor(System.Double)
Constructor that creates the infinite (in both directions) interval and sets the boundary tolerance to the value tolerance.
tolerance: Tolerance.

Autodesk.AutoCAD.Geometry.Interval.IsSingleton
Gets true if this interval is bounded and the lower bound is equal to the upper bound within the boundary tolerance.

Autodesk.AutoCAD.Geometry.Interval.IsUnbounded
Gets true if this interval is unbounded in either one of two directions.

Autodesk.AutoCAD.Geometry.Interval.IsBoundedBelow
Gets true if this interval is bounded below.

Autodesk.AutoCAD.Geometry.Interval.IsBoundedAbove
Gets true if this interval is bounded above.

Autodesk.AutoCAD.Geometry.Interval.IsBounded
Gets true if this interval is bounded in both directions.

Autodesk.AutoCAD.Geometry.Interval.Tolerance
Gets the boundary tolerance of this interval.

Autodesk.AutoCAD.Geometry.Interval.Length
Gets the length of this interval if it is bounded and -1 otherwise.

Autodesk.AutoCAD.Geometry.Interval.Element
Gets upper bound if this interval is bounded above;gets lower bound if this interval is unbounded above but bounded below;gets 0.0 if this interval is unbounded in both directions.

Autodesk.AutoCAD.Geometry.Interval.UpperBound
Gets the upper bound of this interval.

Autodesk.AutoCAD.Geometry.Interval.LowerBound
Gets the lower bound of this interval, which is meaningful only if this interval is bounded below.

Autodesk.AutoCAD.Geometry.Interval.Unbounded
Gets unbounded interval.

Autodesk.AutoCAD.Geometry.Interval.GetBounds


Autodesk.AutoCAD.Geometry.Interval.GetMerge(Autodesk.AutoCAD.Geometry.Interval)


Autodesk.AutoCAD.Geometry.Interval.Subtract(Autodesk.AutoCAD.Geometry.Interval)


Autodesk.AutoCAD.Geometry.Interval.IntersectWith(Autodesk.AutoCAD.Geometry.Interval)


Autodesk.AutoCAD.Geometry.Interval.IsDisjoint(Autodesk.AutoCAD.Geometry.Interval)


Autodesk.AutoCAD.Geometry.Interval.Contains(System.Double)


Autodesk.AutoCAD.Geometry.Interval.Contains(Autodesk.AutoCAD.Geometry.Interval)


Autodesk.AutoCAD.Geometry.Interval.IsContinuousAtUpper(Autodesk.AutoCAD.Geometry.Interval)


Autodesk.AutoCAD.Geometry.Interval.IsOverlapAtUpper(Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval)


Autodesk.AutoCAD.Geometry.Interval.IsEqualAtUpper(System.Double)


Autodesk.AutoCAD.Geometry.Interval.IsEqualAtUpper(Autodesk.AutoCAD.Geometry.Interval)


Autodesk.AutoCAD.Geometry.Interval.IsEqualAtLower(System.Double)


Autodesk.AutoCAD.Geometry.Interval.IsEqualAtLower(Autodesk.AutoCAD.Geometry.Interval)


Autodesk.AutoCAD.Geometry.Interval.IsPeriodicallyOn(System.Double,System.Double@)


Autodesk.AutoCAD.Geometry.Interval.{dtor}
