Autodesk.AutoCAD.DatabaseServices.GradientColor
This class is a container for the gradient colors used by the DatabaseServices.Hatch.

Autodesk.AutoCAD.DatabaseServices.GradientColor.#ctor(Autodesk.AutoCAD.Colors.Color,System.Single)


Autodesk.AutoCAD.DatabaseServices.GradientColor.get_Color


Autodesk.AutoCAD.DatabaseServices.GradientColor.get_Value
