Autodesk.AutoCAD.DatabaseServices.SweepOptions
Utility class for setting options used by SweptSurface.CreateSweptSurface(). These options can be used to control the shape of the resulting surface.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.#ctor(Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Copy constructor.
opts: Object to be copied into this object.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.PathEntityTransform
Gets the coordinate system at the start/end of the path curve.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.SweepEntityTransform
Gets the coordinate system for the sweep entity.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.CheckIntersections
Gets the state of the self-intersection check option.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.Bank
Gets a Boolean indicating whether the sweep face or curve will be banked along the sweep path.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.BasePoint
Gets the base point for alignment.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.AlignStart
Gets a Boolean indicating whether to align to the start or the end of the curve.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.Align
Gets the flag indicating which alignment option is in use.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.AlignAngle
Gets the align angle.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.ScaleFactor
Gets the scale factor.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.TwistAngle
Gets the twist angle. This is the angle by which the profile will be twisted as it is swept. The default value of this option is 0.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.EndDraftDist
Gets the end draft distance. The default value of this option is 0.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.StartDraftDist
Gets the start draft distance. The default value of this option is 0.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.DraftAngle
Gets the draft angle. This is the angle by which profile will taper as it is swept. The default value of this option is 0.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.Clone


Autodesk.AutoCAD.DatabaseServices.SweepOptions.CheckSweepCurve(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
Checks for a valid sweep entity.
sweepEnt: The curve, region, or planar surface to be swept.
displayErrorMessages: Boolean whether or not to display error messages.
Returns: SweepOptionsCheckSweepCurveOut object.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.CheckPathCurve(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
Checks whether path curve is valid for a sweep operation.
pathEnt: Path curve.
displayErrorMessages: Boolean whether or not to display error messages.

Autodesk.AutoCAD.DatabaseServices.SweepOptions.{dtor}
