Autodesk.AutoCAD.Colors.Color
Represents colors in AutoCAD, either as RGB, AutoCAD color index.

Autodesk.AutoCAD.Colors.Color.DictionaryKey
Gets the key.Color objects that have color names can be stored in a dictionary in the form of a Color. Access to the dictionary is controlled by a key made up of name information from a color.

Autodesk.AutoCAD.Colors.Color.DictionaryKeyLength
Gets length of the key string.

Autodesk.AutoCAD.Colors.Color.EntityColor
Gets an EntityColor object representing the non-name portions (only the RGB, bylayer, byblock, or index colors) of a Color.

Autodesk.AutoCAD.Colors.Color.HasBookName


Autodesk.AutoCAD.Colors.Color.HasColorName


Autodesk.AutoCAD.Colors.Color.ColorNameForDisplay


Autodesk.AutoCAD.Colors.Color.BookName


Autodesk.AutoCAD.Colors.Color.ColorName


Autodesk.AutoCAD.Colors.Color.PenIndex


Autodesk.AutoCAD.Colors.Color.ColorIndex
Gets the AutoCAD color index value in the Color object.The index value will be in the range 0 to 256.0 indicates that the entity uses the color of the BlockReference that's displaying it.256 indicates that the entity uses the color specified in the LayerTableRecord it references.

Autodesk.AutoCAD.Colors.Color.Blue
Gets the blue component of the color value in the range 0 to 255.

Autodesk.AutoCAD.Colors.Color.Green
Gets the green component of the color value in the range 0 to 255.

Autodesk.AutoCAD.Colors.Color.Red
Gets the red component of the color value in the range 0 to 255.

Autodesk.AutoCAD.Colors.Color.IsNone
Gets true if the color method is ColorMethod.Null.

Autodesk.AutoCAD.Colors.Color.IsForeground
Gets true if the color method is ColorMethod.Foreground.

Autodesk.AutoCAD.Colors.Color.IsByPen
Gets true if the color method is ColorMethod.ByPen.

Autodesk.AutoCAD.Colors.Color.IsByAci
Gets true if the color method is ColorMethod.ByAci.

Autodesk.AutoCAD.Colors.Color.IsByBlock
Gets true if the color method is ColorMethod.ByBlock.

Autodesk.AutoCAD.Colors.Color.IsByLayer
Gets true if the color method is ColorMethod.ByLayer.

Autodesk.AutoCAD.Colors.Color.IsByColor
Gets true if the color method is ColorMethod.ByColor.

Autodesk.AutoCAD.Colors.Color.Explanation
Gets a copy of the Color object's explanation string.

Autodesk.AutoCAD.Colors.Color.Description
Gets a copy of the Color object's description string.

Autodesk.AutoCAD.Colors.Color.ColorMethod
Gets the color method.

Autodesk.AutoCAD.Colors.Color.ColorValue


Autodesk.AutoCAD.Colors.Color.FromColor(System.Drawing.Color)
Creates a new color object using the input value.
value: Color value.
Returns: A color object created using the input value.

Autodesk.AutoCAD.Colors.Color.FromColorIndex(Autodesk.AutoCAD.Colors.ColorMethod,System.Int16)
Creates a new Color object using the input colorMethod and the input colorIndex.
colorMethod: Color Method.
colorIndex: AutoCAD color index value (0-256) to be used.
Returns: A color object created using the input values.

Autodesk.AutoCAD.Colors.Color.FromRgb(System.Byte,System.Byte,System.Byte)
Creates a new Color object using the input Red, Green, and Blue channel values.
red: Red channel value.
green: Green channel value.
blue: Blue channel value.
Returns: A color object created using the input Red, Green, and Blue channel values.

Autodesk.AutoCAD.Colors.Color.FromDictionaryName(System.String)
Creates a new Color object using the input Dictionary key,name.
name: Dictionary key.
Returns: A new Color object using the input Dictionary key,name.

Autodesk.AutoCAD.Colors.Color.FromNames(System.String,System.String)


Autodesk.AutoCAD.Colors.Color.Equals(System.Object)


Autodesk.AutoCAD.Colors.Color.GetHashCode


Autodesk.AutoCAD.Colors.Color.ToString


Autodesk.AutoCAD.Colors.Color.ToString(System.IFormatProvider)


Autodesk.AutoCAD.Colors.Color.CompareTo(System.Object)


Autodesk.AutoCAD.Colors.Color.Clone


Autodesk.AutoCAD.Colors.Color.DwgIn(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
Reads the Color object's true color information as is, whether or not the major drawing version of inputFiler supports true color.
inputFiler: DWG filer to be used for this filing operation.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.Colors.Color.DwgOut(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
Writes the Color object's true color information as is, whether or not the major drawing version of outputFiler supports true color.
outputFiler: DWG filer to use to write out the object's data.

Autodesk.AutoCAD.Colors.Color.DxfIn(Autodesk.AutoCAD.DatabaseServices.DxfFiler,System.Int32)


Autodesk.AutoCAD.Colors.Color.DxfOut(Autodesk.AutoCAD.DatabaseServices.DxfFiler,System.Int32)


Autodesk.AutoCAD.Colors.Color.Audit(Autodesk.AutoCAD.DatabaseServices.AuditInfo)


Autodesk.AutoCAD.Colors.Color.op_Inequality(Autodesk.AutoCAD.Colors.Color,Autodesk.AutoCAD.Colors.Color)


Autodesk.AutoCAD.Colors.Color.op_Equality(Autodesk.AutoCAD.Colors.Color,Autodesk.AutoCAD.Colors.Color)


Autodesk.AutoCAD.Colors.Color.op_LessThan(Autodesk.AutoCAD.Colors.Color,Autodesk.AutoCAD.Colors.Color)


Autodesk.AutoCAD.Colors.Color.op_GreaterThan(Autodesk.AutoCAD.Colors.Color,Autodesk.AutoCAD.Colors.Color)


Autodesk.AutoCAD.Colors.Color.{dtor}
