Autodesk.AutoCAD.Geometry.KnotCollection
Represents an ordered non-decreasing sequence of numbers used in several spline entities.

Autodesk.AutoCAD.Geometry.KnotCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.KnotCollection.NumberOfIntervals
Gets number of the non-zero length intervals between knots.

Autodesk.AutoCAD.Geometry.KnotCollection.EndParameter
Gets the last knot value.

Autodesk.AutoCAD.Geometry.KnotCollection.StartParameter
Gets the first knot value.

Autodesk.AutoCAD.Geometry.KnotCollection.Tolerance
Gets or sets the equal parameter tolerance of the KnotCollection.

Autodesk.AutoCAD.Geometry.KnotCollection.Count
Gets the length of the KnotCollection.

Autodesk.AutoCAD.Geometry.KnotCollection.Item(System.Int32)


Autodesk.AutoCAD.Geometry.KnotCollection.RemoveAt(System.Int32)
Removes knot specifies by the input index.
index: Index.

Autodesk.AutoCAD.Geometry.KnotCollection.Clear
Removes all the knots of the KnotCollection.

Autodesk.AutoCAD.Geometry.KnotCollection.GetEnumerator


Autodesk.AutoCAD.Geometry.KnotCollection.CopyTo(System.Double[],System.Int32)


Autodesk.AutoCAD.Geometry.KnotCollection.Add(System.Double)
Appends KnotCollection by the input value.
value: New last knot value.
Returns: The index of the value.

Autodesk.AutoCAD.Geometry.KnotCollection.Insert(System.Int32,System.Double)
Inserts the input value at the specified knot index.
index: Insertion index.
value: Value to be inserted.

Autodesk.AutoCAD.Geometry.KnotCollection.Contains(System.Double)
Returns true if the input parameter is between the first knot and the last knot values.
value: Parameter.
Returns: true if the input parameter is between the first knot and the last knot values.

Autodesk.AutoCAD.Geometry.KnotCollection.GetDistinctKnots
Computes a sequence of all knot values from this KnotCollection without repetitions.
Returns: Sequence of pairwise distinct knot values.

Autodesk.AutoCAD.Geometry.KnotCollection.GetMultiplicityAt(System.Int32)
Returns knot multiplicity of the knot value specified by index i. If two consecutive knots differ by less than the equal knot tolerance, they are considered identical and their multiplicities combined.
i: Index.
Returns: Knot multiplicity of the knot value.

Autodesk.AutoCAD.Geometry.KnotCollection.GetInterval(System.Int32,System.Double,Autodesk.AutoCAD.Geometry.Interval@)
Computes the knot interval containing input parameter.
order: Order of a spline.
parameter: Parameter.
interval: Containing knot interval.
Returns: Index of the knot interval.

Autodesk.AutoCAD.Geometry.KnotCollection.IsOn(System.Double)
Returns true if knot is a knot value of this KnotCollection to its tolerance.
knot: Value.
Returns: true if knot is a knot value of this KnotCollection to its tolerance.

Autodesk.AutoCAD.Geometry.KnotCollection.Reverse
Performs a linear transformation on the knot sequence so the first knot is mapped to the maximal value and vice versa. The last knot is mapped to the minimal value.

Autodesk.AutoCAD.Geometry.KnotCollection.SetRange(System.Double,System.Double)
Performs a linear transformation (k?= a * k + b) of the knot sequence in order to place all the values between the lower and upper values.
lower: New lower knot.
upper: New upper knot.

Autodesk.AutoCAD.Geometry.KnotCollection.Split(System.Double,System.Int32,System.Int32)
Splits knot sequence at the specified parameter value. The knot at the end of the first piece and at the beginning of the second piece is inserted or deleted to satisfy the input multiplicity values.
parameter: Split parameter.
multiplicityLast: Multiplicity of the last knot in the head fraction.
multiplicityFirst: Multiplicity of the first knot in the tail fraction.
Returns: The split knot sequence.

Autodesk.AutoCAD.Geometry.KnotCollection.{dtor}
