Autodesk.AutoCAD.Runtime.RXClass
Maintains the run-time information about RXObject classes and their hierarchical relationships.

Autodesk.AutoCAD.Runtime.RXClass.MyParent
Gets the RXClass object associated with the base class of the class that is represented by the RXClass object on which this property is called.

Autodesk.AutoCAD.Runtime.RXClass.ProxyFlags
Gets the value which was set as the third parameter to the RxClass() pseudo-constructor.

Autodesk.AutoCAD.Runtime.RXClass.ClassVersion
Gets the version number.

Autodesk.AutoCAD.Runtime.RXClass.Name
Gets the name of the C++ class represented by this RXClass object.

Autodesk.AutoCAD.Runtime.RXClass.DxfName
Gets the DXF name for the class.

Autodesk.AutoCAD.Runtime.RXClass.AppName
Gets the application name string which is the last parameter to the RXClass() pseudo-constructor.

Autodesk.AutoCAD.Runtime.RXClass.AddX(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.Runtime.RXObject)
Adds the class protocol extension object protocolExtension into the protocol extension object dictionary of this RXClass object.The search key is runtimeClass, which is the RXClass object for the class of runtimeClass. The value is the protocol object runtimeClass.
runtimeClass: RXClass object for the protocol extension class.
protocolExtension: The protocol extension object.
Returns: A pointer to whatever protocol extension object (if any) is already present under the runtimeClass key.

Autodesk.AutoCAD.Runtime.RXClass.GetX(Autodesk.AutoCAD.Runtime.RXClass)
Returns the protocol extension object stored with the key runtimeClass.
runtimeClass: RXClass object for the protocol extension class.
Returns: A pointer to the protocol extension object stored with the key runtimeClass.

Autodesk.AutoCAD.Runtime.RXClass.DelX(Autodesk.AutoCAD.Runtime.RXClass)
Searches the RXClass object's protocol extension dictionary for an entry with the key runtimeClass, and if found, removes the entry.
runtimeClass: RXClass object for the protocol extension class.
Returns: A pointer to the protocol extension object removed.

Autodesk.AutoCAD.Runtime.RXClass.QueryX(Autodesk.AutoCAD.Runtime.RXClass)
Returns the protocol extension object stored with the key runtimeClass.
runtimeClass: RXClass object for the protocol extension class.
Returns: A pointer to the protocol extension object stored with the key runtimeClass.

Autodesk.AutoCAD.Runtime.RXClass.IsDerivedFrom(Autodesk.AutoCAD.Runtime.RXClass)
Returns true if runtimeClass == this or if the class represented by this RXClass object is descended from the class represented by the RXClass object pointed to by runtimeClass.
runtimeClass: RXClass object for the desired base class.
Returns: A pointer to the protocol extension object stored with the key runtimeClass.

Autodesk.AutoCAD.Runtime.RXClass.EntityAlignment


Autodesk.AutoCAD.Runtime.RXClass.{dtor}
