Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData
Supports dynamic dimensions for objects derived from Entity.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.#ctor
Default constructor.This constructor calls DynamicDimensionData(null,false,false).

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.#ctor(Autodesk.AutoCAD.DatabaseServices.Dimension)
Constructor.
dimension: Dimension object to copy into this DynamicDimensionData object.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.#ctor(Autodesk.AutoCAD.DatabaseServices.Dimension,System.Boolean)
Constructor.
dimension: Dimension object to copy into this DynamicDimensionData object.
editable: Boolean indicates whether the DynamicDimensionData object is editable.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.#ctor(Autodesk.AutoCAD.DatabaseServices.Dimension,System.Boolean,System.Boolean)
Constructor.
dimension: Dimension object to copy into this DynamicDimensionData object.
editable: Boolean indicates whether the DynamicDimensionData object is editable.
hideIfValueIsZero: True if the DynamicDimensionData object is always invisible when its value is zero.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.ApplicationData
Gets or sets application-specific data associated with the DynamicDimensionData object.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.HideIfValueIsZero
Gets or sets true if the DynamicDimensionData object is always invisible when its value is zero.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Visible
Gets or sets true if the DynamicDimensionData object is visible.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Editable
Gets or sets true if the DynamicDimensionData object is editable.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Focal
Gets or sets true if the DynamicDimensionData object is the current focus dynamic dimension.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Dimension
Gets or sets the dynamic dimension object.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Create(System.IntPtr,System.Boolean)
Creates a managed DynamicDimensionData object from an unmanaged AcDbDimData pointer. Set autoDelete to true to create an editable object.
unmanagedPointer: An unmanaged AcDbDimData pointer.
autoDelete: True to create an editable object.
Returns: A managed DynamicDimensionData object.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.{dtor}
