Autodesk.AutoCAD.GraphicsInterface.VisualStyle
Defines a Visual Style - a collection of visual properties that can be applied to graphical entities.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.#ctor(Autodesk.AutoCAD.GraphicsInterface.VisualStyleType)
Constructor.
type: The type of visual style to configure.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.VisualStyle.DisplayStyle
Gets or sets the display style of this visual style.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.EdgeStyle
Gets or sets the edge style of this visual style.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.FaceStyle
Gets or sets the face style of this visual style.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.ConfigureForType(Autodesk.AutoCAD.GraphicsInterface.VisualStyleType)
Configures a visual style of the given type.
type: Type to configure for .

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.{dtor}
