Autodesk.AutoCAD.GraphicsSystem.DeviceType
This enumeration defines the device type represented by a PlotConfig object.

Autodesk.AutoCAD.GraphicsSystem.DeviceType.SelectionDevice


Autodesk.AutoCAD.GraphicsSystem.DeviceType.OffScreenDevice


Autodesk.AutoCAD.GraphicsSystem.DeviceType.ScreenDevice
