Autodesk.AutoCAD.DatabaseServices.Handle
Encapsulate the 64-bit integer handle identifiers that have been in AutoCAD for several releases before R13. A handle uniquely identifies a DBObject within a single database and is saved with that object in the database so that it persists from session to session. Handles are not unique across databases, however. In fact, duplication across databases is almost a certainty, since all databases start with the same handseed value of 1 and go up from there.

Autodesk.AutoCAD.DatabaseServices.Handle.#ctor(System.Int64)
Constructs a handle using the input the 64 bit handle value.This constructor is useful for creating null handles.
value: 64 bits of the handle.

Autodesk.AutoCAD.DatabaseServices.Handle.IsOne
Gets true if the handle value in this object is 1.

Autodesk.AutoCAD.DatabaseServices.Handle.Value
For internal use only.

Autodesk.AutoCAD.DatabaseServices.Handle.Equals(System.Object)
Returns true if handle's value is equal to the obj's value.
obj: other handle.
Returns: True if handle's value is equal to the obj's value.

Autodesk.AutoCAD.DatabaseServices.Handle.GetHashCode
Returns the hash code for this object.
Returns: The hash code for this object.

Autodesk.AutoCAD.DatabaseServices.Handle.ToString(System.IFormatProvider)


Autodesk.AutoCAD.DatabaseServices.Handle.ToString


Autodesk.AutoCAD.DatabaseServices.Handle.op_Inequality(Autodesk.AutoCAD.DatabaseServices.Handle,Autodesk.AutoCAD.DatabaseServices.Handle)


Autodesk.AutoCAD.DatabaseServices.Handle.op_Equality(Autodesk.AutoCAD.DatabaseServices.Handle,Autodesk.AutoCAD.DatabaseServices.Handle)
