Autodesk.AutoCAD.DatabaseServices.ShadePlotType
Defines the shade plot mode of the current viewport. This mode specifies how the current viewport will plot.

Autodesk.AutoCAD.DatabaseServices.ShadePlotType.Wireframe
Plot wireframe regardless of display.

Autodesk.AutoCAD.DatabaseServices.ShadePlotType.RenderPreset
Plot using the preferences referenced by the ShadePlotId.

Autodesk.AutoCAD.DatabaseServices.ShadePlotType.VisualStyle
Plot using the visual style settings referenced by ShadePlotId.

Autodesk.AutoCAD.DatabaseServices.ShadePlotType.Rendered
Plot rendered regardless of display.

Autodesk.AutoCAD.DatabaseServices.ShadePlotType.Hidden
Plot hidden regardless of display.

Autodesk.AutoCAD.DatabaseServices.ShadePlotType.AsDisplayed
Plot the same way it is displayed.