Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.DoubleRangeParameter
This class is a container for the near and far distance parameters used by the RenderEnvironment.FogDensity property.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.DoubleRangeParameter.#ctor(System.Double,System.Double)
Constructor.
n: Near distance of the fog effect.
f: Far distance of the fog effect.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.DoubleRangeParameter.Far
Gets far distance of the fog effect.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.DoubleRangeParameter.Near
Gets near distance of the fog effect.