Autodesk.AutoCAD.Geometry.Cone
Represents a bounded right circular cone.

Autodesk.AutoCAD.Geometry.Cone.#ctor(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Interval,System.Double,System.Double)
Constructs a conic segment defined by the input data.
cosineAngle: Cosine of the angle formed by cone generator and its axis.
sineAngle: Sine of the angle formed by cone generator and its axis.
baseOrigin: Center of the circular base.
baseRadius: Radius of the circular base.
axisOfSymmetry: Cone's axis of rotation.
referenceAxis: Reference vector on base.
height: Height of the cone.
startAngle: Start parameter on the base circle.
endAngle: End parameter on the base circle.

Autodesk.AutoCAD.Geometry.Cone.#ctor(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a conic segment defined by the input data.
cosineAngle: Cosine of the angle formed by cone generator and its axis.
sineAngle: Sine of the angle formed by cone generator and its axis.
baseOrigin: Center of the circular base.
baseRadius: Radius of the circular base.
axisOfSymmetry: Cone's axis of rotation.

Autodesk.AutoCAD.Geometry.Cone.Apex
Gets cone's vertex.

Autodesk.AutoCAD.Geometry.Cone.ReferenceAxis
Gets reference vector on the base circle.

Autodesk.AutoCAD.Geometry.Cone.AxisOfSymmetry
Gets the axis of the cone.

Autodesk.AutoCAD.Geometry.Cone.IsOuterNormal
Gets a flag indicating if the cone's normal is pointing out towards the closed cone.

Autodesk.AutoCAD.Geometry.Cone.Height
Gets or sets a range of parameters on the axis corresponding to the points belonging to the cone.

Autodesk.AutoCAD.Geometry.Cone.HalfAngle
Gets angle between the axis and a generator.

Autodesk.AutoCAD.Geometry.Cone.BaseCenter
Gets the center of the base.

Autodesk.AutoCAD.Geometry.Cone.BaseRadius
Gets or sets radius of the base.

Autodesk.AutoCAD.Geometry.Cone.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Cone.GetAngles
Returns as parameters the start and end angles on the cone's base.
Returns: The start and end angles on the cone's base.

Autodesk.AutoCAD.Geometry.Cone.GetHalfAngles
Computes cosine and sine of the angles between the axis and a generator.
Returns: Cosine and sine of the angles between the axis and a generator.

Autodesk.AutoCAD.Geometry.Cone.GetHeightAt(System.Double)
Returns a parameter on the axis corresponding to the input value.
parameter: Parameter on the U axis of the cone's domain.
Returns: A parameter on the axis corresponding to the input value.

Autodesk.AutoCAD.Geometry.Cone.IsClosed
Returns flag indicating if conic segment is a full circular cone.This method calls Cone.IsClosed(Tolerance tolerance) with tolerance set to Global.
Returns: Flag indicating if conic segment is a full circular cone.

Autodesk.AutoCAD.Geometry.Cone.IsClosed(Autodesk.AutoCAD.Geometry.Tolerance)
Returns flag indicating if conic segment is a full circular cone with respect to the tolerance specified by tolerance.
tolerance: Tolerance.
Returns: Flag indicating if conic segment is a full circular cone.

Autodesk.AutoCAD.Geometry.Cone.SetAngles(System.Double,System.Double)
Resets cone's definition parameters to the ones specified by input data.
startAngle: Start parameter on base circle.
endAngle: End parameter on base circle.

Autodesk.AutoCAD.Geometry.Cone.Set(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Interval,System.Double,System.Double)
Resets cone's definition parameters to the ones specified by input data.
cosineAngle: Cosine of the angle formed by cone generator and its axis.
sineAngle: Sine of the angle formed by cone generator and its axis.
baseOrigin: Center of the circular base.
baseRadius: Radius of the circular base.
axisOfSymmetry: Cone's axis of rotation.
refAxis: Reference vector on base.
height: Height of the cone.
startAngle: Start parameter on the base circle.
endAngle: End parameter on the base circle.

Autodesk.AutoCAD.Geometry.Cone.Set(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Resets cone's definition parameters to the ones specified by input data.
cosineAngle: Cosine of the angle formed by cone generator and its axis.
sineAngle: Sine of the angle formed by cone generator and its axis.
baseOrigin: Center of the circular base.
baseRadius: Radius of the circular base.
axisOfSymmetry: Cone's axis of rotation.

Autodesk.AutoCAD.Geometry.Cone.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Computes intersections between the cone and a linear entity.This method calls Cone.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) with tolerance set to Global.
linearEntity: Linear entity.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.Cone.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Computes intersections between the cone and a linear entity.
linearEntity: Linear entity.
tolerance: Tolerance.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.Cone.{dtor}
