Autodesk.AutoCAD.Geometry.Position3d
Represents a point in 3D space.

Autodesk.AutoCAD.Geometry.Position3d.#ctor(System.Double,System.Double,System.Double)
Constructs a 3D position object that has the specified coordinates.
x: X coordinate.
y: Y coordinate.
z: Z coordinate.

Autodesk.AutoCAD.Geometry.Position3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs a 3D position object with the same coordinates as the input point.
point: Any 3D point object.

Autodesk.AutoCAD.Geometry.Position3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Position3d.Set(System.Double,System.Double,System.Double)
Changes the coordinates of the 3D position object to the input coordinates.
x: X coordinate.
y: Y coordinate.
z: Z coordinate.

Autodesk.AutoCAD.Geometry.Position3d.Set(Autodesk.AutoCAD.Geometry.Point3d)
Changes the coordinates of the 3D position object to have the same coordinates as the input point.
point: Any 3D point object.

Autodesk.AutoCAD.Geometry.Position3d.{dtor}
