Autodesk.AutoCAD.DatabaseServices.Shape
Represents the SHAPE entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Shape.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double,System.Double)
Constructs a shape entity with its base parameters as specified by the arguments passed in. In addition, the normal vector for the shape is set to (0,0,1) and the thickness is set to 0.0.
position: Insertion point of the shape, in WCS coordinates.
size: Height of the shape.
rotation: Rotation of the shape.
widthFactor: Width factor of the shape.

Autodesk.AutoCAD.DatabaseServices.Shape.#ctor
Default constructor. The shape's insertion point is set to (0,0,0), the height is set to 0.0, the name is set to null, the rotation is set to 0.0, the widthFactor is set to 0.0, the normal is set to (0,0,1), and the thickness is set to 0.0.

Autodesk.AutoCAD.DatabaseServices.Shape.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Shape.ShapeIndex
This property has been replaced by the new Shape.StyleId property.

Autodesk.AutoCAD.DatabaseServices.Shape.StyleId
Gets or sets the object ID of the font symbol table record containing this shape's SHX font.

Autodesk.AutoCAD.DatabaseServices.Shape.ShapeNumber
Gets or sets  the number of the shape. A shape is stored as a reference to a font, and a character within that font. Essentially a shape is a single character of a special SHX font.

Autodesk.AutoCAD.DatabaseServices.Shape.Normal
Gets or sets the normal vector of the plane containing the shape.The normal vector is in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Shape.Thickness
Gets or sets the thickness of the shape. The thickness is the shape's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.Shape.Oblique
Gets or sets the oblique angle of the shape. The obliquing angle is the angle of slant from the shape's vertical.

Autodesk.AutoCAD.DatabaseServices.Shape.WidthFactor
Gets or sets the width factor (sometimes referred to as the relative X-scale factor).

Autodesk.AutoCAD.DatabaseServices.Shape.Rotation
Gets or sets the rotation angle of the shape. The rotation angle is relative to the X axis of the shape's OCS with positive angles going counterclockwise when looking down the Z axis towards the origin. The OCS X axis is determined by using the shape's normal, the WCS Z axis, and the arbitrary axis algorithm.

Autodesk.AutoCAD.DatabaseServices.Shape.Name
Gets or sets the name of the shape.

Autodesk.AutoCAD.DatabaseServices.Shape.Size
Gets or sets the height of the shape.

Autodesk.AutoCAD.DatabaseServices.Shape.Position
Gets or sets the insertion point of the shape in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Shape.{dtor}
