Autodesk.AutoCAD.LayerManager.LayerFilter.DialogResult
Result values when displaying an editor window for the filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.DialogResult.UseDefault
Displays the default filter dialog.

Autodesk.AutoCAD.LayerManager.LayerFilter.DialogResult.Cancel


Autodesk.AutoCAD.LayerManager.LayerFilter.DialogResult.OK
