Autodesk.AutoCAD.Geometry.CubicSplineCurve3d
Represent an interpolation cubic spline in 3D space.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Constructs a cubic interpolation spline approximating curve with the distance of epsilon.
curve: Generic 3D curve.
epsilon: Approximation tolerance value.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3dCollection,System.Boolean)
Constructs an interpolation cubic spline with an input knot vector going through the fit points and the fit derivatives.
knots: Knot vector.
fitPoints: Interpolating points.
firstDerivatives: Derivatives to be interpolated by periodic.
periodic: Boolean indicating whether the spline is periodic.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an interpolation cubic spline going through the fit points. The constructed spline has start and end derivative specified by the input data.
fitPoints: Interpolating points.
startDerivative: Derivative at the beginning of spline.
endDerivative: Derivative at the end of spline.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an interpolation cubic spline going through the fit points within tolerance specified by the tolerance object. The constructed spline has start and end derivative specified by the input data.
fitPoints: Interpolating points.
startDerivative: Derivative at the beginning of spline.
endDerivative: Derivative at the end of spline.
tolerance: Tolerance object.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection)
Constructs an interpolation cubic spline going through the fit points.
fitPoints: Interpolating points.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an interpolation cubic spline going through the fit points within tolerance specified by the tolerance object. The constructed spline is a closed curve.
fitPoints: Interpolating points.
tolerance: Tolerance object.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.NumberOfFitPoints
Gets number of the spline's fit points.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.FitPointAt(System.Int32)
Returns fitPoint at a given index.
i: Index of a fitPoint point.
Returns: FitPoint at a given index.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets the fit point at the specified index to the input value.
i: Index of a fitPoint point.
point: Fit point.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.FirstDerivativeAt(System.Int32)
Returns the first derivative at the interpolation point specified by its index.
i: Index of an interpolation point.
Returns: The first derivative at the interpolation point specified by its index.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.SetFirstDerivativeAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector3d)
Resets the derivative at the specified index to the input value.
i: Index of a fit point.
derivative: Derivative.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.{dtor}
