Autodesk.AutoCAD.DatabaseServices.Filters.CompositeFilteredBlockIterator
This class is used to process a query on an index.It is used with BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.Filters.CompositeFilteredBlockIterator.Current


Autodesk.AutoCAD.DatabaseServices.Filters.CompositeFilteredBlockIterator.Create(Autodesk.AutoCAD.DatabaseServices.Filters.Filter[],Autodesk.AutoCAD.DatabaseServices.BlockTableRecord)


Autodesk.AutoCAD.DatabaseServices.Filters.CompositeFilteredBlockIterator.Seek(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The Seek method is for internal AutoCAD use.This method will likely be eliminated in the future.
id: ObjectId of the record to seek to.

Autodesk.AutoCAD.DatabaseServices.Filters.CompositeFilteredBlockIterator.MoveNext
This method is used to advance the cursor position.
Returns: True if successful.

Autodesk.AutoCAD.DatabaseServices.Filters.CompositeFilteredBlockIterator.Reset
This method is used to reset the cursor position to the beginning.

Autodesk.AutoCAD.DatabaseServices.Filters.CompositeFilteredBlockIterator.{dtor}
