Autodesk.AutoCAD.DatabaseServices.RowType
Describes the type of table row.

Autodesk.AutoCAD.DatabaseServices.RowType.HeaderRow
Indicates the row immediately following the title row.

Autodesk.AutoCAD.DatabaseServices.RowType.TitleRow
Indicates the top-most or bottom-most row in a table, depending on the whether the table flow direction is down or up.

Autodesk.AutoCAD.DatabaseServices.RowType.DataRow
Indicates a row that is neither title row nor header row.

Autodesk.AutoCAD.DatabaseServices.RowType.UnknownRow
Indicates the uninitialized row type.