Autodesk.AutoCAD.GraphicsInterface.MaterialTraits
Allows material definitions to be expanded to Autodesk.AutoCAD.GraphicsInterface implementations.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Opacity
Gets or sets the opacity component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Refraction
Gets or sets the refraction component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Specular
Gets or sets the specular component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Diffuse
Gets or sets the diffuse component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Mode
Gets or sets the mode of this material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.ChannelFlags
Gets or sets the material channels in use by this material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.IlluminationModel
Gets or sets the illumination model set on this material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Reflectivity
Gets or sets the reflectivity of this material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.SelfIllumination
Gets or sets the sel-illumination value of this material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Translucence
Gets or sets the translucence value of this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Bump
Gets or sets the bump component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Reflection
Gets or sets the reflection component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Ambient
Gets or sets the ambient component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.{dtor}
