Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord
Represent the records found in the DimStyleTable. Each of these records contains the information necessary to generate a specific appearance (that is, text above, in, or below the line; arrows, slashes, or dots at the end of the dimension line, and so on) for dimensions that reference it.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.#ctor
Default constructor. Initializes IsAnonymous to false.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimblk2
Gets or sets the object ID of the block reference that is the current DIMBLK2 value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimblk1
Gets or sets the object ID of the block reference that is the current DIMBLK1 value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimblk
Gets or sets the object ID of the block reference that is the current DIMBLK value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimfxlen
Gets or sets the fixed extension lines value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.DimfxlenOn
Gets or sets a value that indicates whether the fixed extension lines are on for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimpost
Gets or sets the character string that is the current DIMPOST value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimapost
Gets or sets the character string that is the current DIMAPOST value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimzin
Gets or sets the current DIMZIN value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimupt
Gets or sets the current DIMUPT value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtzin
Gets or sets the current DIMTZIN value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtxt
Gets or sets the current DIMTXT value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtxsty
Gets or sets the objectId of the textStyle specified by the current DIMTXSTY value of this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtvp
Gets or sets the current DIMTVP value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtsz
Gets or sets the current DIMTSZ value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtp
Gets or sets the current DIMTP value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtolj
Gets or sets the current DIMTOLJ value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtol
Gets or sets the current DIMTOL value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtoh
Gets or sets the current DIMTOH value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtofl
Gets or sets the current DIMTOFL value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtmove
Gets or sets the current DIMTMOVE value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtm
Gets or sets the current DIMTM value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtix
Gets or sets the current DIMTIX value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtih
Gets or sets the current DIMTIH value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtfillclr
Gets or sets the current dimension background color.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtfill
Gets or sets the dimension background color state.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtfac
Gets or sets the current DIMTFAC value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtdec
Gets or sets the current DIMTDEC value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtad
Gets or sets the current DIMTAD value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsoxd
Gets or sets the current DIMSOXD value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimse2
Gets or sets the current DIMSE2 value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimse1
Gets or sets the current DIMSE1 value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsd2
Gets or sets the current DIMSD2 value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsd1
Gets or sets the current DIMSD1 value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimscale
Gets or sets the current DIMSCALE value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsah
Gets or sets the current DIMSAH value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimrnd
Gets or sets the current DIMRND value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlwe
Gets or sets the current DIMLWE value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlwd
Gets or sets the current DIMLWD value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlunit
Gets or sets the current DIMLUNIT value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimltype
Gets or sets the dimension linetype.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimltex2
Gets or sets the object ID of the linetype of extension line 2.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimltex1
Gets or sets the object ID of the linetype of extension line 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlim
Gets or sets the current DIMLIM value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlfac
Gets or sets the current DIMFAC value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimldrblk
Gets or sets the object ID of the block reference that is the current DIMLDRBLK value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimjust
Gets or sets the current DIMJUST value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimjogang
Gets or sets the current large radial angle.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimgap
Gets or sets the current DIMGAP value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimfrac
Gets or sets the current DIMFRAC value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimexo
Gets or sets the current DIMEXO value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimexe
Gets or sets the current DIMEXE value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimdsep
Gets or sets the current DIMDSEP value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimdli
Gets or sets the current DIMDLI value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimdle
Gets or sets the current DIMDLE value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimdec
Gets or sets the current DIMDEC value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimclrt
Gets or sets the current DIMCLRT value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimclre
Gets or sets the current DIMCLRE value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimclrd
Gets or sets the current DIMCLRD value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimcen
Gets or sets the current DIMCEN value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimazin
Gets or sets the current DIMAZIN value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaunit
Gets or sets the current DIMAUNIT value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimatfit
Gets or sets the current DIMATFIT value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimasz
Gets or sets the current DIMASZ value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimarcsym
Gets or sets the arc length placement value.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaltz
Gets or sets the current DIMALTZ value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaltu
Gets or sets the current DIMALTU value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimalttz
Gets or sets the current DIMALTTZ value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimalttd
Gets or sets the current DIMALTTD value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaltrnd
Gets or sets the current DIMALTRND value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaltf
Gets or sets the current DIMALTF value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaltd
Gets or sets the current DIMALTD value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimalt
Gets or sets the current DIMALT value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimadec
Gets or sets the current DIMADEC value for this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.IsModifiedForRecompute
Gets the modified state of this dimension style.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.GetArrowId(Autodesk.AutoCAD.DatabaseServices.DimArrowFlag)
Returns the object ID of the BlockTableRecord for the arrow specified by whichArrow.
whichArrow: DimArrowFlag specifying the arrow for which the ID should be returned.
Returns: The object ID of the BlockTableRecord for the arrow specified by whichArrow.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.{dtor}
