Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsIntegerRangeParameter
This class is a container for the MentalRayRenderSettingsTraits.Sampling property.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsIntegerRangeParameter.#ctor(System.Int32,System.Int32)


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsIntegerRangeParameter.Max


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsIntegerRangeParameter.Min
