Autodesk.AutoCAD.Geometry.CurveBoundary
Communicates boundary geometry that exists on a bounded surface. In the most general case, each instance of this class consists of four arrays: an array of 3D curve or 3D position pointers, an array of parameter space curve pointers, and two arrays of Booleans. One Boolean array indicates the logical orientation for each 3D curve, and the other indicates the logical orientation for each parameter space curve.

Autodesk.AutoCAD.Geometry.CurveBoundary.#ctor(System.Int32,Autodesk.AutoCAD.Geometry.Curve3d[],Autodesk.AutoCAD.Geometry.Curve2d[],System.Boolean,System.Boolean)
Constructor for creating an instance of curve boundary from arrays of curves and logical orientation data.
numberOfCurves: Number of elements in the curve boundary.
curve3d: Array of 3D space geometry of each element of curve boundary.
curve2d: Array of parameter space geometry elements of curve boundary.
orientation3d: Logical orientation applicable to each element of 3dGeometry.
orientation2d: Logical orientation applied to each element of paramGeometry.

Autodesk.AutoCAD.Geometry.CurveBoundary.IsOwnerOfCurves
Gets true if the curve boundary representation data is owned by this instance.

Autodesk.AutoCAD.Geometry.CurveBoundary.Contour
Gets or sets the representation information concerning the curve boundary.

Autodesk.AutoCAD.Geometry.CurveBoundary.NumElements
Gets the number of elements of a curve boundary.

Autodesk.AutoCAD.Geometry.CurveBoundary.DegenerateCurve
Gets space curve that evaluates to 3D space point for a degenerate curve boundary.

Autodesk.AutoCAD.Geometry.CurveBoundary.DegeneratePosition
Gets 3D space point for a degenerate curve boundary.

Autodesk.AutoCAD.Geometry.CurveBoundary.IsDegenerate
Gets true if the curve boundary consists of a single element and it is degenerate to a single 3D space point.

Autodesk.AutoCAD.Geometry.CurveBoundary.Clone


Autodesk.AutoCAD.Geometry.CurveBoundary.Set(System.Int32,Autodesk.AutoCAD.Geometry.Entity3d[],Autodesk.AutoCAD.Geometry.Curve2d[],System.Boolean,System.Boolean)
Resets the definition of an instance of this class.
numElements: Number of elements in curve boundary.
curve3ds: Array of 3D space geometry of each element of curve boundary.
curve2ds: Array of parameter space geometry of each element of curve boundary.
orientation3d: Logical orientation applicable to each element of 3dGeometry.
orientation2d: Logical orientation applied to each element of paramGeometry.

Autodesk.AutoCAD.Geometry.CurveBoundary.{dtor}
