Autodesk.AutoCAD.DatabaseServices.DictionaryWithDefaultDictionary
This class enhances the DBDictionary class by adding the concept of a default entry. Each DictionaryWithDefaultDictionary has a HardPointerId data member that is used to store the object ID of one of its entries. This hard pointer ID is used as the default entry. Property is provided for accessing this hard pointer.

Autodesk.AutoCAD.DatabaseServices.DictionaryWithDefaultDictionary.#ctor
Default constructor. Initializes the HardPointerId default member to the same value as ObjectId.Null.

Autodesk.AutoCAD.DatabaseServices.DictionaryWithDefaultDictionary.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DictionaryWithDefaultDictionary.ObjectBirthVersion
Gets information which allows the implementation code for DictionaryWithDefaultDictionary and its base classes to tell what version of those classes were actually used to file out the object's data. This information is most important when dealing with roundtrip situations to/from older DWG file formats.

Autodesk.AutoCAD.DatabaseServices.DictionaryWithDefaultDictionary.DefaultId
Gets or sets the object ID that is the default entry for the dictionary.

Autodesk.AutoCAD.DatabaseServices.DictionaryWithDefaultDictionary.{dtor}
