Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsSamplingParameter
This class is a container for the MentalRayRenderSettingsTraits.SamplingFilter property.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsSamplingParameter.#ctor(Autodesk.AutoCAD.GraphicsInterface.Filter,System.Double,System.Double)


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsSamplingParameter.Filter


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsSamplingParameter.Height


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsSamplingParameter.Width
