Autodesk.AutoCAD.DatabaseServices.ImageBackground
Represents a background image.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.ImageBackground.Scale
Gets or sets the scale value for the X and Yaxis. Scale value can range from 0.1 to 10.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.Offset
Gets or sets the image offset property. Offset values can range from -1 to 1 on either axis (X or Y).

Autodesk.AutoCAD.DatabaseServices.ImageBackground.UseTiling
Gets or sets the value of the image tiling property.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.MaintainAspectRatio
Gets or sets the value indicating the use of aspect ratio of the image file.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.FitToScreen
Gets or sets a value indicating if image background needs to be fit to the screen or not.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.ImageFileName
Gets or sets the image file name associated with this background.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.{dtor}
