Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDoubleRangeParameter
This class is a container for the MentalRayRenderSettingsTraits.FGSampleRadius property.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDoubleRangeParameter.#ctor(System.Double,System.Double)


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDoubleRangeParameter.Max


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsDoubleRangeParameter.Min
