Autodesk.AutoCAD.GraphicsInterface.FaceData
This class is a container for the optional data that can be specified for a set of faces in a mesh or shell graphics primitive. An object of this class is passed as an argument to the mesh and shell methods of the Geometry classes.

Autodesk.AutoCAD.GraphicsInterface.FaceData.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetColors(System.Int16[])
Sets colors to be the array of face color indices used by the FaceData object.
colors: Array of AutoCAD color indices.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetTrueColors(Autodesk.AutoCAD.Colors.EntityColor[])
Sets the array of face color used by the FaceData object.
colors: Array of AutoCAD EntityColor objects.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetLayers(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets layers to be the array of LayerTableRecord object IDs used by the FaceData object.
layers: Array of LayerTableRecord Object IDs.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetNormalVectors(Autodesk.AutoCAD.Geometry.Vector3d[])
Sets normal to be the array of face normal vectors used by the FaceData object.
normal: Array of normal vectors.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetVisibility(System.Byte[])
Sets visibility to be the array of face visibility flags used by the FaceData object.
visibility: Array of visibility flags.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetColors
Gets an array of AutoCAD color indices, one for each face in the mesh or shell the FaceData object is used with.
Returns: An array of AutoCAD color indices.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetLayers
Gets an array of LayerTableRecord Object IDs, one for each face in the mesh or shell the FaceData object is used with.
Returns: An array of LayerTableRecord Object IDs.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetSelectionMarkers
Gets an array of graphic system selection markers (gsmarkers), one for each face in the mesh or shell the FaceData object is used with.
Returns: An array of graphic system selection markers.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetSelectionMarkers(System.Int32[])
Sets selectionMarker to be the array of graphics system selection markers, or gsmarkers, used by this object.
selectionMarker: Array of non-zero graphic system selection markers.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetNormalVectors
Gets an array of normal vectors, one for each face in the mesh or shell the FaceData object is used with.
Returns: An array of normal vectors.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetTrueColors
Gets an array of EntityColor objects: one for each face in the mesh or shell with which the object is used.
Returns: An array of EntityColor objects.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetVisibility
Gets an array of visibility flags (that is, 0 == invisible, 1 == visible), one for each face in the mesh or shell the FaceData object is used with.
Returns: An array of visibility flags.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetMaterials(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets materials to the array of face materials used by the FaceData object.
materials: An array of materials to be set on the FaceData object.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetMaterials
Gets the array of materials assigned to the FaceData object.
Returns: The array of materials assigned to the FaceData object.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetMappers(Autodesk.AutoCAD.GraphicsInterface.Mapper[])
Sets mappers to be the array of face mappers used by the FaceData object.
mappers: Face mappers to be set on the FaceData object.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetMappers
Gets the array of mappers assigned to the FaceData object.
Returns: The array of mappers assigned to the FaceData object.