Autodesk.AutoCAD.GraphicsInterface.CommonDraw
Abstracts out the commonality between ViewportDraw and WorldDraw. This allows graphics routines to be coded in terms of CommonDraw that will work in either case. To maintain their original signatures, WorldDraw and ViewportDraw now derive from AcGiCommonDraw.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.NumberOfIsolines
Gets the suggested number of isolines to use to represent the entity.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.IsDragging
Gets true if the entity is currently being dragged.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.Context
Gets the controlling context.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.RawGeometry
Gets the current geometry class as a Geometry.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.SubEntityTraits
Gets a reference to the SubEntityTraits object.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.RegenAbort
Gets true if an immediate clean up and return should be accomplished.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.RegenType
Gets the current elaboration mode.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.Deviation(Autodesk.AutoCAD.GraphicsInterface.DeviationType,Autodesk.AutoCAD.Geometry.Point3d)
Returns the recommended maximum tessellation deviation of the type specified by deviationType.
deviationType: Desired deviation type.
pointOnCurve: Returns a point locating curve or surface to be tessellated.
Returns: The recommended maximum tessellation deviation of the type.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.{dtor}
