Autodesk.AutoCAD.DatabaseServices.BlockTableRecord
Objects of the BlockTableRecord class are used as containers for entities within drawing file databases. BlockTableRecord objects (often referred to as BTRs) are owned by the database's BlockTable object. The BTRs in turn own the entity objects they contain.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.#ctor
Default constructor. Initializes the origin to (0,0,0); the IsAnonymous, HasAttributeDefinitions, IsFromExternalReference, and IsFromOverlayReference flags to false; and the PathName to null. In addition, the SymbolTableRecord default constructor is invoked.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.ModelSpace
ModelSpace BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.PaperSpace
PaperSpace BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IncludingErased
Gets the IncludingErased property value.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Units
Gets or sets the INSUNITS value saved with the block table record.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsDynamicBlock
Gets whether the BlockReference passed to the class constructor contains dynamic block information.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.BlockScaling
Gets or sets whether block references associated with this block table record can be uniformly or nonuniformly scaled.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Explodable
Gets or sets whether block references associated with this block table record can be exploded.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.DrawOrderTableId
Gets the Object Id of the sortents table opened as requested, sparing the caller the work of getting the extension dictionary and looking the sortents dictionary up in it. If the dictionary is successfully opened and returned, it is the caller's responsibility to close it.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.XrefStatus
Gets an XrefStatus enumerated type value indicating the xref status of the block table record on which this property is called.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsUnloaded
Gets or sets true if this block table record is an xref that is currently unloaded; otherwise, it gets or sets false.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.LayoutId
Gets or sets the forward pointer from the block table record to the corresponding Layout object in the Layouts dictionary.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsLayout
Gets true if this block table record represents a layout.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsFromOverlayReference
Gets true if this block table record is an overlaid xref. Otherwise, if IsFromExternalReference gets true, the block table record is an attached xref.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsFromExternalReference
Gets true if the block table record is describing an xref drawing.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsAnonymous
Gets true if the block table record is anonymous.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.PreviewIcon
This method is not implemented in this release.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.HasPreviewIcon
Gets true if the block table record has a preview icon. Otherwise, it gets false.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.HasAttributeDefinitions
Gets true if the block table record contains attribute definitions.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.BlockEndId
Gets the Object Id of the BlockEnd object.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.BlockBeginId
Gets the Object Id of the BlockBegin object.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Origin
Gets or sets the base point of the block in WCS coordinates. This point is the origin of the MCS (which is the local WCS for the entities within the block table record).

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.PathName
Gets or sets copy of path name string.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Comments
Gets or sets a copy of the description text associated with the BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.SkipDeleted


Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Copy


Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetEnumerator
Creates a BlockTableRecordEnumerator object that can be used to iterate over the entities in the block table record.
Returns: Newly created iterator.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.AppendEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
Adds entity to the database and the block table record.
entity: Entity to append (must not be null).
Returns: The object ID of the appended entity.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetBlockReferenceIds(System.Boolean,System.Boolean)
Returns a list of BlockReferences that either directly or indirectly, through block nesting, reference this block. It only returns those block references that are currently active.
directOnly: Boolean indicating that only those BlockReferences that directly refer to this BlockTableRecord should be included in the IDs. If this value is true and the block is nested, the parent block's references will not be included.
forceValidity: Boolean indicating that older drawings which have been demand loaded should be loaded completely, in order to find their BlockReferenceIds. This is because older drawings did not store this information. This parameter is only applicable if directOnly is false.
Returns: ObjectIdCollection of BlockReference's ObjectIds found that reference this BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetErasedBlockReferenceIds
Returns a list of BlockReferences that directly reference this block. It only returns those block references that have been erased.
Returns: ObjectIdCollection of erased BlockReference's ObjectIds found that reference this BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetXrefDatabase(System.Boolean)
Returns the Database that defines this block table record's contents.
incrementUnresolved: Bool indicating whether or not to return a pointer to the database of an unresolved xref.
Returns: The Database that defines this block table record's contents.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.AssumeOwnershipOf(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This method causes the invoked block table record to assume the ownership of all the entities listed in the input entitiesToMove array, and provides an optimized way of moving entities between block table records.
entitiesToMove: Array of entities to change ownership of.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.{dtor}
