Autodesk.AutoCAD.DatabaseServices.XrefStatus


Autodesk.AutoCAD.DatabaseServices.XrefStatus.Unresolved


Autodesk.AutoCAD.DatabaseServices.XrefStatus.FileNotFound


Autodesk.AutoCAD.DatabaseServices.XrefStatus.Unreferenced


Autodesk.AutoCAD.DatabaseServices.XrefStatus.Unloaded


Autodesk.AutoCAD.DatabaseServices.XrefStatus.Resolved


Autodesk.AutoCAD.DatabaseServices.XrefStatus.NotAnXref
