Autodesk.AutoCAD.DatabaseServices.Solid
The Solid class is the representation for the SOLID entity within AutoCAD. The SOLID entity is a 2D entity, not the 3D solids that are represented by the Solid3d and Body classes.

Autodesk.AutoCAD.DatabaseServices.Solid.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor uses pointer1-pointer3 as the first three points for the solid and then uses pointer3 as the fourth point as well. All points must be in WCS coordinates. The normal vector is initialized to (0,0,1) and the thickness is set to 0.0.
pointer1: First point (in WCS) for solid.
pointer2: Second point (in WCS) for solid.
pointer3: Third point (in WCS) for solid.

Autodesk.AutoCAD.DatabaseServices.Solid.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor uses pointer1-pointer4 as the four points for the solid. All points must be in WCS coordinates. The normal vector is initialized to (0,0,1) and the thickness is set to 0.0.
pointer1: First point (in WCS) for solid.
pointer2: Second point (in WCS) for solid.
pointer3: Third point (in WCS) for solid.
pointer4: Fourth point (in WCS) for solid.

Autodesk.AutoCAD.DatabaseServices.Solid.#ctor
Default constructor. Initializes points 0-3 to (0,0,0), the normal vector to (0,0,1), and the thickness to 0.0.

Autodesk.AutoCAD.DatabaseServices.Solid.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Solid.Normal
Gets or sets the unit normal vector of the plane containing the solid.

Autodesk.AutoCAD.DatabaseServices.Solid.Thickness
Gets or sets the thickness of the solid. The thickness is the shape's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.Solid.GetPointAt(System.Int16)
Gets the value of the point in the solid whose index is index. index can have a value of 0, 1, 2, or 3, depending on which point is desired (that is, 0 for the first point, 1 for the second point, etc.). If there are only three corners on the solid, then the points with indices 2 and 3 will have the same value. The returned point will be in WCS coordinates.
index: Index (0-3) of the desired point in the solid.
Returns: Value of the desired point.

Autodesk.AutoCAD.DatabaseServices.Solid.SetPointAt(System.Int16,Autodesk.AutoCAD.Geometry.Point3d)
sets the index'th point in the solid to the value pointValue. index must be 0, 1, 2, or 3. pointValue must be in WCS coordinates.
index: Index (0-3) of the point to set in the solid.
pointValue: point value.

Autodesk.AutoCAD.DatabaseServices.Solid.{dtor}
