Autodesk.AutoCAD.GraphicsSystem.DriverInfo.#ctor(System.Boolean,System.String,System.String)
Constructor.
hardwareAccelerated: Sets whether this driver supports hardware acceleration.
path: Full path to the driver file.
driver: Name of the driver file.

Autodesk.AutoCAD.GraphicsSystem.DriverInfo.#ctor(System.String,System.String)
Constructor.
path: Full path to the driver file.
driver: Name of the driver file.

Autodesk.AutoCAD.GraphicsSystem.DriverInfo.Driver
Gets driver file name.

Autodesk.AutoCAD.GraphicsSystem.DriverInfo.Path
Gets full path to the driver file.

Autodesk.AutoCAD.GraphicsSystem.DriverInfo.HardwareAccelerated
Gets a boolean indicating whether this driver supports hardware acceleration.