Autodesk.AutoCAD.GraphicsSystem.Quality
This enumeration contains values for adjusting the transparency in order to improve image quality. The choice of transparency type affects the redraw time. Materials must be enabled for transparency to be turned on.

Autodesk.AutoCAD.GraphicsSystem.Quality.HighQuality
This setting maximizes display quality at the expense of display performance. At the High Quality setting, blending and extra processing produce an image free of visual artifacts at the cost of drawing speed.

Autodesk.AutoCAD.GraphicsSystem.Quality.MediumQuality
This setting balances display performance and display quality. At the Medium Quality setting, blending improves image quality.

Autodesk.AutoCAD.GraphicsSystem.Quality.LowQuality
This setting maximizes display performance at the expense of display quality. At the Low Quality setting, a screen-door effect achieves transparency without sacrificing speed.