Autodesk.AutoCAD.GraphicsInterface.ImageTexture
Represents an image based texture. This class is abstract.

Autodesk.AutoCAD.GraphicsInterface.ImageTexture.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.ImageTexture.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.ImageTexture.{dtor}
