Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2
Represents the angular dimension defined by two lines (as opposed to three points) within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor uses the parameters passed in to initialize the dimension. In addition, the rest of the Dimension,Entity, and others, default constructor initializations are performed.
line1Start: Start point (in WCS coordinates) of first extension line.
line1End: End point (in WCS coordinates) of first extension line.
line2Start: Start point (in WCS coordinates) of second extension line.
line2End: End point (in WCS coordinates) of second extension line.
arcPoint: Point that will be on the dimension arc.
dimensionText: Text string to use as the dimension annotation.
dimensionStyle: Object ID of dimension style table record to use as the dimension style.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.#ctor
Default constructor. Initializes the arc point and the extension line 1 and 2 start and end points all to (0,0,0). In addition, all the initializations of the default constructor for Dimension,Entity, etc., are performed.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.XLine2End
Gets or sets the dimension definition point (in WCS coordinates) that is used for the end point of the second extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.XLine2Start
Gets or sets the dimension definition point (in WCS coordinates) that is used for the start point of the second extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.XLine1End
Gets or sets the dimension definition point (in WCS coordinates) that is used for the end point of the first extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.XLine1Start
Gets or sets the dimension definition point (in WCS coordinates) that is used for the start point of the first extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.ArcPoint
Gets or sets the dimension definition point (in WCS coordinates) that is used to determine the location of the arc of the dimension.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.{dtor}
