Autodesk.AutoCAD.GraphicsInterface.DiagnosticGridMode
The available coordinate systems to use for the diagnostic grid.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticGridMode.Camera
Camera-space (view-space) coordinate system.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticGridMode.World
World-space coordinate system.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticGridMode.Object
Object-space coordinate system.