Autodesk.AutoCAD.DatabaseServices.ParseOption
For internal use only.

Autodesk.AutoCAD.DatabaseServices.ParseOption.PreserveMtextFormat
Preserve mtext format in the current format string if the text to be parsed does not have mtext format. If the text has mtext format then it will override the mtext format in the current format string.

Autodesk.AutoCAD.DatabaseServices.ParseOption.SetDefaultFormat
Assign default format based on the data type of the parsed value.

Autodesk.AutoCAD.DatabaseServices.ParseOption.ParseOptionNone
Use default parsing.