Autodesk.AutoCAD.DatabaseServices.CollisionType
CollisionType.

Autodesk.AutoCAD.DatabaseServices.CollisionType.Solid
This entity behaves as a solid object during collision detection.

Autodesk.AutoCAD.DatabaseServices.CollisionType.None
This entity does not participate in collision detection.