Autodesk.AutoCAD.DatabaseServices.HatchEdgeType
Lists the geometry types used in hatch boundary edges.

Autodesk.AutoCAD.DatabaseServices.HatchEdgeType.Spline
Spline curve edge.

Autodesk.AutoCAD.DatabaseServices.HatchEdgeType.EllipticalArc
Elliptical edge.

Autodesk.AutoCAD.DatabaseServices.HatchEdgeType.CircularArc
Circular edge.

Autodesk.AutoCAD.DatabaseServices.HatchEdgeType.Line
Linear edge.