Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator
Enumerates the properties in a DynamicBlockReferencePropertyCollection.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.#ctor(Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection)


Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.Current
Gets the Current property value.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.MoveNext
Moves the current pointer to the next item, or to the end marker if the current item is at the end of the collection.
Returns: Object array that upon a successful return is populated with the allowed property values.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.Reset
Resets the current pointer to the first item in the collection.