Autodesk.AutoCAD.GraphicsSystem.Device
Device is an abstraction of a drawing surface and encapsulates the underlying device to which graphics are rendered.

Autodesk.AutoCAD.GraphicsSystem.Device.#ctor(System.IntPtr,Autodesk.AutoCAD.GraphicsSystem.DeviceType)


Autodesk.AutoCAD.GraphicsSystem.Device.#ctor(System.IntPtr)


Autodesk.AutoCAD.GraphicsSystem.Device.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsSystem.Device.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsSystem.Device.DeviceRenderType
Gets or sets the RendererType this object is currently set to use.

Autodesk.AutoCAD.GraphicsSystem.Device.BackgroundColor
Gets or sets the current background color of the device.

Autodesk.AutoCAD.GraphicsSystem.Device.IsValid
Gets or sets true when the device has the correct picture (no invalid flags or regions, no rasterization left to perform, and the rendering pipeline has been fully flushed of any queued drawing commands).

Autodesk.AutoCAD.GraphicsSystem.Device.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsSystem.Device.Invalidate(System.Drawing.Rectangle)
Tells the device to invalidate the region specified by the passed in rectangle. The device must keep track of these invalid regions. This is typically used to communicate expose events; as above, re-rasterization is not required unless the device does not have backing store.
rect: Rectangle of region to be invalidated.

Autodesk.AutoCAD.GraphicsSystem.Device.Update(System.Drawing.Rectangle)
This message is propagated to all owned GraphicsSystem.Views, and it forces the correct picture to be displayed by the GS.
updatedRect: Rectangle that receives the updated region.

Autodesk.AutoCAD.GraphicsSystem.Device.Update
This message is propagated to all owned GraphicsSystem.Views, and it forces the correct picture to be displayed by the GS.

Autodesk.AutoCAD.GraphicsSystem.Device.OnSize(System.Drawing.Size)


Autodesk.AutoCAD.GraphicsSystem.Device.OnDisplayChange(System.Int32,System.Int32,System.Int32)
Tells the device that the Operating System Color Depth and/or Screen Resolution has changed, with the arguments being the new number of bits per pixel and the X and Y resolution, respectively.
bitsPerPixel: New number of bits per pixel.
xRes: X resolution.
yRes: Y resolution.

Autodesk.AutoCAD.GraphicsSystem.Device.Add(Autodesk.AutoCAD.GraphicsSystem.View)
Adds a view to be displayed on the device.
view: View to be displayed on the device.
Returns: true if the view was successfully added to the device.

Autodesk.AutoCAD.GraphicsSystem.Device.Erase(Autodesk.AutoCAD.GraphicsSystem.View)
Removes the view defined by view from the device.
view: View to be removed from the device.
Returns: true if the view was successfully removed from the device.

Autodesk.AutoCAD.GraphicsSystem.Device.SetLogicalPalette(System.Drawing.Color[])
AutoCAD sets the logical palette to the ACI color index values. The logical palette may very well not be the physical palette (if any) in use by the underlying hardware.
palette: An array of logical palette colors.

Autodesk.AutoCAD.GraphicsSystem.Device.SetPhysicalPalette(System.Drawing.Color[])
Specifies a physical palette. It should be used in conjunction with off-screen devices.
palette: Array of Color objects that constitute the palette.

Autodesk.AutoCAD.GraphicsSystem.Device.GetSnapshot(System.Drawing.Rectangle)
Gets a snapshot of the current graphics state of the device.
rectangle: The region of the snapshot.
Returns: A snapshot of the current graphics state of the device.

Autodesk.AutoCAD.GraphicsSystem.Device.DeleteUnmanagedObject


Autodesk.AutoCAD.GraphicsSystem.Device.{dtor}
