Autodesk.AutoCAD.DatabaseServices.FormatOption
For internal use only.

Autodesk.AutoCAD.DatabaseServices.FormatOption.IgnoreMtextFormat
Don't include the mtext format in the formatted text.

Autodesk.AutoCAD.DatabaseServices.FormatOption.UseMaximumPrecision
Use maximum precision for the value.

Autodesk.AutoCAD.DatabaseServices.FormatOption.ForExpression
Format the value for using it in an expression. It will use maximum precision.

Autodesk.AutoCAD.DatabaseServices.FormatOption.ForEditing
Format the value for editing. It will use maximum precision.

Autodesk.AutoCAD.DatabaseServices.FormatOption.FormatOptionNone
Use default formatting.