Autodesk.AutoCAD.DatabaseServices.SelectType
The selection type for a table cell.

Autodesk.AutoCAD.DatabaseServices.SelectType.Crossing
Indicates a cross selection type.

Autodesk.AutoCAD.DatabaseServices.SelectType.Window
Indicates a window selection type.