Autodesk.AutoCAD.Geometry.CircularArc3d
Represents both full circles and circular arcs in 3D space.

Autodesk.AutoCAD.Geometry.CircularArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs an arc through three points. None of the three points may be coincindent and they may not be colinear.
startPoint: Start point of arc.
pointOnArc: Point on arc.
endPoint: Endpoint of arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
Constructs a circular arc with the specified center, normal vector, radius, start angle, and end angle.
center: Center of arc.
normal: Normal vector of arc.
referenceVector: Reference vector from which arc angles are measured.
radius: Radius of arc.
startAngle: Angle of start point of arc.
endAngle: Angle of endpoint of arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Constructs a full circle with the given center, normal vector, and radius. The radius must not be 0. The constructed circle is oriented counterclockwise about the normal vector.
center: Center of arc.
normal: Normal vector of arc.
radius: Radius of arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.EndPoint
Gets endpoint of the arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.StartPoint
Gets startPoint of the arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.EndAngle
Gets angle of the endpoint of the arc with respect to the reference vector.

Autodesk.AutoCAD.Geometry.CircularArc3d.StartAngle
Gets angle of the start point of the arc with respect to the reference vector.

Autodesk.AutoCAD.Geometry.CircularArc3d.Radius
Gets or sets the radius of the arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.ReferenceVector
Gets or sets the reference vector of the arc. The reference vector is the vector from which the start and end angles of the arc are measured. This property is always a unit vector.

Autodesk.AutoCAD.Geometry.CircularArc3d.Normal
Gets or sets the normal vector of the arc. The arc is oriented in a counterclockwise direction about this vector. This property is always a unit vector.

Autodesk.AutoCAD.Geometry.CircularArc3d.Center
Gets or sets the center point of the arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.Create(System.IntPtr,System.Boolean)
Creates a new CircularArc3d object from an unmanaged AcGeCircArc3d pointer.
unmanagedPointer: Unmanaged AcGeCircArc3d pointer.
autoDelete: If true, the system automatically deletes the underlying object when it is no longer used by the wrapper.
Returns: CircularArc3d object from an unmanaged AcGeCircArc3d pointer.

Autodesk.AutoCAD.Geometry.CircularArc3d.ClosestPointToPlane(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns the point on this arc that is closest to the given plane.This method calls CircularArc3d.ClosestPointToPlane(PlanarEntity plane, Tolerance tolerance) with tolerance set to Global.
plane: Plane.
Returns: The point on this arc that is closest to the given plane.

Autodesk.AutoCAD.Geometry.CircularArc3d.ClosestPointToPlane(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the point on this arc that is closest to the given plane.
plane: Plane.
tolerance: Tolerance.
Returns: The point on this arc that is closest to the given plane.

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity)
Determines if the input plane intersects this arc.This method calls CircularArc3d.IntersectWith(PlanarEntity plane, Tolerance tolerance) with tolerance set to Global.
plane: Any plane.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input plane intersects this arc.
plane: Any plane.
tolerance: Tolerance for tangent intersections.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.CircularArc3d)
Determines if the input arc intersects this arc.This method calls CircularArc3d.IntersectWith(CircularArc3d arc, Tolerance tolerance) with tolerance set to Global.
arc: Any 3D arc.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.CircularArc3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input arc intersects this arc.
arc: Any 3D arc.
tolerance: Tolerance for tangent intersections.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Determines if the input line intersects the arc.This method calls CircularArc2d.IntersectWith(LinearEntity3d line, Tolerance tolerance) with tolerance set to Global.
line: Any 3D linear entity.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input line intersects the arc.
line: Any 3D linear entity.
tolerance: Tolerance for tangent intersections.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d)
Finds the points on the arc and line that project into the same point when projected onto a plane whose normal is projectionDirection.This method calls CircularArc3d.ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance) with tolerance set to Global.
line: Any 3D linear entity.
projectionDirection: Drection of projection.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the points on the arc and line that project into the same point when projected onto a plane whose normal is projectionDirection.
line: Any 3D linear entity.
projectionDirection: Drection of projection.
tolerance: Tolerance.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.CircularArc3d.GetTangent(Autodesk.AutoCAD.Geometry.Point3d)
Gets the tangent line to the circle at the input point if the input point lies on the full circle of the arc.This method calls CircularArc3d.GetTangent(Point3d point, Tolerance tolerance) with tolerance set to Global.
point: Point on full circle.
Returns: Tangent line.

Autodesk.AutoCAD.Geometry.CircularArc3d.GetTangent(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Gets the tangent line to the circle at the input point if the input point lies on the full circle of the arc.
point: Point on full circle.
tolerance: Tolerance.
Returns: Tangent line.

Autodesk.AutoCAD.Geometry.CircularArc3d.GetPlane
Returns the infinite plane in which the arc lies.
Returns: The infinite plane in which the arc lies.

Autodesk.AutoCAD.Geometry.CircularArc3d.IsInside(Autodesk.AutoCAD.Geometry.Point3d)
Treats the arc as a full circle even if it is bounded, and determines if the input point lies inside the full circle.This method calls CircularArc3d.IsInside(Point3d point, Tolerance tolerance) with tolerance set to Global.
pointValue: Any 3D point.
Returns: true if the input point lies inside the full circle.

Autodesk.AutoCAD.Geometry.CircularArc3d.IsInside(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Treats the arc as a full circle even if it is bounded, and determines if the input point lies inside the full circle.
point: Any 3D point.
tolerance: Tolerance.
Returns: true if the input point lies inside the full circle.

Autodesk.AutoCAD.Geometry.CircularArc3d.SetAxes(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes the normal vector and reference vector of the arc to the specified vectors. The two input vectors must be perpendicular to each other.
normal: Normal vector of arc.
referenceVector: Reference vector of arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.SetAngles(System.Double,System.Double)
Changes the start and endpoints of the arc to have the specified angles.
startAngle: Start angle of arc.
endAngle: End angle of arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double,System.Double)
Changes the definition of the arc to be tangent to the three input curves.
curve1: Any 3D curve.
curve2: Any 3D curve.
curve3: Any 3D curve.
param1: Parameter value on curve1 where arc touches curve.
param2: Parameter value on curve2 where arc touches curve.
param3: Parameter value on curve3 where arc touches curve.

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double,System.Double)
Changes the definition of the arc to be tangent to the two input curves and have the specified radius.
curve1: Any 3D curve.
curve2: Any 3D curve.
radius: Radius of arc.
param1: Parameter value on curve1 where arc touches curve.
param2: Parameter value on curve2 where arc touches curve.

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes the definition of the arc to have the specified start and endpoints and pass through point. None of the three points may be coincindent and they may not be colinear.
startPoint: Start point of arc.
pointOnArc: Point on arc.
endPoint: Endpoint of arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
Changes the definition of the arc to have the specified center, normal vector, radius, start angle, and end angle.
center: Center of arc.
normal: Normal vector of arc.
referenceVector: Reference vector from which arc angles are measured.
radius: Radius of arc.
startAngle: Angle of start point of arc.
endAngle: Angle of endpoint of arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Changes the arc definition to be a full circle with the given center, normal vector, and radius.
center: Center of arc.
normal: Normal vector of arc.
radius: Radius of arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.{dtor}
