Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo
A pure virtual class for encapsulating a set of character strings that can be used to add additional information to a DWG file.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.CustomProperties
Gets the key and value of the custom field.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.HyperlinkBase
Gets the value of the hyperlink base path field. The value will be null if no path has been set.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.RevisionNumber
Gets the value of the revision number field.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.LastSavedBy
Gets the login name of the user to last save this database by using the LOGINNAME sysvar, or null if it has not been setthe value of the revision number field.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Comments
Gets the value of the comments field.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Keywords
Gets the value of the keywords field.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Author
Gets the value of the author field.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Subject
Gets the value of the subject field.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Title
Gets the value of the title field.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj: System.Object object.
Returns: True if this object is identical to the argument object.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.GetHashCode
Returns the hash code for this object.
Returns: The hash code for this object.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: System.IFormatProvider object.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.op_Inequality(Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo,Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo)


Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.op_Equality(Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo,Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo)
