Autodesk.AutoCAD.DatabaseServices.ProxyResurrectionCompletedEventArgs
Provides data for the ProxyResurrectionCompleted event of the database.

Autodesk.AutoCAD.DatabaseServices.ProxyResurrectionCompletedEventArgs.Ids
Gets object IDs of the objects that were resurrected.

Autodesk.AutoCAD.DatabaseServices.ProxyResurrectionCompletedEventArgs.ApplicationName
Gets the name of the application that registered the custom object.