Autodesk.AutoCAD.Geometry.Plane
Represents a parameterized infinite plane in 3D space.

Autodesk.AutoCAD.Geometry.Plane.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructor. Constructs the plane satisfying the equation:a*x + b*y + c*z + d = 0.
a: Coordinate a.
b: Coordinate b.
c: Coordinate c.
d: Coordinate d.

Autodesk.AutoCAD.Geometry.Plane.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs the plane with origin origin, U axis uAxis, and V axis vAxis.
origin: Origin.
u: Any vector.
v: Any vector.

Autodesk.AutoCAD.Geometry.Plane.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs the plane with origin=origin, uAxis=v1, and vAxis=v2.
u: Point U on U axis.
origin: Origin.
v: Point V on V axis.

Autodesk.AutoCAD.Geometry.Plane.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs the plane with origin=origin, uAxis= normal.perpVector(), and vAxis=normal.crossProduct(uAxis).
origin: Origin of plane.
normal: Normal vector.

Autodesk.AutoCAD.Geometry.Plane.#ctor(Autodesk.AutoCAD.Geometry.Plane)
Copy constructor. Constructs plane with the same origin, uAxis, and vAxis as the plane source.
source: Another plane.

Autodesk.AutoCAD.Geometry.Plane.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Plane.GetSignedDistanceTo(Autodesk.AutoCAD.Geometry.Point3d)
Returns the signed distance from the point pointValue to this plane.
pointValue: Input point.
Returns: The signed distance from the point pointValue to this plane.

Autodesk.AutoCAD.Geometry.Plane.IntersectWith(Autodesk.AutoCAD.Geometry.BoundedPlane)
Returns the intersection line segment if this plane and the bounded plane boundPlane are non-parallel.
boundPlane: Other plane.
Returns: The intersection line segment.

Autodesk.AutoCAD.Geometry.Plane.IntersectWith(Autodesk.AutoCAD.Geometry.BoundedPlane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the intersection line segment if this plane and the bounded plane boundPlane are non-parallel.
boundPlane: Other plane.
tolerance: Tolerance.
Returns: The intersection line segment.

Autodesk.AutoCAD.Geometry.Plane.IntersectWith(Autodesk.AutoCAD.Geometry.Plane)


Autodesk.AutoCAD.Geometry.Plane.IntersectWith(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the intersection line if this plane and the plane otherPlane are non-parallel.
otherPlane: Other plane.
tolerance: Tolerance.
Returns: The intersection line.

Autodesk.AutoCAD.Geometry.Plane.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets this plane to the plane with origin or, U axis uAxis, and V axis vAxis.
origin: Origin.
u: Any vector.
v: Any vector.

Autodesk.AutoCAD.Geometry.Plane.Set(System.Double,System.Double,System.Double,System.Double)
Sets this plane to the plane satisfying the equation:a*x + b*y + c*z + d = 0.
a: Coordinate a.
b: Coordinate b.
c: Coordinate c.
d: Coordinate d.

Autodesk.AutoCAD.Geometry.Plane.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Sets this plane to the plane with origin=origin, uAxis=u, and vAxis=v.
u: Point U on U axis.
origin: Origin.
v: Point V on V axis.

Autodesk.AutoCAD.Geometry.Plane.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets this plane to the plane with origin=origin, uAxis= normal.perpVector(), and vAxis=normal.crossProduct(uAxis).
origin: Origin of plane.
normal: Normal vector.

Autodesk.AutoCAD.Geometry.Plane.{dtor}
