Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.#ctor(Autodesk.AutoCAD.DatabaseServices.LoftOptions)
Constructor.
value: LoftOptions object.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.NormalOption


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.VirtualGuide


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.Ruled


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.Closed


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.Simplify


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.AlignDirection


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.NoTwist


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.ArcLengthParam


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.DraftEndMag


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.DraftStartMag


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.DraftEnd


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.DraftStart


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.SetOptionsFromSysvars


Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.ToLoftOptions
