Autodesk.AutoCAD.DatabaseServices.Transaction
Transactions provide a way to extend the boundary of operation on an object beyond open and close, and avoid those vexing open conflict errors. They also improve performance by being lenient on multiple open requests while postponing all the opened objects close-time work to the end of the transaction.

Autodesk.AutoCAD.DatabaseServices.Transaction.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Transaction.TransactionManager
Gets the TransactionManager of the Transaction.

Autodesk.AutoCAD.DatabaseServices.Transaction.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Obtain an DBObject.
id: Object ID of the object to obtain.
mode: Mode in which to obtain the object.
openErased: Boolean indicating whether to obtain erased objects.
forceOpenOnLockedLayer: Boolean indicating whether to obtain objects on locked layer.
Returns: The obtained object.

Autodesk.AutoCAD.DatabaseServices.Transaction.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean)
Obtain an DBObject.
id: Object ID of the object to obtain.
mode: Mode in which to obtain the object.
openErased: Boolean indicating whether to obtain erased objects.
Returns: The obtained object.

Autodesk.AutoCAD.DatabaseServices.Transaction.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode)
Obtain an DBObject.
id: Object ID of the object to obtain.
mode: Mode in which to obtain the object.
Returns: The obtained object.

Autodesk.AutoCAD.DatabaseServices.Transaction.GetAllObjects
Returns all the objects currently in the transaction.
Returns: All the objects currently in the transaction.

Autodesk.AutoCAD.DatabaseServices.Transaction.Commit
Commits the transaction.

Autodesk.AutoCAD.DatabaseServices.Transaction.Abort
Terminates the top transaction on the transaction stack. This termination results in an immediate rollback of all changes made since this transaction started. The rollback is applied to all transaction-resident objects in all transactions.

Autodesk.AutoCAD.DatabaseServices.Transaction.AddNewlyCreatedDBObject(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
If add == true, the object defined by obj is added to the transaction. If add == false, then the object is removed from the transaction.
obj: The object to be added or removed.
add: Boolean indicating whether to add or remove the object.

Autodesk.AutoCAD.DatabaseServices.Transaction.DeleteUnmanagedObject


Autodesk.AutoCAD.DatabaseServices.Transaction.{dtor}
