Autodesk.AutoCAD.Geometry.IntegerCollection
This collection class provides a container for integer values.

Autodesk.AutoCAD.Geometry.IntegerCollection.#ctor(System.Int32[])
Constructor.
values: Integer values.

Autodesk.AutoCAD.Geometry.IntegerCollection.#ctor(System.Int32)
Initializes a new instance of the IntegerCollection class that is empty and has the specified initial capacity.
capacity: The number of elements that the new collection can initially store.

Autodesk.AutoCAD.Geometry.IntegerCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.IntegerCollection.DefaultSize
The logical length of the collection.

Autodesk.AutoCAD.Geometry.IntegerCollection.Capacity
Gets or sets the number of elements that the collection can contain.

Autodesk.AutoCAD.Geometry.IntegerCollection.Count
Gets the number of elements actually contained in the collection.

Autodesk.AutoCAD.Geometry.IntegerCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.

Autodesk.AutoCAD.Geometry.IntegerCollection.IsReadOnly
Gets a value indicating whether the collection is read-only.

Autodesk.AutoCAD.Geometry.IntegerCollection.IsFixedSize
Gets a value indicating whether the collection has a fixed size.

Autodesk.AutoCAD.Geometry.IntegerCollection.IsSynchronized
Gets a value indicating whether access to the collection is synchronized (thread safe).

Autodesk.AutoCAD.Geometry.IntegerCollection.SyncRoot
Gets an object that can be used to synchronize access to the collection.

Autodesk.AutoCAD.Geometry.IntegerCollection.RemoveAt(System.Int32)
Removes the first occurrence of a specific object from the collection.
index: The zero-based index of the element to remove.

Autodesk.AutoCAD.Geometry.IntegerCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.Geometry.IntegerCollection.GetEnumerator
Returns an enumerator object for this collection.
Returns: An enumerator object for this collection.

Autodesk.AutoCAD.Geometry.IntegerCollection.TrimToSize
Sets the capacity to the actual number of elements in the collection.

Autodesk.AutoCAD.Geometry.IntegerCollection.Add(System.Int32)
Adds an object to the end of the collection.
value: The object to be added to the end of the collection. The value can be null.
Returns: The collection index at which the value has been added.

Autodesk.AutoCAD.Geometry.IntegerCollection.AddRange(System.Int32[])
Adds the elements of a double array to the end of the collection.
range: An array of double values to add to the end of the collection. The array itself can not be null but it can contain elements that are null.

Autodesk.AutoCAD.Geometry.IntegerCollection.IndexOf(System.Int32)
Searches for the specified object and returns the index of the first occurrence within the collection.
value: The object to locate in the collection. The value can be null.
Returns: The zero-based index of the first occurrence of value within the collection, if found; otherwise, -1.

Autodesk.AutoCAD.Geometry.IntegerCollection.Insert(System.Int32,System.Int32)
Inserts an element into the collection at the specified index.
index: The zero-based index at which value should be inserted.
value: The object to insert. The value can be null.

Autodesk.AutoCAD.Geometry.IntegerCollection.Remove(System.Int32)
Removes the first occurrence of a specific object from the collection.
value: The object to remove from the collection. The value can be null.

Autodesk.AutoCAD.Geometry.IntegerCollection.Contains(System.Int32)
Determines whether an element is in the collection.
value: The object to locate in the collection. The value can be null.
Returns: true if item is found in the collection; otherwise, false.

Autodesk.AutoCAD.Geometry.IntegerCollection.CopyTo(System.Int32[],System.Int32)
Copies the collection to a compatible one-dimensional Array, starting at the specified index of the target array.
array: The one-dimensional Array that is the destination of the elements copied from the collection. The Array must have zero-based indexing.
index: The zero-based index in array at which copying begins.

Autodesk.AutoCAD.Geometry.IntegerCollection.ToArray
Copies the elements of the collection to a new array.
Returns: An array containing copies of the elements of the collection.