Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo
Describes a file dependency entry.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.ReferenceCount
Gets current reference count for entry.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.FileSize
Gets current file size in bytes.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.TimeStamp
Gets current time/date, in number seconds since 1/1/1980.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.Index
Gets unique index in File Dependency List.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.IsAffectsGraphics
Gets entry affects the picture.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.IsModified
Gets current file-modified status.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.Feature
Gets feature name.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.VersionGuid
Gets version GUID from the .dwgs.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.FingerprintGuid
Gets fingerprint GUID from the .dwgs.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.FoundPath
Gets alternate path at which the file was found,if any.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.FileName
Gets saved base file name without the path.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.FullFileName
Gets saved full path name.

Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.ToString


Autodesk.AutoCAD.DatabaseServices.FileDependencyInfo.ToString(System.IFormatProvider)
