Autodesk.AutoCAD.DatabaseServices.Extents2d
Encapsulates values of simple 2D extents used in layouts and plot settings.

Autodesk.AutoCAD.DatabaseServices.Extents2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)


Autodesk.AutoCAD.DatabaseServices.Extents2d.#ctor(System.Double,System.Double,System.Double,System.Double)


Autodesk.AutoCAD.DatabaseServices.Extents2d.MaxPoint
Encapsulates values of simple 2D extents used in layouts and plot settings.

Autodesk.AutoCAD.DatabaseServices.Extents2d.MinPoint


Autodesk.AutoCAD.DatabaseServices.Extents2d.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.Extents2d.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Extents2d)


Autodesk.AutoCAD.DatabaseServices.Extents2d.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Extents2d,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.DatabaseServices.Extents2d.GetHashCode


Autodesk.AutoCAD.DatabaseServices.Extents2d.ToString(System.IFormatProvider)


Autodesk.AutoCAD.DatabaseServices.Extents2d.ToString


Autodesk.AutoCAD.DatabaseServices.Extents2d.op_Inequality(Autodesk.AutoCAD.DatabaseServices.Extents2d,Autodesk.AutoCAD.DatabaseServices.Extents2d)


Autodesk.AutoCAD.DatabaseServices.Extents2d.op_Equality(Autodesk.AutoCAD.DatabaseServices.Extents2d,Autodesk.AutoCAD.DatabaseServices.Extents2d)
