Autodesk.AutoCAD.Geometry.ExternalCurve2d
ExternalCurve2d class is a representation for a 2D curve geometry that has its definition external to GeLib.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.#ctor(System.IntPtr,Autodesk.AutoCAD.Geometry.ExternalEntityKind)
Creates an external curve from a curve definition passed in by the caller.
curveDef: Definition of the external curve.
curveKind: Information about the system in which the external curve definition was created.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.NurbCurve
Gets gelib native representation for the external curve.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.IsOwnerOfCurve
Gets true if the instance is the owner of its data.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.ExternalCurveKind
Gets information concerning the native system in which the external curve definition was created.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.ExternalCurve
Gets copy of the definition data as a pointer.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.IsDefined
Gets true if the instance does have a curve definition.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.IsNurbCurve
Gets true if the external curve does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.ExternalCurve2d.Set(System.IntPtr,Autodesk.AutoCAD.Geometry.ExternalEntityKind)
Reset the definition of an instance of this class. If the current instance is not empty, and it owns its definition data, then prior to resetting the definition data, it would delete the existing definition.
curveDef: New definition for the external curve.
curveKind: Information about the system in which the external curve definition was created.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.{dtor}
