Autodesk.AutoCAD.DatabaseServices.HatchObjectType
Describe the type of a hatch object.

Autodesk.AutoCAD.DatabaseServices.HatchObjectType.GradientObject
Indicates that the object is currently a color gradient.

Autodesk.AutoCAD.DatabaseServices.HatchObjectType.HatchObject
Indicates that the object is currently a classic hatch.