Autodesk.AutoCAD.DatabaseServices.DataColumn
Represents a single column of a DataTable.

Autodesk.AutoCAD.DatabaseServices.DataColumn.#ctor(Autodesk.AutoCAD.DatabaseServices.CellType,System.String)
This constructor creates a DataColumn object with a specified type and name.
type: DataCell value type for this DataColumn object.
columnName: Name for the DataColumn.

Autodesk.AutoCAD.DatabaseServices.DataColumn.#ctor(Autodesk.AutoCAD.DatabaseServices.DataColumn)
Copy constructor.Copies column to this DataColumn object.
column: DataColumn object to copy to this DataColumn object.

Autodesk.AutoCAD.DatabaseServices.DataColumn.#ctor
Default constructor.This constructor initializes the name of the DataColumn object to an empty string ("") and the column type to DataCell.Unknown.

Autodesk.AutoCAD.DatabaseServices.DataColumn.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DataColumn.NumCells
Gets the number of cells in the column.

Autodesk.AutoCAD.DatabaseServices.DataColumn.ColumnName
Gets or sets the name of the column or an empty string if no name was specified.

Autodesk.AutoCAD.DatabaseServices.DataColumn.ColumnType
Gets or sets the type of the column.

Autodesk.AutoCAD.DatabaseServices.DataColumn.GrowLength
Gets or sets the grow length of the DataColumn.

Autodesk.AutoCAD.DatabaseServices.DataColumn.PhysicalLength
Gets or sets the physical length of this DataColumn.

Autodesk.AutoCAD.DatabaseServices.DataColumn.Assign(Autodesk.AutoCAD.DatabaseServices.DataColumn)
Copies the data from col into this DataColumn.
col: Column to copy to this column.

Autodesk.AutoCAD.DatabaseServices.DataColumn.GetCellAt(System.Int32)
Retrieves the cell at the position in this column specified by index.
index: Index of cell to be retrieved.
Returns: Retrieved cell.

Autodesk.AutoCAD.DatabaseServices.DataColumn.SetCellAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
Sets the cell at the specified index. The index must be less than the number of cells in the column, which is obtainable with DataColumn.NumCells.
index: Index of the cell to be updated.
cell: DataCell to set.

Autodesk.AutoCAD.DatabaseServices.DataColumn.AppendCell(Autodesk.AutoCAD.DatabaseServices.DataCell)
Appends the specified cell to the end of the column.
cell: DataCell to append.

Autodesk.AutoCAD.DatabaseServices.DataColumn.InsertCellAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
Inserts the cell into the column at the specified index. If index is greater than or equal to the number of cells in the column, it calls the DataColumn.AppendCell() method.
index: Index of position at which to insert the cell.
cell: DataCell to insert.

Autodesk.AutoCAD.DatabaseServices.DataColumn.RemoveCellAt(System.Int32)
Removes the cell at the specified index. The index must be less than the number of cells in the column, which is obtainable with DataColumn.NumCells.
index: Index of cell to remove from the column.

Autodesk.AutoCAD.DatabaseServices.DataColumn.GetIndexAtCell(Autodesk.AutoCAD.DatabaseServices.DataCell)
Searches the column for the first cell with a value that matches cell.
cell: Cell to be matched.
Returns: Index of the first cell found in the column with the value of cell.

Autodesk.AutoCAD.DatabaseServices.DataColumn.{dtor}
