Autodesk.AutoCAD.Geometry.BoundedPlane
Represents a bounded planar parametric surface.

Autodesk.AutoCAD.Geometry.BoundedPlane.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs a bounded planar surface defined by a point and two vectors.
origin: Plane origin.
u: U direction.
v: V direction.

Autodesk.AutoCAD.Geometry.BoundedPlane.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a bounded planar surface defined by origin and two other points.
p1: Point.
origin: Origin point.
p2: Point.

Autodesk.AutoCAD.Geometry.BoundedPlane.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.BoundedPlane.IntersectWith(Autodesk.AutoCAD.Geometry.BoundedPlane)
This method calls BoundedPlane.IntersectWith(BoundedPlane plane, Tolerance tolerance) with tolerance set to Global.
plane: Bounded plane.
Returns: Intersection segment.

Autodesk.AutoCAD.Geometry.BoundedPlane.IntersectWith(Autodesk.AutoCAD.Geometry.BoundedPlane,Autodesk.AutoCAD.Geometry.Tolerance)
Computes a segment of intersection with another bounded plane.
plane: Bounded plane.
tolerance: Tolerance.
Returns: Intersection segment.

Autodesk.AutoCAD.Geometry.BoundedPlane.IntersectWith(Autodesk.AutoCAD.Geometry.Plane)
This method calls BoundedPlane.IntersectWith(Plane plane, Tolerance tolerance) with tolerance set to Global.
plane: Non-parametric plane.
Returns: Intersection segment.

Autodesk.AutoCAD.Geometry.BoundedPlane.IntersectWith(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Computes intersection with infinite non-parametric plane.
plane: Non-parametric plane.
tolerance: Tolerance.
Returns: Intersection segment.

Autodesk.AutoCAD.Geometry.BoundedPlane.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes plane definition to the one specified by input data.
p1: Point on plane.
origin: Origin point.
p2: Second point on plane.

Autodesk.AutoCAD.Geometry.BoundedPlane.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes plane definition to the one specified by input data.
origin: Origin point.
u: U vector.
v: V vector.

Autodesk.AutoCAD.Geometry.BoundedPlane.{dtor}
