Autodesk.AutoCAD.DatabaseServices.ObjectErasedEventArgs
Provides data for the ObjectErased event of the Database class.

Autodesk.AutoCAD.DatabaseServices.ObjectErasedEventArgs.Erased
Gets a value indicating whether the object was erased or unerased.

Autodesk.AutoCAD.DatabaseServices.ObjectErasedEventArgs.DBObject
Gets the object that is changed.