Autodesk.AutoCAD.DatabaseServices.Table
Table is a planar entity that can be created and placed in an arbitrary plane in 3D space. A table is generally thought of as an n x m rectangular array of cells whose contents consist of annotation objects, primarily text.

Autodesk.AutoCAD.DatabaseServices.Table.#ctor
Default constructor. Creates a Table with the following default settings: NumRows = 1, NumColumns = 1, Width = 1.0, Height = 1.0.

Autodesk.AutoCAD.DatabaseServices.Table.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Table.HasSubSelection
Gets true if the table has a subselection set.

Autodesk.AutoCAD.DatabaseServices.Table.SubSelection
Gets or sets the row and column indexes of the cells in the subselection set.

Autodesk.AutoCAD.DatabaseServices.Table.IsHeaderSuppressed
Gets or sets true if the header row of the table is suppressed, or false if it is not.

Autodesk.AutoCAD.DatabaseServices.Table.IsTitleSuppressed
Gets or sets true if the title row of the table is suppressed, or false if it is not.

Autodesk.AutoCAD.DatabaseServices.Table.FlowDirection
Gets or sets the direction that the table follows from its start to its finish.

Autodesk.AutoCAD.DatabaseServices.Table.VerticalCellMargin
Gets or sets the vertical cell margin for the table.

Autodesk.AutoCAD.DatabaseServices.Table.HorizontalCellMargin
Gets or sets the horizontal cell margin for the table.

Autodesk.AutoCAD.DatabaseServices.Table.MinimumTableHeight
Gets the minimum total height for the table.

Autodesk.AutoCAD.DatabaseServices.Table.MinimumTableWidth
Gets the minimum total width for the table.

Autodesk.AutoCAD.DatabaseServices.Table.Height
Gets or sets the total height for the table.

Autodesk.AutoCAD.DatabaseServices.Table.Width
Gets or sets the total width for the table.

Autodesk.AutoCAD.DatabaseServices.Table.NumColumns
Gets or sets a non-negative integer representing the number of columns in the table.

Autodesk.AutoCAD.DatabaseServices.Table.NumRows
Gets or sets a non-negative integer representing the number of rows in the table.

Autodesk.AutoCAD.DatabaseServices.Table.Direction
Gets or sets the unit horizontal direction vector for the table in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Table.TableStyle
Gets or sets the Object ID of the TableStyle referenced by the table object.

Autodesk.AutoCAD.DatabaseServices.Table.ColumnWidth(System.Int32)
Returns the column width at the specified column index in the table.
col: Zero-based column index.
Returns: The column width at the specified column index in the table.

Autodesk.AutoCAD.DatabaseServices.Table.SetColumnWidth(System.Double)
Sets a uniform column width for all the columns in the table.
width: Uniform width to be used for all the columns in the table.

Autodesk.AutoCAD.DatabaseServices.Table.SetColumnWidth(System.Int32,System.Double)
Sets the column width at the specified column index in the table.
col: Zero-based column index.
width: Width to be used for the specified column.

Autodesk.AutoCAD.DatabaseServices.Table.RowHeight(System.Int32)
Returns the row height of the specified row in the table.
row: Zero-based row index.
Returns: The row height of the specified row in the table.

Autodesk.AutoCAD.DatabaseServices.Table.SetRowHeight(System.Double)
Sets a uniform row height for all the rows in the table.
height: Height to be used for all the rows in the table.

Autodesk.AutoCAD.DatabaseServices.Table.SetRowHeight(System.Int32,System.Double)
Sets the row height for the specified row index in the table.
row: Zero-based row index.
height: Height to be used for the specified row.

Autodesk.AutoCAD.DatabaseServices.Table.MinimumColumnWidth(System.Int32)
Returns the minimum column width at the specified column index in the table.
col: Zero-based column index.
Returns: The minimum column width at the specified column index in the table.

Autodesk.AutoCAD.DatabaseServices.Table.MinimumRowHeight(System.Int32)
Returns the minimum row height for the specified row in the table.
row: Zero-based row index.
Returns: The minimum row height for the specified row in the table.

Autodesk.AutoCAD.DatabaseServices.Table.Alignment(System.Int32,System.Int32)
Returns the alignment of the text or block in the specified cell of the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The alignment of the text or block in the specified cell of the table.

Autodesk.AutoCAD.DatabaseServices.Table.Alignment(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the cell alignment for a given row type of the table object.
type: Row type for which the cell alignment value will be returned.
Returns: The cell alignment for a given row type of the table object.

Autodesk.AutoCAD.DatabaseServices.Table.SetAlignment(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellAlignment)
Sets the alignment of the text or block in the specified cell of the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
align: Enum value specifies the cell alignment.

Autodesk.AutoCAD.DatabaseServices.Table.SetAlignment(Autodesk.AutoCAD.DatabaseServices.CellAlignment,System.Int32)
Sets the cell alignment for the specified row types. Different row types can be OR'd.
align: Cell alignment.
rowTypes: Row types.

Autodesk.AutoCAD.DatabaseServices.Table.IsBackgroundColorNone(System.Int32,System.Int32)
Returns true if the background color for the specified cell in the table is set to no color value.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: true if the background color for the specified cell in the table is set to no color value.

Autodesk.AutoCAD.DatabaseServices.Table.IsBackgroundColorNone(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns true if the background color for the given row type of the table object is set to no color value.
type: Row type for which to return the Boolean value indicating whether the background color is set to none.
Returns: true if the background color for the given row type of the table object is set to no color value.

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColorNone(System.Int32,System.Int32,System.Boolean)
Enables or disables the background color for the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
value: Value indicates whether to enable the background color for the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColorNone(System.Boolean,System.Int32)
Enables or disables the background color for the specified row type. Different row types can be combined.
value: Boolean indicates whether to enable the background color for the specified row type.
rowTypes: Row types.

Autodesk.AutoCAD.DatabaseServices.Table.BackgroundColor(System.Int32,System.Int32)
Returns the background color of the specified cell in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The background color of the specified cell in the table.

Autodesk.AutoCAD.DatabaseServices.Table.BackgroundColor(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the background color for a given row type of the table object.
type: Row type for which the Color value is returned.
Returns: The background color for a given row type of the table object.

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColor(System.Int32,System.Int32,Autodesk.AutoCAD.Colors.Color)
Sets the background color of the specified cell in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
color: Background color.

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColor(Autodesk.AutoCAD.Colors.Color,System.Int32)
Sets the background color for the specified row types. Different row types can be OR'd.
color: Background color.
rowTypes: Row types.

Autodesk.AutoCAD.DatabaseServices.Table.ContentColor(System.Int32,System.Int32)
Returns the color of the cell content for the specified cell in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The color of the cell content for the specified cell in the table.

Autodesk.AutoCAD.DatabaseServices.Table.ContentColor(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the content color for a given row type of the table object.
type: Row type for which the Color value is returned.
Returns: The content color for a given row type of the table object.

Autodesk.AutoCAD.DatabaseServices.Table.SetContentColor(System.Int32,System.Int32,Autodesk.AutoCAD.Colors.Color)
Sets the color of the cell content for the specified cell in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
color: Color for the cell contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetContentColor(Autodesk.AutoCAD.Colors.Color,System.Int32)
Sets the content color for the specified row types. Different row types can be OR'd.
color: Text color.
rowTypes: Row types.

Autodesk.AutoCAD.DatabaseServices.Table.TextStyle(System.Int32,System.Int32)
Returns the Object ID of the text style of the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The Object ID of the text style of the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.TextStyle(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the Object ID of the text style for a given row type currently referenced by the table object.
type: Row type for which the Object ID of the TextStyleRecord is returned.
Returns: The Object ID of the text style for a given row type currently referenced by the table object.

Autodesk.AutoCAD.DatabaseServices.Table.SetTextStyle(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the table object to use the TextStyleTableRecord specified by id for the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
id: TextStyleTableRecord Object ID.

Autodesk.AutoCAD.DatabaseServices.Table.SetTextStyle(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Sets the table object to use the TextStyleTableRecord specified by id for the specified row types. Different row types can be OR'd.
id: TextStyleTableRecord Object ID.
rowTypes: Row types.

Autodesk.AutoCAD.DatabaseServices.Table.TextHeight(System.Int32,System.Int32)
Returns the text height of the specified table cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The text height of the specified table cell.

Autodesk.AutoCAD.DatabaseServices.Table.TextHeight(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the text height for a given row type of the table object.
type: Row type for which the text height is returned.
Returns: The text height for a given row type of the table object.

Autodesk.AutoCAD.DatabaseServices.Table.SetTextHeight(System.Int32,System.Int32,System.Double)
Sets the text height for the specified table cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
height: Text height.

Autodesk.AutoCAD.DatabaseServices.Table.SetTextHeight(System.Double,System.Int32)
Sets the text height for the specified row types. Different row types can be OR'd.
height: Text height.
rowTypes: Row types.

Autodesk.AutoCAD.DatabaseServices.Table.GridLineWeight(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks)
Returns the grid lineweight of the specified edge of the cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
edge: The edge index for the cell.
Returns: The grid lineweight of the specified edge of the cell.

Autodesk.AutoCAD.DatabaseServices.Table.GridLineWeight(Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the lineweight for a given grid line type and row type of the table object.
gridlineType: Grid line type for which to return the lineweight value.
type: Row type for which to return the lineweight value.
Returns: The lineweight for a given grid line type and row type of the table object.

Autodesk.AutoCAD.DatabaseServices.Table.SetGridLineWeight(System.Int32,System.Int32,System.Int16,Autodesk.AutoCAD.DatabaseServices.LineWeight)
Sets the grid lineweight of the specified edge of the cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
edges: The edge index for the cell.
value: Lineweight to be used for the grid at the specified edge of the cell.

Autodesk.AutoCAD.DatabaseServices.Table.SetGridLineWeight(Autodesk.AutoCAD.DatabaseServices.LineWeight,System.Int32,System.Int32)
Sets the lineweight for a given grid line type and row type of the table object. Different grid line and row types can be combined.
lineWeight: Lineweight value.
borders: Grid line types for which to set the lineweight.
rows: Row types for which to set the lineweight.

Autodesk.AutoCAD.DatabaseServices.Table.GridColor(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks)
Returns the grid color of the specified edge of the cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
edge: The edge index for the cell.
Returns: The grid color of the specified edge of the cell.

Autodesk.AutoCAD.DatabaseServices.Table.GridColor(Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the grid color for a given grid line type and row type of the table object.
gridlineType: Grid line type for which to return the Color value.
type: Row type for which to return the Color value.
Returns: The grid color for a given grid line type and row type of the table object.

Autodesk.AutoCAD.DatabaseServices.Table.SetGridColor(System.Int32,System.Int32,System.Int16,Autodesk.AutoCAD.Colors.Color)
Sets the grid color of the specified edge of the cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
edges: The edge index for the cell.
color: Color to be used for the grid at the specified edge of the cell.

Autodesk.AutoCAD.DatabaseServices.Table.SetGridColor(Autodesk.AutoCAD.Colors.Color,System.Int32,System.Int32)
Sets the grid color for a given grid line type and row type of the table object. Different grid line and row types can be combined.
color: Color value.
borders: Grid line types for which to set the lineweight.
rows: Row types for which to set the color.

Autodesk.AutoCAD.DatabaseServices.Table.GridVisibility(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks)
Returns the grid color of the specified edge of the cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
edge: The edge index for the cell.
Returns: The grid visibility of the specified edge of the cell.

Autodesk.AutoCAD.DatabaseServices.Table.GridVisibility(Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the grid visibility for a given grid line type and row type of the table object.
gridlineType: Grid line type for which to return the grid visibility.
type: Row type for which to return the grid visibility.
Returns: The grid visibility for a given grid line type and row type of the table object.

Autodesk.AutoCAD.DatabaseServices.Table.SetGridVisibility(System.Int32,System.Int32,System.Int16,System.Boolean)
Sets the grid visibility of the specified edge of the cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
edges: The edge index for the cell.
value: Visibility to be used for the grid at the specified edge of the cell.

Autodesk.AutoCAD.DatabaseServices.Table.SetGridVisibility(System.Boolean,System.Int32,System.Int32)
Sets the grid visibility for a given grid line type and row type of the table object. Different grid line and row types can be combined.
visible: Visibility value.
borders: Grid line types for which to set the visibility.
rows: Row types for which to set the visibility.

Autodesk.AutoCAD.DatabaseServices.Table.TableStyleOverrides
Returns the table style overrides.
Returns: The table style overrides.

Autodesk.AutoCAD.DatabaseServices.Table.ClearTableStyleOverrides(System.Int32)
Clears the overrides used in a table and its cells.
options: Options.

Autodesk.AutoCAD.DatabaseServices.Table.CellType(System.Int32,System.Int32)
Returns the cell type of the cell at the specified location in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The cell type of the cell at the specified location in the table.

Autodesk.AutoCAD.DatabaseServices.Table.SetCellType(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellType)
Sets the cell type to be applied to the cell at the specified location in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
type: Enum value specifying the cell type.

Autodesk.AutoCAD.DatabaseServices.Table.GetCellExtents(System.Int32,System.Int32,System.Boolean,Autodesk.AutoCAD.Geometry.Point3dCollection)
Gets the cell extents for the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
isOuterCell: Output Boolean indicating whether the specified cell is an outer cell.
pts: Output point array containing the cell extents information.

Autodesk.AutoCAD.DatabaseServices.Table.AttachmentPoint(System.Int32,System.Int32)
Returns the attachment point of the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The attachment point of the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.CellStyleOverrides(System.Int32,System.Int32)
Returns the cell overrides for the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The cell overrides for the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.DeleteCellContent(System.Int32,System.Int32)
Deletes the cell content for the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.

Autodesk.AutoCAD.DatabaseServices.Table.RowType(System.Int32)
Returns the row type of the specified row in the table.
row: Zero-based row index.
Returns: The row type of the specified row in the table.

Autodesk.AutoCAD.DatabaseServices.Table.TextStringConst(System.Int32,System.Int32)
Returns a copy of the text string in the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: A copy of the text string in the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.TextString(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.FormatOption)
For internal use only.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
nOption: Format option for formatting the cell value.
Returns: A copy of the text string in the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.TextString(System.Int32,System.Int32)
Returns a copy of the text string in the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: A copy of the text string in the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.SetTextString(System.Int32,System.Int32,System.String)
Makes a copy of text and uses the copy as the text string in the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
value: Text string.

Autodesk.AutoCAD.DatabaseServices.Table.FieldId(System.Int32,System.Int32)
Returns the Object ID of the Field in the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The Object ID of the Field in the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.SetFieldId(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the Field Object ID for the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
fieldId: Field Object ID.

Autodesk.AutoCAD.DatabaseServices.Table.TextRotation(System.Int32,System.Int32)
Returns the rotation angle of the text in the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The rotation angle of the text in the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.SetTextRotation(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.RotationAngle)
Sets the rotation angle of the text in the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
rot: Value specifies the text rotation angle for the cell.

Autodesk.AutoCAD.DatabaseServices.Table.IsAutoScale(System.Int32,System.Int32)
Returns true if the Table object automatically computes the scale and insertion point for the block content in order to fit it into the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: true if the Table object automatically computes the scale and insertion point for the block content in order to fit it into the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.SetAutoScale(System.Int32,System.Int32,System.Boolean)
If autoFit is true,the Table object automatically computes the scale and insertion point for the block content in order to fit it into the specified cell.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
autoFit: Boolean indicates whether to auto fit the block at the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.BlockTableRecordId(System.Int32,System.Int32)
Returns the Object ID of the block table record at the specified cell in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The Object ID of the block table record at the specified cell in the table.

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockTableRecordId(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the Object ID of the block table record at the specified cell in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
blockId: BlockTableRecord Object ID.
autoFit: Boolean indicates whether to auto fit the block at the specified cell.

Autodesk.AutoCAD.DatabaseServices.Table.BlockScale(System.Int32,System.Int32)
Returns the scale factor of the block reference at the specified cell in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The scale factor of the block reference at the specified cell in the table.

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockScale(System.Int32,System.Int32,System.Double)
Sets the scale factor of the block reference at the specified cell in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
scale: Scale factor.

Autodesk.AutoCAD.DatabaseServices.Table.BlockRotation(System.Int32,System.Int32)
Returns the rotation angle of the block reference at the specified cell in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The rotation angle of the block reference at the specified cell in the table.

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockRotation(System.Int32,System.Int32,System.Double)
Sets the rotation angle of the block reference at the specified cell in the table.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
rotationalAngle: Rotation angle.

Autodesk.AutoCAD.DatabaseServices.Table.GetBlockAttributeValue(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the attribute value from the block cell using the specified object ID key.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
attributeDefinitionId: Object ID of an AttributeDefinition object.
Returns: The attribute value from the block cell using the specified object ID key.

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockAttributeValue(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Sets the attribute value from the block cell using the specified object ID key. The attribute values are maintained by the table object.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
attributeDefinitionId: Object ID of an AttributeDefinition object.
value: Character string specifies attribute value.

Autodesk.AutoCAD.DatabaseServices.Table.InsertColumns(System.Int32,System.Double,System.Int32)
Inserts the specified number of new columns into the table at the column index col.
col: The zero-based column index for the cell.
width: Width for the inserted columns.
columns: Number of columns to insert.

Autodesk.AutoCAD.DatabaseServices.Table.DeleteColumns(System.Int32,System.Int32)
Deletes the specified number of columns from the table at the column index col.
col: The zero-based column index for the cell.
columns: Number of columns to delete.

Autodesk.AutoCAD.DatabaseServices.Table.InsertRows(System.Int32,System.Double,System.Int32)
Inserts the specified number of new rows into the table at the row index row.
row: The zero-based row index for the cell.
height: Height for the inserted rows.
rows: Number of rows to insert.

Autodesk.AutoCAD.DatabaseServices.Table.DeleteRows(System.Int32,System.Int32)
Deletes the specified number of rows from the table at the row index row.
row: The zero-based row index for the cell.
rows: Number of rows to delete.

Autodesk.AutoCAD.DatabaseServices.Table.MergeCells(Autodesk.AutoCAD.DatabaseServices.TableRegion)
Merges a rectangular region of cells.
value: TableRegion object.

Autodesk.AutoCAD.DatabaseServices.Table.UnmergeCells(Autodesk.AutoCAD.DatabaseServices.TableRegion)
Unmerges a rectangular region of cells.
value: TableRegion object.

Autodesk.AutoCAD.DatabaseServices.Table.IsMergedCell(System.Int32,System.Int32)
Returns the range of the merged cells if the specified cell is within merged cells.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: The range of the merged cells if the specified cell is within merged cells.

Autodesk.AutoCAD.DatabaseServices.Table.GenerateLayout
Updates the table object according to the current table style. It computes table geometry, including grid lines, text content, block content, and background fills, from given definition data and table style.

Autodesk.AutoCAD.DatabaseServices.Table.RecomputeTableBlock(System.Boolean)
Updates the block table record the table object references to match any changes made to the table object since the last time the block table record was updated.
forceUpdate: Boolean indicates whether to force an update on the screen.

Autodesk.AutoCAD.DatabaseServices.Table.HitTest(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Performs hit test for the specified point and viewing direction. The cell hit by the ray will be returned.
point: 3D point in WCS specifies the input picking point.
viewVector: 3D vector in WCS specifies the view direction for the hit test.
Returns: TableHitTestInfo object indicates the cell hit by the ray.

Autodesk.AutoCAD.DatabaseServices.Table.DataType(System.Int32,System.Int32)
For internal use only.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: For internal use only.

Autodesk.AutoCAD.DatabaseServices.Table.DataType(Autodesk.AutoCAD.DatabaseServices.RowType)
For internal use only.
type: Value specifies the row type for which the data type will be returned .
Returns: For internal use only.

Autodesk.AutoCAD.DatabaseServices.Table.UnitType(System.Int32,System.Int32)
For internal use only.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: For internal use only.

Autodesk.AutoCAD.DatabaseServices.Table.UnitType(Autodesk.AutoCAD.DatabaseServices.RowType)
For internal use only.
type: Value specifies the row type for which the unit type will be returned .
Returns: For internal use only.

Autodesk.AutoCAD.DatabaseServices.Table.SetDataType(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.DataType,Autodesk.AutoCAD.DatabaseServices.UnitType)
For internal use only.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
nDataType: Data type to set.
nUnitType: Unit type to set.

Autodesk.AutoCAD.DatabaseServices.Table.SetDataType(Autodesk.AutoCAD.DatabaseServices.DataType,Autodesk.AutoCAD.DatabaseServices.UnitType,System.Int32)
For internal use only.
nDataType: Data type to set.
nUnitType: Unit type to set.
rowTypes: Bitflags contains one or more row types for which the data type and unit type are to be set.

Autodesk.AutoCAD.DatabaseServices.Table.Format(System.Int32,System.Int32)
For internal use only.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: For internal use only.

Autodesk.AutoCAD.DatabaseServices.Table.Format(Autodesk.AutoCAD.DatabaseServices.RowType)
For internal use only.
type: Value specifies the row type for which the format string will be returned.
Returns: For internal use only.

Autodesk.AutoCAD.DatabaseServices.Table.SetFormat(System.Int32,System.Int32,System.String)
For internal use only.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
pFormat: Format string to set.

Autodesk.AutoCAD.DatabaseServices.Table.SetFormat(System.String,System.Int32)
For internal use only.
pFormat: Format string to set.
rowTypes: Bitflags containing one or more row types for which the data type and unit type are to be set .

Autodesk.AutoCAD.DatabaseServices.Table.Value(System.Int32,System.Int32)
For internal use only.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
Returns: For internal use only.

Autodesk.AutoCAD.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.String,Autodesk.AutoCAD.DatabaseServices.ParseOption)
For internal use only.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
pText: Text to convert to value and set.
nOption: Parse option.

Autodesk.AutoCAD.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.Object)
For internal use only.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.
pValue: Value to set.

Autodesk.AutoCAD.DatabaseServices.Table.ResetValue(System.Int32,System.Int32)
For internal use only.
row: The zero-based row index for the cell.
col: The zero-based column index for the cell.

Autodesk.AutoCAD.DatabaseServices.Table.Select(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean,System.Boolean,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Selects a cell in the table using a specified point, viewing direction, and orientation.
pickingPoint: 3D point in WCS specifying the input picking point.
hitTestViewDirection: 3D vector in WCS specifying the view direction for the hit test.
hitTestViewOrientation: 3D vector in WCS specifying the view orientation for the hit test.
allowOutside: Boolean indicates whether a pick point outside the table will select a cell.
inPickFirst: Boolean indicates if the entity is already in the pickfirst set (true) or if the pickfirst logic should attempt to subselect the entity directly (false).
paths: Output FullSubentityPath Array.
Returns: The cell subentities.

Autodesk.AutoCAD.DatabaseServices.Table.SelectSubRegion(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.SelectType,System.Boolean,System.Boolean,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Selects a set of cells in the table using a specified window box, viewing direction, and orientation.
cornerPoint1: 3D point in WCS specifying the first corner point of the window box selection.
cornerPoint2: 3D point in WCS specifying the second corner point of the window box selection.
selectionViewDirection: 3D vector in WCS specifying the view direction of the selection.
hitTestViewDirection: 3D vector in WCS specifying the view orientation of the hit test.
selectionType: SelectType enum specifies the selection type.
includeCurrentSelection: Boolean indicates whether the selected cells returned will include currently selected cells and newly selected cells or only newly selected cells.
inPickFirst: Boolean indicates if the entity is already in the pickfirst set (true) or if the pickfirst logic should attempt to subselect the entity directly (false).
paths: Output FullSubentityPath Array.
Returns: The set of cells in the input window box.

Autodesk.AutoCAD.DatabaseServices.Table.ReselectSubRegion(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Returns the subentities of the current subselection cells.
paths: Output array of FullSubentityPath.

Autodesk.AutoCAD.DatabaseServices.Table.{dtor}
