Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.#ctor(AcArray&lt;AcGePoint2d\,AcArrayMemCopyReallocator&lt;AcGePoint2d&gt; &gt;*,AcArray&lt;double\,AcArrayMemCopyReallocator&lt;double&gt; &gt;*)


Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.GetArrays(AcArray&lt;AcGePoint2d\,AcArrayMemCopyReallocator&lt;AcGePoint2d&gt; &gt;*,AcArray&lt;double\,AcArrayMemCopyReallocator&lt;double&gt; &gt;*)


Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.Add(Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Adds the object represented by value to this collection.
value: Autodesk.AutoCAD.DatabaseServices.BulgeVertex object.
Returns: The zero-based index of the newly added collection item.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Gets the 0-based index of the collection item that matches value.
value: The object to search for in this collection.
Returns: The zero-based index of the collection item that matches value, or -1 if value does not exist in the collection.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Inserts an element into the collection at the specified index.
index: The zero-based index at which value should be inserted.
value: Element to be inserted in the collection.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.Remove(Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Removes the object represented by value from this collection.
value: The item to remove from the collection.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.Contains(Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Returns a value indicating whether the collection contains an object that matches value.
value: Autodesk.AutoCAD.DatabaseServices.BulgeVertex object.
Returns: A value indicating whether the collection contains an object that matches val.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.BulgeVertex[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.OnValidate(System.Object)
