Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits
Represents render settings to the underlying display system.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.ModelScaleFactor
Gets or sets the model scale factor relative to meters.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.DiagnosticBackgroundEnabled
Gets or sets a Boolean indicating whether the diagnostic (checkered) background will be rendered.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.ShadowsEnabled
Gets or sets a Boolean indicating whether shadows are cast.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.BackFacesEnabled
Gets or sets a Boolean indicating whether back-facing faces are rendered.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.TextureSampling
Gets or sets a Boolean indicating whether sampling (filtering) for image textures is enabled.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.MaterialEnabled
Gets or sets a Boolean indicating whether per-object materials are used.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.{dtor}
