Autodesk.AutoCAD.Geometry.PointOnSurface
Represents a point on a surface. This class encapsulates all of the geometric information of a point on a surface, including its parameter value, 3D coordinates, derivatives, and normal vector.

Autodesk.AutoCAD.Geometry.PointOnSurface.#ctor(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Point2d)
Constucts a point on the input surface at the specified parameter value.
surf: Any 3D surface.
point: Parameter value on surface.

Autodesk.AutoCAD.Geometry.PointOnSurface.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.PointOnSurface.Parameter
Gets or sets the parameter value of the point on surface.

Autodesk.AutoCAD.Geometry.PointOnSurface.Surface
Gets or sets the surface on which the point lies.

Autodesk.AutoCAD.Geometry.PointOnSurface.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.PointOnSurface.GetPoint(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Point2d)
Returns the coordinates of the point on the input surface at the specified parameter value. This method resets the underlying surface and parameter value of the point on surface.
surface: Any surface.
point: Parameter value.
Returns: The coordinates of the point on the input surface at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetPoint(Autodesk.AutoCAD.Geometry.Point2d)
Returns the coordinates of the point on surface at the specified parameter value. This method resets the parameter value of the point on surface.
point: Parameter value.
Returns: The coordinates of the point on surface at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetNormal(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Point2d)
Returns the normal vector of the input surface at the specified parameter value.
surf: Any surface.
point: Parameter value.
Returns: The normal vector of the input surface at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetNormal(Autodesk.AutoCAD.Geometry.Point2d)
Returns the normal vector at the specified parameter value.
point: Parameter value.
Returns: The normal vector at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetNormal
Returns the normal vector at the point on surface.
Returns: The normal vector at the point on surface.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetUDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Point2d)
Returns the U-partial derivative of the specified order on the input surface at the specified parameter value. order must be greater than 0 and no larger than 2. This method resets the underlying surface and parameter value of the point on surface.
order: Order of derivative.
surface: Any surface.
point: Parameter value.
Returns: The U-partial derivative of the specified order on the input surface at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetUDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Returns the U-partial derivative at the specified parameter value. order must be greater than 0 and no larger than 2. This method resets the underlying and parameter value of the point on surface.
order: Order of derivative.
point: Parameter value.
Returns: The U-partial derivative at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetUDerivative(System.Int32)
Returns the U-partial derivative of the specified order. order must be greater than 0 and no larger than 2.
order: Order of derivative.
Returns: The U-partial derivative of the specified order.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetVDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Point2d)
Returns the V-partial derivative of the specified order on the input surface at the specified parameter value. order must be greater than 0 and no larger than 2. This method resets the underlying surface and parameter value of the point on surface.
order: Order of derivative.
surface: Any surface.
point: Parameter value.
Returns: The V-partial derivative of the specified order on the input surface at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetVDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Returns the V-partial derivative at the specified parameter value. order must be greater than 0 and no larger than 2. This method resets the underlying and parameter value of the point on surface.
order: Order of derivative.
point: Parameter value.
Returns: The V-partial derivative at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetVDerivative(System.Int32)
Returns the V-partial derivative of the specified order. order must be greater than 0 and no larger than 2.
order: Order of derivative.
Returns: The V-partial derivative of the specified order.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetMixedPartial(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Point2d)
Returns the mixed partial of the input surface at the specified parameter value.
surf: Any surface.
point: Parameter value.
Returns: The mixed partial of the input surface at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetMixedPartial(Autodesk.AutoCAD.Geometry.Point2d)
Returns the mixed partial at the specified parameter value.
point: Parameter value.
Returns: The mixed partial at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetMixedPartial
Returns the mixed partial at the point on surface.
Returns: The mixed partial at the point on surface.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetTangentVector(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Point2d)
Maps the input tangent vector to the tangent plane of the input surface at the specified parameter value. The returned vector is equal to uDeriv(1)*vec.x + vDeriv(1)*vec.y.
vector: Any 2D vector.
vectorSurface: Any surface.
pointer: Parameter value.
Returns: The tangent plane of the input surface at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetTangentVector(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Point2d)
Maps the input tangent vector to the tangent plane at the specified parameter value. The returned vector is equal to uDeriv(1)*vec.x + vDeriv(1)*vec.y.
vector: Any 2D vector.
pointer: Parameter value.
Returns: The tangent plane at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetTangentVector(Autodesk.AutoCAD.Geometry.Vector2d)
Maps the input tangent vector to the tangent plane at the point on surface. The returned vector is equal to uDeriv(1)*vec.x + vDeriv(1)*vec.y.
vector: Any 2D vector.
Returns: The tangent plane at the point on surface.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetInverseTangentVector(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Point2d)
Projects the input vector onto the tangent plane of the input surface at the specified parameter value and returns the 2D parameter space vector that maps to this projected vector.
vector: Any 3D vector.
surf: Any surface.
point: Parameter value.
Returns: The 2D parameter space vector that maps to this projected vector.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetInverseTangentVector(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point2d)
Projects the input vector onto the tangent plane at the specified parameter value and returns the 2D parameter space vector that maps to this projected vector.
vector: Any 3D vector.
point: Parameter value.
Returns: The 2D parameter space vector that maps to this projected vector.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetInverseTangentVector(Autodesk.AutoCAD.Geometry.Vector3d)
Projects the input vector onto the tangent plane at the point on surface and returns the 2D parameter space vector that maps to this projected vector.
vector: Any 3D vector.
Returns: The 2D parameter space vector that maps to this projected vector.

Autodesk.AutoCAD.Geometry.PointOnSurface.{dtor}
