Autodesk.AutoCAD.DatabaseServices.LoftOptions
Utility class for setting options used by LoftedSurface.CreateLoftedSurface(). These options can be used to control the shape of the resulting surface.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.#ctor(Autodesk.AutoCAD.DatabaseServices.LoftOptions)
Copy constructor.
opts: Object to be copied into 'this'.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.NormalOption
Gets Enumerated type for specifying plane normal lofting.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.VirtualGuide
Gets state of the virtual guide option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Ruled
Gets the value of the ruled option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Closed
Gets the value of the closed option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Simplify
Gets the value of the simplify option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.AlignDirection
Gets the value of the AlignDirection option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.NoTwist
Gets the value of the NoTwist option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.ArcLengthParam
Gets arc length parametrization.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftEndMag
Gets the end draft magnitude. Controls the magnitude of the surface tangent vector at the last cross-section. The default value of this option is 0, which means that the system will compute the optimum magnitude.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftStartMag
Gets the start draft magnitude. Controls the magnitude of the surface tangent vector at the first cross-section. The default value of this option is 0, which means that the system will compute the optimum magnitude.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftEnd
Gets the end draft angle. This is the surface take-off direction at the last cross section. The default value of this option is 0, which indicates that no draft angle is defined and the system will compute the optimum angle at the last cross section.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftStart
Gets the start draft angle. This is the surface take-off direction at the first cross section. The default value of this option is 0, which indicates that no draft angle is defined and the system will compute the optimum angle at the first cross section.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Clone


Autodesk.AutoCAD.DatabaseServices.LoftOptions.CheckLoftCurves(Autodesk.AutoCAD.DatabaseServices.Entity[],Autodesk.AutoCAD.DatabaseServices.Entity[],Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
Checks whether cross section curves and guide/path curves are valid for the lofting operation.
crossSectionCurves: List of cross-section curves.
guideCurves: List of guide curves.
pPathCurve: Pointer to path curve or null.
displayErrorMessages: Boolean whether or not to display error messages.
Returns: LoftOptionsCheckCurvesOut object indicates whether cross section curves and guide/path curves are valid for the lofting operation.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.CheckCrossSectionCurves(Autodesk.AutoCAD.DatabaseServices.Entity[],System.Boolean)
Checks whether cross section curves are valid for the lofting operation.
crossSectionCurves: List of cross-section curves.
displayErrorMessages: Boolean whether or not to display error messages.
Returns: LoftOptionsCheckCurvesOut object indicates whether cross section curves are valid for the lofting operation.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.CheckGuideCurves(Autodesk.AutoCAD.DatabaseServices.Entity[],System.Boolean)
Checks whether guide curves are valid for lofting operation.
guideCurves: List of guide curves.
displayErrorMessages: Boolean whether or not to display error messages.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.CheckPathCurve(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
Checks whether path curve is valid for lofting operation.
pathCurve: Path curve.
displayErrorMessages: Boolean whether or not to display error messages.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.{dtor}
