Autodesk.AutoCAD.Geometry.ClipCondition
Provides information about the spatial relationship between the input segments and the clip boundary.

Autodesk.AutoCAD.Geometry.ClipCondition.AllSegmentsOutsideEvenWinds
All input segments lie outside the clip region, but the clip region is encircled by the input polygon an even number of times. Depending on the user's polygon fill algorithm, the clip region may be considered inside or outside the region enclosed by the input polygon. If the input polyline is NOT a closed polygon, then the encircling count is only approximate.

Autodesk.AutoCAD.Geometry.ClipCondition.AllSegmentsOutsideOddWinds
All input segments lie outside the clip region, but the clip region is encircled by the input polygon an odd number of times. This normally indicates that the clip region is inside the region enclosed by the input polygon. If the input polyline is NOT a closed polygon, then the encircling count is only approximate.

Autodesk.AutoCAD.Geometry.ClipCondition.AllSegmentsOutsideZeroWinds
All input segments lie outside the clip region, and the clip region is not encircled by the input polygon.

Autodesk.AutoCAD.Geometry.ClipCondition.SegmentsIntersect
One or more of the input segments crosses the clip boundary.

Autodesk.AutoCAD.Geometry.ClipCondition.AllSegmentsInside
All input segments lie inside the clip region.

Autodesk.AutoCAD.Geometry.ClipCondition.Invalid
An error was detected in the clipping process, probably due to improper initialization of the object.