Autodesk.AutoCAD.Geometry.ExternalCurve3d
ExternalCurve3d class is a representation for a 3D curve geometry that has its definition external to gelib.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.ExternalCurve3d.ExternalCurveKind
Gets information concerning the native system in which the external curve definition was created.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.NativeCurve
Gets gelib native representation for the external curve.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsNativeCurve
Gets true if there exists a native gelib representation corresponding to the external curve.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsDefined
Gets true if the instance does have a curve definition.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsNurbCurve
Gets true if the external curve does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsEllipticalArc
Gets true if the external curve does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsCircularArc
Gets true if the external curve does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsLineSegment
Gets true if the external curve does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsRay
Gets true if the external curve does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsLine
Gets true if the external curve does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.ExternalCurve3d.{dtor}
