Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter
This class is a list of layers that need to have their corresponding entity lists traversed during filtered block traversal.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.LayerCount
Gets the number of layers in the filter.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.IsValid
Gets true if all the Layers exist in the object's database layer table.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.Add(System.String)
Adds the input layer to the set of layers within the filter object that define those entities that pass the filter test. Once layer is added, all entities on layer will be accepted.
layer: Layer name to add.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.Remove(System.String)
Removes the input layer from the filter. This will mean entities NOT on this layer are considered NOT to pass the filtered test.
layer: Layer name to remove.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.GetAt(System.Int32,System.String)
Finds the layer whose index is index and sets name to that layer's name.
index: Index of layer to get.
name: Output name of layer at index index.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.{dtor}
