Autodesk.AutoCAD.DatabaseServices.DataType
Specify the field data type.

Autodesk.AutoCAD.DatabaseServices.DataType.Buffer
Data buffer.

Autodesk.AutoCAD.DatabaseServices.DataType.ObjectId
Object ID.

Autodesk.AutoCAD.DatabaseServices.DataType.Date
Date or time.

Autodesk.AutoCAD.DatabaseServices.DataType.Double
Double value.

Autodesk.AutoCAD.DatabaseServices.DataType.Long
Long value.

Autodesk.AutoCAD.DatabaseServices.DataType.General
General.

Autodesk.AutoCAD.DatabaseServices.DataType.Resbuf
Resbuf structure.

Autodesk.AutoCAD.DatabaseServices.DataType.Point3d
3D point.

Autodesk.AutoCAD.DatabaseServices.DataType.Point
2D point.

Autodesk.AutoCAD.DatabaseServices.DataType.String
String value.

Autodesk.AutoCAD.DatabaseServices.DataType.Unknown
Unitialized or invalid data type.