Autodesk.AutoCAD.DatabaseServices.Helix
Implements the AutoCAD helix entity. Objects of the Helix class contain an embedded Spline which is wrapped by the Helix in order to constrain its behavior so that its basic shape is maintained.

Autodesk.AutoCAD.DatabaseServices.Helix.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Helix.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Helix.TotalLength
Gets the total length of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.TurnSlope
Gets the turn slope angle of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.Constrain
Gets or sets the constrain property of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.Twist
Gets or sets the twist of the helix (clockwise or counterclockwise).

Autodesk.AutoCAD.DatabaseServices.Helix.TurnHeight
Gets or sets the turn height(distance between turns).

Autodesk.AutoCAD.DatabaseServices.Helix.Turns
Gets or sets the number of turns(revolutions).

Autodesk.AutoCAD.DatabaseServices.Helix.TopRadius
Gets or sets the top radius of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.BaseRadius
Gets or sets base radius of the helix. This is always the distance between the start point and the axis point.

Autodesk.AutoCAD.DatabaseServices.Helix.Height
Gets or sets the height of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.AxisVector
Gets or sets vector of the axis of the helix. The vector is always perpendicular to the line joining the start point and the axis point.

Autodesk.AutoCAD.DatabaseServices.Helix.StartPoint
Gets or sets the start point of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.CreateHelix
Creates the helix geometry based on the values set in prior method calls. Without calling this method, no geometry will be visible on the screen.

Autodesk.AutoCAD.DatabaseServices.Helix.GetAxisPoint
Gets the start point of the axis for the helix.
Returns: The start point of the axis for the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.SetAxisPoint(Autodesk.AutoCAD.Geometry.Point3d,System.Boolean)
Sets the start point of the axis for the helix.
axisPoint: The 3D point where the axis starts.
moveStartPoint: Boolean indicating whether to relocate the start point by the same offset that the axis point moved.

Autodesk.AutoCAD.DatabaseServices.Helix.{dtor}
