Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector
This class holds data for intersections of two surfaces.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.#ctor(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Surface)
Constructor.
surface2: Second surface object.
surface1: First surface object.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.#ctor(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Tolerance)
Constructor.
surface2: Second surface object.
surface1: First surface object.
tolerance: Tolerance.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.NumResults
Gets the number of intersection results of any dimension.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.Tolerance
Gets the tolerance.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.Surface2
Gets the second surface object.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.Surface1
Gets the first surface object.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.IntersectCurve(System.Int32,System.Boolean)
Returns null if the dimension of this intersection is not 1.
number: Index of the intersection.
isExternal: Description to come.
Returns: null if the dimension of this intersection is not 1.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.IntersectParameterCurve(System.Int32,System.Boolean,System.Boolean)
If isFirst is true, returns parameter curve on first surface. Otherwise, returns parameter curve on second surface.
number: Index of the intersection.
isExternal: Boolean flag to return curve on first or second surface.
isFirst: Description to come.
Returns: Parameter curve on first surface if isFirst is true. Otherwise, returns parameter curve on second surface.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.IntersectPoint(System.Int32)
Invalid return if the dimension of this intersection is not 0.
number: Index of the intersection.
Returns: Invalid return if the dimension of this intersection is not 0.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.GetIntersectPointParameters(System.Int32)
Description to come.
number: Index of the intersection.
Returns: Description to come.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.GetIntersectionConfigurations(System.Int32)
Description to come.
number: Index of the intersection.
Returns: Description to come.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.GetDimension(System.Int32)
Description to come.
number: Index of the intersection.
Returns: Description to come.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.GetType(System.Int32)
Returns the type of the intersection at index number.
number: Index of the intersection.
Returns: The type of the intersection at index number.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.Set(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Surface)
Sets the surfaces whose intersections are to be computed.
surface1: First surface object.
surface2: Second surface object.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.Set(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Tolerance)
Sets the surfaces whose intersections are to be computed, along with the tolerance.
surface1: First surface object.
surface2: Second surface object.
tolerance: Tolerance.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.{dtor}
