Autodesk.AutoCAD.DatabaseServices.Light
Container for all properties relating to a generic light. A dictionary of these objects is resident in the database, in the named object dictionary as ACAD_LIGHTS. They are indexed by the name of the setting objects. In the user interface, the contents of this dictionary correspond to user-defined light properties (displayed on a property palette accessible by selection of the light using a variety of methods.

Autodesk.AutoCAD.DatabaseServices.Light.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Light.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Light.Name
Gets or sets the name of the light object.

Autodesk.AutoCAD.DatabaseServices.Light.Direction
Gets or sets the direction (vector) that the rays of a distant light travel.

Autodesk.AutoCAD.DatabaseServices.Light.FalloffAngle
Gets the falloff angle of this spot light.

Autodesk.AutoCAD.DatabaseServices.Light.HotspotAngle
Gets the hotspot angle of this spot light.

Autodesk.AutoCAD.DatabaseServices.Light.TargetLocation
Gets or sets the position of the light target location, in the coordinate space of the current context.

Autodesk.AutoCAD.DatabaseServices.Light.Position
Gets or sets the position of the light source, in the coordinate space of the current context.

Autodesk.AutoCAD.DatabaseServices.Light.Attenuation
Gets or sets the light attenuation type, use limits, start limits, and end limits.

Autodesk.AutoCAD.DatabaseServices.Light.Shadow
Gets or sets the shadow parameters: shadow type, mapsize, softness, and on/off.

Autodesk.AutoCAD.DatabaseServices.Light.Intensity
Gets or sets the light intensity.A value of 0.0 indicates that the light is off.

Autodesk.AutoCAD.DatabaseServices.Light.LightColor
Gets or sets the emitted color of the light.

Autodesk.AutoCAD.DatabaseServices.Light.IsPlottable
Gets or sets the plottable state of the light.

Autodesk.AutoCAD.DatabaseServices.Light.IsOn
Gets or sets the Light on/off state.

Autodesk.AutoCAD.DatabaseServices.Light.LightType
Gets or sets the type of the light object. Possible values are: SpotLight, PointLight, and DistantLight.

Autodesk.AutoCAD.DatabaseServices.Light.SetHotspotAndFalloff(System.Double,System.Double)
Sets the hotspot and falloff angles. The region between the hotspot and falloff angles is sometimes referred to as the rapid decay area.
hotspot: The hotspot cone angle, in radians. Defines the brightest part of the spot light beam. Must be smaller than or equal to the falloff.
falloff: The falloff cone angle, in radians. Defines the full cone of light. This is also known as the field angle. Must be larger than the hotspot.

Autodesk.AutoCAD.DatabaseServices.Light.{dtor}
