Autodesk.AutoCAD.DatabaseServices.RenderMode
Specifies the rendering algorithm employed when drawing geometry in that view.

Autodesk.AutoCAD.DatabaseServices.RenderMode.GouraudShadedWithWireframe
Smooth shaded with wireframe overlayed.

Autodesk.AutoCAD.DatabaseServices.RenderMode.FlatShadedWithWireframe
Faceted with wireframe overlayed.

Autodesk.AutoCAD.DatabaseServices.RenderMode.GouraudShaded
Smooth shaded - colors interpolated between vertices.

Autodesk.AutoCAD.DatabaseServices.RenderMode.FlatShaded
Faceted - constant color per face.

Autodesk.AutoCAD.DatabaseServices.RenderMode.HiddenLine
Wireframe display with hidden lines removed.

Autodesk.AutoCAD.DatabaseServices.RenderMode.Wireframe
Same display as k2Doptimized (but using the 3D Pipeline).

Autodesk.AutoCAD.DatabaseServices.RenderMode.Optimized2D
Standard AutoCAD 2D Display.