Autodesk.AutoCAD.DatabaseServices.LayoutRenamedEventArgs
Provides data for LayoutRenamed event of the LayoutManager class.

Autodesk.AutoCAD.DatabaseServices.LayoutRenamedEventArgs.NewName
Gets the new name of the layout.

Autodesk.AutoCAD.DatabaseServices.LayoutRenamedEventArgs.Name
Gets the name of the layout that is changing.

Autodesk.AutoCAD.DatabaseServices.LayoutRenamedEventArgs.Id
Gets the object ID of the layout that is changing.