Autodesk.AutoCAD.DatabaseServices.EndCap
Lineweight endcaps setting for new objects.

Autodesk.AutoCAD.DatabaseServices.EndCap.Round
Lineweight endcap is round.

Autodesk.AutoCAD.DatabaseServices.EndCap.Square
Lineweight endcap is square.

Autodesk.AutoCAD.DatabaseServices.EndCap.Angle
Lineweight endcap is angle.

Autodesk.AutoCAD.DatabaseServices.EndCap.None
Lineweight endcap is none.