Autodesk.AutoCAD.DatabaseServices.MInsertBlock
Represents a special form of the INSERT entity in which an array of duplicate images of the entities within the referenced BlockTableRecord is displayed.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int16,System.Int16,System.Double,System.Double)
This constructor initializes the MInsert object to use the settings passed in as arguments. In addition, the rest of the normal default constructor initialization for the BlockReference parent class takes place.
position: Position in WCS coordinates.
blockTableRecord: Object ID of the AcDbBlockTableRecord to reference.
columns: Number of columns of BlockTableRecord images to display.
rows: Number of rows of BlockTableRecord images to display.
colSpacing: Spacing between columns.
rowSpacing: Spacing between the rows.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.MInsertBlock.RowSpacing
Gets or sets the spacing between the rows of the BlockTableRecord image that will be displayed by the MInsert object.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.ColumnSpacing
Gets or sets the spacing between the columns of the BlockTableRecord image that will be displayed by the MInsert object.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.Rows
Gets or sets the number of rows of the BlockTableRecord image that will be displayed by the MInsert object.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.Columns
Gets or sets the number of columns of the BlockTableRecord image that will be displayed by the MInsert object.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.{dtor}
