Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo
Encapsulates the data returned in the output parameters of the Table.HitTest() ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo.Type
Gets the type of Table hit test.

Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo.Column
Gets row index of the selected cell.

Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo.Row
Gets column index of the selected cell.

Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo.ToString


Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo.ToString(System.IFormatProvider)
