Autodesk.AutoCAD.GraphicsInterface.IlluminationModel
Specifies what illumination model is used in the advanced rendering process when dealing with materials.

Autodesk.AutoCAD.GraphicsInterface.IlluminationModel.MetalShader
Metal Shader. This shader calculates the color of the reflected light using the diffuse color of the material and the color of the light.

Autodesk.AutoCAD.GraphicsInterface.IlluminationModel.BlinnShader
Blinn shader. This shader uses the light's color to determine the color of the reflection.