Autodesk.AutoCAD.DatabaseServices.SegmentType
Identifies the different types of line segments that can make up a polyline.

Autodesk.AutoCAD.DatabaseServices.SegmentType.Empty
This entity has no vertices.

Autodesk.AutoCAD.DatabaseServices.SegmentType.Arc
This is a non-zero length arc segment.

Autodesk.AutoCAD.DatabaseServices.SegmentType.Point
This is a single vertex polyline.

Autodesk.AutoCAD.DatabaseServices.SegmentType.Coincident
This is a zero-length segment.

Autodesk.AutoCAD.DatabaseServices.SegmentType.Line
This is a non-zero length line segment.