Autodesk.AutoCAD.Geometry.Entity3d
Abstract base class for all point set classes. Any class that is derived from this class represents a set of points in 3D space.

Autodesk.AutoCAD.Geometry.Entity3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Entity3d.Clone


Autodesk.AutoCAD.Geometry.Entity3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Entity3d)


Autodesk.AutoCAD.Geometry.Entity3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Entity3d,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.Geometry.Entity3d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transforms the entity by applying the input matrix.
transform: Transformation matrix.

Autodesk.AutoCAD.Geometry.Entity3d.TranslateBy(Autodesk.AutoCAD.Geometry.Vector3d)
Translates the entity by the input vector.
translateVector: Vector by which entity is to be translated.

Autodesk.AutoCAD.Geometry.Entity3d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d)
Rotates the entity by the input angle about the line defined by the input point and vector.
angle: Angle of rotation.
vector: Vector about which entity is to be rotated.
point: Point about which to rotate.

Autodesk.AutoCAD.Geometry.Entity3d.Mirror(Autodesk.AutoCAD.Geometry.Plane)
Transforms the entity by mirroring it across the input plane.
plane: Mirror plane.

Autodesk.AutoCAD.Geometry.Entity3d.ScaleBy(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Scales the entity about the input point by the input scale factor. Input scale factor must be greater than 0.
scaleFactor: Amount by which entity is to be scaled.
point: Point about which entity is to be scaled.

Autodesk.AutoCAD.Geometry.Entity3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d)
Returns true if point lies on entity.
point: Any 3D point.
Returns: true if point lies on entity.

Autodesk.AutoCAD.Geometry.Entity3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if point lies on entity.
point: Any 3D point.
tolerance: Tolerance for tangent intersections.
Returns: true if point lies on entity.

Autodesk.AutoCAD.Geometry.Entity3d.DeleteUnmanagedObject


Autodesk.AutoCAD.Geometry.Entity3d.{dtor}
