Autodesk.AutoCAD.DatabaseServices.BlockTable
This class is the symbol table for BlockTableRecords, which represent block definitions within a drawing database.

Autodesk.AutoCAD.DatabaseServices.BlockTable.{dtor}
