Autodesk.AutoCAD.DatabaseServices.SaveType
Save type.

Autodesk.AutoCAD.DatabaseServices.SaveType.Save14
Save as R14.

Autodesk.AutoCAD.DatabaseServices.SaveType.Save13
Save as R13.

Autodesk.AutoCAD.DatabaseServices.SaveType.Save12
Save as R12.

Autodesk.AutoCAD.DatabaseServices.SaveType.NoSave
No Save.