Autodesk.AutoCAD.GraphicsInterface.Filter


Autodesk.AutoCAD.GraphicsInterface.Filter.Lanczos


Autodesk.AutoCAD.GraphicsInterface.Filter.Mitchell


Autodesk.AutoCAD.GraphicsInterface.Filter.Gauss


Autodesk.AutoCAD.GraphicsInterface.Filter.Triangle


Autodesk.AutoCAD.GraphicsInterface.Filter.Box
