Autodesk.AutoCAD.Geometry.CompositeCurve2d
Represents a composite curve, which is a single curve that consists of any number of component curves that are connected end-to-end.

Autodesk.AutoCAD.Geometry.CompositeCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d[])
Constructs a composite curve from the list of input curves. The input curves should be connected at their endpoints. That is, the start point of each curve in the list (excluding the first curve) should be equal to the endpoint of the previous curve in the list. No check of this is made by the constructor.
curves: List of curves forming a composite curve.

Autodesk.AutoCAD.Geometry.CompositeCurve2d.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.CompositeCurve2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.CompositeCurve2d.GetCurves
Returns the list of the component curves that make up the composite.
Returns: The list of the component curves that make up the composite.

Autodesk.AutoCAD.Geometry.CompositeCurve2d.SetCurves(Autodesk.AutoCAD.Geometry.Curve2d[])
Resets the list of curves that make up the composite. The curves in curves are not deleted when the composite is deleted.
curves: List of curves in the composite curve.

Autodesk.AutoCAD.Geometry.CompositeCurve2d.GlobalToLocalParameter(System.Double)
Takes a parameter value of a point on the composite and returns the parameter value of that same point on the component curve on which it lies.
value: Global parameter.
Returns: The parameter value of that same point on the component curve on which it lies.

Autodesk.AutoCAD.Geometry.CompositeCurve2d.LocalToGlobalParameter(Autodesk.AutoCAD.Geometry.CompositeParameter)
Takes a parameter value of a point on the component curve specified by value and returns the parameter value of that point on the composite curve.
value: A parameter value of a point on the component curve.
Returns: The parameter value of that point on the composite curve.

Autodesk.AutoCAD.Geometry.CompositeCurve2d.{dtor}
