Autodesk.AutoCAD.GraphicsInterface.DiagnosticMode
The available diagnostic visualization modes.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticMode.Off
Render normally (no diagnostic output).

Autodesk.AutoCAD.GraphicsInterface.DiagnosticMode.BSP
Render a false-color image illustrating the cost of creating and traversing the BSP tree used for ray-tracing. Both the depth and the leaf size can be visualized, as specified with DiagnosticBSPMode.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticMode.Samples
Render a grayscale image illustrating sample density. Higher levels of sampling are shown with brighter shades of gray.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticMode.Photon
Render a false-color image of photon density or photon irradiance on all surfaces. Higher density or irradiance is shown red, and lower values are represented with blue.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticMode.Grid
Render a grid on top of all objects in the scene.