Autodesk.AutoCAD.GraphicsInterface.JitterAmount
Describes an enumeration representing the amount of "jitter" to apply to edges.

Autodesk.AutoCAD.GraphicsInterface.JitterAmount.JitterHigh
A large amount of perturbation will be applied to the edge.

Autodesk.AutoCAD.GraphicsInterface.JitterAmount.JitterMedium
A medium amount of perturbation will be applied to the edge.

Autodesk.AutoCAD.GraphicsInterface.JitterAmount.JitterLow
A small amount of perturbation will be applied to the edge.