Autodesk.AutoCAD.DatabaseServices.ObjectEventArgs
Provides data for various object-related events of the database.

Autodesk.AutoCAD.DatabaseServices.ObjectEventArgs.DBObject
Gets the DBObject object that is changed.