Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Procedure
The available types of view content to render (render procedures).

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Procedure.Selected
Render only the selected objects in the view.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Procedure.View
Render the complete contents of the view.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Procedure.Crop
Render only the user-defined rectangular region of the view.