Autodesk.AutoCAD.GraphicsInterface.EdgeStyleApply
Describes an enumeration representing the type of geometry to which the edge styles should be applied.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyleApply.ApplyToAll
Apply the edge style to all geometry.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyleApply.ApplyToDefault
Apply the edge style to the geometry as designed.