Autodesk.AutoCAD.DatabaseServices.BlockInsertionPointsEventArgs
Provides data for the BlockInsertionPoints event of the database.

Autodesk.AutoCAD.DatabaseServices.BlockInsertionPointsEventArgs.#ctor(Autodesk.AutoCAD.DatabaseServices.BlockTableRecord,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3dCollection)
Initializes the circle with the arguments center, normal, and radius.
blockTableRecord: Autodesk.AutoCAD.DatabaseServices.BlockTableRecord object.
points: Autodesk.AutoCAD.Geometry.Point3dCollection object.
alignmentVectors: Autodesk.AutoCAD.Geometry.Vector3dCollection object.

Autodesk.AutoCAD.DatabaseServices.BlockInsertionPointsEventArgs.AlignmentVectors
Gets the AlignmentVectors property value.

Autodesk.AutoCAD.DatabaseServices.BlockInsertionPointsEventArgs.InsertionPoints
Gets the InsertionPoints property value.

Autodesk.AutoCAD.DatabaseServices.BlockInsertionPointsEventArgs.BlockTableRecord
Gets the BlockTableRecord property value.