Autodesk.AutoCAD.DatabaseServices.LayerTableRecord
Represent records in the LayerTable. Each of these records contains the information (color, on or off, frozen or thawed, etc.) about a layer in the drawing database.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.#ctor
Default constructor. Initializes Color to 7 (white); IsFrozen, IsLocked, IsOff, ViewportVisibilityDefault, and IsPlottable to false; and linetype object ID to null.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsHidden
Gets or sets true if the layer is hidden.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.Description
Gets or sets user-defined descriptive text for the layer.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.PlotStyleNameId
Gets or sets the objectId of the entry in the PlotStyleName dictionary for the plotStyleName of the layer table record.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.PlotStyleName
Gets or sets a copy of the PlotStyleName string of the layer table record.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.LineWeight
Gets or sets the DatabaseServices.LineWeight of the layer table record.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsPlottable
Gets or sets true if the layer is plottable.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.LinetypeObjectId
Gets or sets ObjectId referenced by the LinetypeTableRecord if there is a line type referenced by this layer.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.Transparency
Gets or sets the transparency settings of the layer.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.EntityColor
Gets the color settings of the layer in a EntityColor form.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.Color
Gets or sets the color value of the layer.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsLocked
Gets or sets true if and only if the layer is locked.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.ViewportVisibilityDefault
Gets or sets true if the layer is frozen by default in new viewports.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsOff
Gets or sets true if the layer is off.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsFrozen
Gets or sets true if and only if the layer is frozen.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsUsed
Gets false if the layer was not in use when LayerTable.GenerateUsageData() was last called.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.{dtor}
