Autodesk.AutoCAD.DatabaseServices.BlockScaling
Enum whose values control whether block references associated with this block table record can be uniformly or nonuniformly scaled.

Autodesk.AutoCAD.DatabaseServices.BlockScaling.Uniform
Block references associated with this block table record can only be uniformly scaled.

Autodesk.AutoCAD.DatabaseServices.BlockScaling.Any
Block references associated with this block table record can be nonuniformly scaled.