Autodesk.AutoCAD.DatabaseServices.Poly2dType
Polyline2d type.

Autodesk.AutoCAD.DatabaseServices.Poly2dType.CubicSplinePoly
A spline-fit polyline that has a Cubic B-spline path. This reflects that the third bit of DXF group code 70 is set and that DXF group code 75 is set to 6.

Autodesk.AutoCAD.DatabaseServices.Poly2dType.QuadSplinePoly
A spline-fit polyline that has a Quadratic B-spline path. This reflects that the third bit of DXF group code 70 is set and that DXF group code 75 is set to 5.

Autodesk.AutoCAD.DatabaseServices.Poly2dType.FitCurvePoly
A polyline that has been curve fit. This reflects that the second bit of DXF group code 70 is set.

Autodesk.AutoCAD.DatabaseServices.Poly2dType.SimplePoly
A standard polyline with no curve/spline fitting.