Autodesk.AutoCAD.Geometry.Vector3d
Represents a vector in 3D space.

Autodesk.AutoCAD.Geometry.Vector3d.#ctor(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Vector2d)
Constructor. Constructs a 3D vector by the formula uAxis * vec2d.x + vAxis * vec2d.y, where 3D point p and 3D vectors uAxis and vAxis form a coordinate system in planar entity plane.
plane: Plane.
vector2d: Vector.

Autodesk.AutoCAD.Geometry.Vector3d.#ctor(System.Double[])
>Constructor.
xyz: X,Y,Z coordinates.

Autodesk.AutoCAD.Geometry.Vector3d.#ctor(System.Double,System.Double,System.Double)
Constructor. Constructs a 3D vector with coordinates x, y, and z correspondingly.
x: X coordinate.
y: Y coordinate.
z: Z coordinate.

Autodesk.AutoCAD.Geometry.Vector3d.LargestElement
Gets the index of the largest absolute value coordinate of this vector.

Autodesk.AutoCAD.Geometry.Vector3d.LengthSqrd
Gets the square of the Euclidean length of this vector.

Autodesk.AutoCAD.Geometry.Vector3d.Length
Gets the Euclidean length of this vector.

Autodesk.AutoCAD.Geometry.Vector3d.Coordinate(System.Int32)


Autodesk.AutoCAD.Geometry.Vector3d.ZAxis
Gets vector(0, 0, 1).

Autodesk.AutoCAD.Geometry.Vector3d.YAxis
Gets vector(0, 1, 0).

Autodesk.AutoCAD.Geometry.Vector3d.XAxis
Gets vector(1, 0, 0).

Autodesk.AutoCAD.Geometry.Vector3d.Z
Gets second coordinate.

Autodesk.AutoCAD.Geometry.Vector3d.Y
Gets first coordinate.

Autodesk.AutoCAD.Geometry.Vector3d.X
Gets zeroth coordinate.

Autodesk.AutoCAD.Geometry.Vector3d.Convert2d(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns 2D vector with the coordinates corresponding to the decomposition of this vector in the basis uAxis, vAxis in the planar entity plane.
plane: Plane.
Returns: 2D vector with the coordinates corresponding to the decomposition of this vector.

Autodesk.AutoCAD.Geometry.Vector3d.AngleOnPlane(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns the angle between the orthogonal projection of this vector into the plane through the origin with the same normal as planar entity plane and the zeroth basis vector v0 of the planar entity plane provided by the method plane.GetCoordinateSystem(p, v0, v1).
plane: Plane.
Returns: The angle between the orthogonal projection of this vector into the plane through the origin with the same normal as planar entity plane and the zeroth basis vector v0 of the planar entity plane.

Autodesk.AutoCAD.Geometry.Vector3d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transform this vector by pre-multiplying it by the matrix leftSide.
leftSide: Matrix.
Returns: The transformed vector.

Autodesk.AutoCAD.Geometry.Vector3d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Returns 3D point which is the result of rotation of this vector around the line with axis passing through the origin. Rotation angle is given by the argument angle, where positive direction of rotation is defined by the right-hand rule.
angle: Rotation angle.
axis: Axis of rotation.
Returns: 3D point which is the result of rotation of this vector around the line with axis passing through the origin.

Autodesk.AutoCAD.Geometry.Vector3d.Mirror(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the 3D vector which is the result of mirroring of this vector with respect to the plane with the normal normalToPlane passing through the origin.
normalToPlane: Plane normal.
Returns: The 3D vector which is the result of mirroring of this vector.

Autodesk.AutoCAD.Geometry.Vector3d.MultiplyBy(System.Double)


Autodesk.AutoCAD.Geometry.Vector3d.Add(Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Vector3d.Subtract(Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Vector3d.DivideBy(System.Double)


Autodesk.AutoCAD.Geometry.Vector3d.Negate
Negates this vector, namely sets it to be equal to the vector (-x, -y).
Returns: The negative vector.

Autodesk.AutoCAD.Geometry.Vector3d.GetPerpendicularVector
Returns a vector orthogonal to this vector.
Returns: A vector orthogonal to this vector.

Autodesk.AutoCAD.Geometry.Vector3d.GetAngleTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the angle between this vector and the vector vec in the range [0, 2 x Pi].
vector: Vector.
referenceVector: Reference vector.
Returns: The angle between this vector and the vector vec in the range [0, 2 x Pi].

Autodesk.AutoCAD.Geometry.Vector3d.GetAngleTo(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the angle between this vector and the vector vec in the range [0, Pi].
vector: Vector.
Returns: The angle between this vector and the vector vec in the range [0, Pi].

Autodesk.AutoCAD.Geometry.Vector3d.GetNormal
Returns the unit vector codirectional to this vector.
Returns: The unit vector codirectional to this vector.

Autodesk.AutoCAD.Geometry.Vector3d.GetNormal(Autodesk.AutoCAD.Geometry.Tolerance)
Returns the unit vector codirectional to this vector.
tolerance: Tolerance.
Returns: The unit vector codirectional to this vector.

Autodesk.AutoCAD.Geometry.Vector3d.IsUnitLength
Returns true if this vector is equal to its normalization.
Returns: true if this vector is equal to its normalization.

Autodesk.AutoCAD.Geometry.Vector3d.IsUnitLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to its normalization.
tolerance: Tolerance.
Returns: true if this vector is equal to its normalization.

Autodesk.AutoCAD.Geometry.Vector3d.IsZeroLength
Returns true if this vector is a zero length vector.
Returns: true if this vector is a zero length vector.

Autodesk.AutoCAD.Geometry.Vector3d.IsZeroLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is a zero length vector.
tolerance: Tolerance.
Returns: true if this vector is a zero length vector.

Autodesk.AutoCAD.Geometry.Vector3d.IsParallelTo(Autodesk.AutoCAD.Geometry.Vector3d)
Checks if this vector is parallel to the vector vector.
vector: Vector.
Returns: true if this vector is parallel to the vector vector.

Autodesk.AutoCAD.Geometry.Vector3d.IsParallelTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is parallel to the vector vector.
vector: Vector.
tolerance: Tolerance.
Returns: true if this vector is parallel to the vector vector.

Autodesk.AutoCAD.Geometry.Vector3d.IsCodirectionalTo(Autodesk.AutoCAD.Geometry.Vector3d)
Checks if this vector is codirectional to the vector vector.
vector: Vector.
Returns: true if this vector is codirectional to the vector vector.

Autodesk.AutoCAD.Geometry.Vector3d.IsCodirectionalTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is codirectional to the vector vector.
vector: Vector.
tolerance: Tolerance.
Returns: true if this vector is codirectional to the vector vector.

Autodesk.AutoCAD.Geometry.Vector3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.Vector3d)
Checks if this vector is perpendicular to the vector vector.
vector: Vector.
Returns: true if this vector is perpendicular to the vector vector.

Autodesk.AutoCAD.Geometry.Vector3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is perpendicular to the vector vector.
vector: Vector.
tolerance: Tolerance.
Returns: true if this vector is perpendicular to the vector vector.

Autodesk.AutoCAD.Geometry.Vector3d.DotProduct(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the dot product of this vector and vector v.
v: Vector.
Returns: The dot product of this vector and vector v.

Autodesk.AutoCAD.Geometry.Vector3d.CrossProduct(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the cross product of this vector and vector vector.
vector: Vector.
Returns: The cross product of this vector and vector vector.

Autodesk.AutoCAD.Geometry.Vector3d.ProjectTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the 3D vector that is the result of the parallel projection of this vector into the plane with normal planeNormal passing through the origin.
planeNormal: Plane normal.
projectDirection: Direction of projection.
Returns: The 3D vector that is the result of the parallel projection of this vector into the plane with normal planeNormal passing through the origin.

Autodesk.AutoCAD.Geometry.Vector3d.OrthoProjectTo(Autodesk.AutoCAD.Geometry.Vector3d)
Returns a 3D vector which is the result of the orthogonal projection of this point into the plane with normal planeNormal passing through the origin.
planeNormal: Plane normal.
Returns: A 3D vector which is the result of the orthogonal projection of this point into the plane with normal planeNormal passing through the origin.

Autodesk.AutoCAD.Geometry.Vector3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Vector3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.Geometry.Vector3d.Equals(System.Object)


Autodesk.AutoCAD.Geometry.Vector3d.GetHashCode


Autodesk.AutoCAD.Geometry.Vector3d.ToString(System.IFormatProvider)


Autodesk.AutoCAD.Geometry.Vector3d.ToString


Autodesk.AutoCAD.Geometry.Vector3d.ToArray


Autodesk.AutoCAD.Geometry.Vector3d.op_Inequality(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Vector3d.op_Equality(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Vector3d.op_Addition(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Vector3d.op_Subtraction(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Vector3d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Vector3d.op_Multiply(System.Double,Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Vector3d.op_Multiply(Autodesk.AutoCAD.Geometry.Vector3d,System.Double)


Autodesk.AutoCAD.Geometry.Vector3d.op_Division(Autodesk.AutoCAD.Geometry.Vector3d,System.Double)


Autodesk.AutoCAD.Geometry.Vector3d.op_UnaryNegation(Autodesk.AutoCAD.Geometry.Vector3d)
