Autodesk.AutoCAD.DatabaseServices.SectionGeometry
Options for section generation. This enum is used to get and set properties for generated section geometry.

Autodesk.AutoCAD.DatabaseServices.SectionGeometry.CurveTangencyLines
Curve tangency line settings.

Autodesk.AutoCAD.DatabaseServices.SectionGeometry.ForegroundGeometry
Foreground geometry settings.

Autodesk.AutoCAD.DatabaseServices.SectionGeometry.BackgroundGeometry
Background geometry settings.

Autodesk.AutoCAD.DatabaseServices.SectionGeometry.IntersectionFill
Intersection surface settings.

Autodesk.AutoCAD.DatabaseServices.SectionGeometry.IntersectionBoundary
Intersection boundary settings.