Autodesk.AutoCAD.DatabaseServices.LoftOptionsNormalOption
Enumerated type for specifying plane normal lofting.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsNormalOption.UseDraftAngles


Autodesk.AutoCAD.DatabaseServices.LoftOptionsNormalOption.AllNormal
When set to this value, the direction of the surface at the each cross-section will be the same as the plane normal of the cross-section.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsNormalOption.EndsNormal
When set to this value, the direction of the surface at the first and last cross-sections will be the same as the plane normal of the cross-section.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsNormalOption.LastNormal
When set to this value, the direction of the surface at the last cross-section will be the same as the plane normal of the cross-section.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsNormalOption.FirstNormal
When set to this value, the direction of the surface at the first cross-section will be the same as the plane normal of the cross-section.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsNormalOption.NoNormal
When set to this value, plane normal lofting is turned off and the system will compute the surface direction at each cross-section.