Autodesk.AutoCAD.GraphicsInterface.DrawFlags
This is an enumeration of valid bitmasks for calls to the SubEntityTraits.DrawFlags property.

Autodesk.AutoCAD.GraphicsInterface.DrawFlags.DrawBackfaces
Indicates that shells or meshes that are part of the entity or subentity should always draw back-facing triangles. This is useful for 3D surfaces or solids that are no completely closed. Using this falg on closed solids is inefficient, but will still result in correct visual output.

Autodesk.AutoCAD.GraphicsInterface.DrawFlags.None
The default value for draw flags. This indicates no draw flags are active.