Autodesk.AutoCAD.DatabaseServices.ResultBufferEnumerator
This enumerator walks the linked list of an underlying ResultBuffer ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ResultBufferEnumerator.Current


Autodesk.AutoCAD.DatabaseServices.ResultBufferEnumerator.MoveNext
Advances this enumerator to the next node in the ResultBuffer list, or to the first node if the current node is null.
Returns: false if the pointer advances past the end of the list, or if the list is empty.