Autodesk.AutoCAD.Geometry.LinearEntity2d
Abstract base class for all 2D line classes.

Autodesk.AutoCAD.Geometry.LinearEntity2d.Direction
Gets direction vector of line. This vector is a unit vector and points in the direction of increasing parameter value.

Autodesk.AutoCAD.Geometry.LinearEntity2d.PointOnLine
Gets an arbitrary point on the line.

Autodesk.AutoCAD.Geometry.LinearEntity2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.LinearEntity2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d)
Determines if two lines intersect and if so returns their intersection point.
line: Any 2D linear entity.
Returns: Intersection point between two lines.

Autodesk.AutoCAD.Geometry.LinearEntity2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines intersect and if so returns their intersection point.
line: Any 2D linear entity.
tolerance: Tolerance.
Returns: Intersection point between two lines.

Autodesk.AutoCAD.Geometry.LinearEntity2d.Overlap(Autodesk.AutoCAD.Geometry.LinearEntity2d)
Determines if two lines overlap and if so returns the line that coincides with their region of overlap.
line: Any 2D linear entity.
Returns: Linear entity that is coincident with region of overlap.

Autodesk.AutoCAD.Geometry.LinearEntity2d.Overlap(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines overlap and if so returns the line that coincides with their region of overlap.
line: Any 2D linear entity.
tolerance: Tolerance.
Returns: Linear entity that is coincident with region of overlap.

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity2d)
Determines if two lines are parallel.
line: Any 2D linear entity.
Returns: true if two lines are parallel.

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are parallel.
line: Any 2D linear entity.
tolerance: Tolerance.
Returns: true if two lines are parallel.

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity2d)
Determines if two lines are perpendicular to each other.
line: Any 2D linear entity.
Returns: true if two lines are perpendicular to each other.

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are perpendicular to each other.
line: Any 2D linear entity.
tolerance: Tolerance.
Returns: true if two lines are perpendicular to each other.

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsColinearTo(Autodesk.AutoCAD.Geometry.LinearEntity2d)
Determines if two lines are colinear.
line: Any 2D linear entity.
Returns: true if two lines are colinear.

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsColinearTo(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are colinear.
line: Any 2D linear entity.
tolerance: Tolerance.
Returns: true if two lines are colinear.

Autodesk.AutoCAD.Geometry.LinearEntity2d.GetPerpendicularLine(Autodesk.AutoCAD.Geometry.Point2d)
Returns a line that is perpendicular to this line and passes through the input point.
point: Any 2D linear entity.
Returns: Infinite line that is perpendicular to this line and passes through point.

Autodesk.AutoCAD.Geometry.LinearEntity2d.GetLine
Returns an infinite line that is coincident with this line.
Returns: Infinite line that is coincident with this line.

Autodesk.AutoCAD.Geometry.LinearEntity2d.{dtor}
