Autodesk.AutoCAD.DatabaseServices.BeginWblockBlockEventArgs
Provides data for the BeginWblockBlock event of the database.

Autodesk.AutoCAD.DatabaseServices.BeginWblockBlockEventArgs.BlockId
Gets the object ID of the block being wblocked.

Autodesk.AutoCAD.DatabaseServices.BeginWblockBlockEventArgs.From
Gets the database being wblocked.