Autodesk.AutoCAD.Geometry.ErrorCondition


Autodesk.AutoCAD.Geometry.ErrorCondition.OK


Autodesk.AutoCAD.Geometry.ErrorCondition.Arg1InsideThis


Autodesk.AutoCAD.Geometry.ErrorCondition.Arg1OnThis


Autodesk.AutoCAD.Geometry.ErrorCondition.Arg1TooBig


Autodesk.AutoCAD.Geometry.ErrorCondition.LinearlyDependentArg1Arg2Arg3


Autodesk.AutoCAD.Geometry.ErrorCondition.EqualArg2Arg3


Autodesk.AutoCAD.Geometry.ErrorCondition.EqualArg1Arg3


Autodesk.AutoCAD.Geometry.ErrorCondition.EqualArg1Arg2


Autodesk.AutoCAD.Geometry.ErrorCondition.PerpendicularArg1Arg2


Autodesk.AutoCAD.Geometry.ErrorCondition.Arg2


Autodesk.AutoCAD.Geometry.ErrorCondition.Arg1


Autodesk.AutoCAD.Geometry.ErrorCondition.This
