Autodesk.AutoCAD.DatabaseServices.DynamicDimensionChangedEventArgs
Provides data for the OnDynamicDimensionChanged function of the Jig class.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionChangedEventArgs.#ctor(System.Int32,System.Double)
Constructor.
index: The index of the DynamicDimension that is changing.
value: The new value of the DynamicDimension.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionChangedEventArgs.Value
Gets the new value of the DynamicDimension.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionChangedEventArgs.Index
Gets the index of the DynamicDimension that is changing.