Autodesk.AutoCAD.DatabaseServices.InterferenceProtocolExtension
Protocol extension abstract base class.

Autodesk.AutoCAD.DatabaseServices.InterferenceProtocolExtension.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.InterferenceProtocolExtension.CreateInterferenceObjects(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,System.Int32)
Create new Entity instance(s), based on interference between the two provided entities, and append the new entities to the return array.
ent1: Entity 1.
ent2: Entity 2.
flags: Interference flags.
Returns: Array of interference entities.

Autodesk.AutoCAD.DatabaseServices.InterferenceProtocolExtension.{dtor}
