Autodesk.AutoCAD.DatabaseServices.SecurityParameters
Stores information for security operations requested during DWG file I/O.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,Autodesk.AutoCAD.DatabaseServices.SecurityActions,Autodesk.AutoCAD.DatabaseServices.SecurityAlgorithm,System.UInt32,System.UInt32)
Constructor.
password: The password, formatted as a zero-terminated "wide-char" string.
providerName: Name of the cryptography provider.
subject: Name of the certificate (digital ID) subject.
issuer: Name of the certificate (digital ID) issuer.
serialNumber: Serial number of the certificate (digital ID).
comment: Comment to be included with the signature.
timeServer: Name of the time server used for timestamping.
actions: SecurityActions.
algorithm: Algorithm identifier; must be SECURITYPARAMS_ALGID_RC4.
keyLength: Length of the encryption key selected.
providerType: Numeric ID of the cryptography provider.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.TimeServer
Gets or sets name of the time server used for timestamping.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Comment
Gets or sets comment to be included with the signature.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.SerialNumber
Gets or sets serial number of the certificate (digital ID).

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Issuer
Gets or sets name of the certificate (digital ID) issuer.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Subject
Gets or sets name of the certificate (digital ID) subject.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.KeyLength
Gets or sets length of the encryption key selected.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Algorithm
Gets or sets algorithm identifier.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.ProviderName
Gets or sets name of the cryptography provider.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.ProviderType
Gets or sets numeric ID of the cryptography provider.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Password
Gets or sets the password, formatted as a zero-terminated "wide-char" string.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Action
Gets or sets SecurityActions.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.SecurityParameters.GetHashCode


Autodesk.AutoCAD.DatabaseServices.SecurityParameters.ToString


Autodesk.AutoCAD.DatabaseServices.SecurityParameters.ToString(System.IFormatProvider)


Autodesk.AutoCAD.DatabaseServices.SecurityParameters.op_Inequality(Autodesk.AutoCAD.DatabaseServices.SecurityParameters,Autodesk.AutoCAD.DatabaseServices.SecurityParameters)


Autodesk.AutoCAD.DatabaseServices.SecurityParameters.op_Equality(Autodesk.AutoCAD.DatabaseServices.SecurityParameters,Autodesk.AutoCAD.DatabaseServices.SecurityParameters)
