Autodesk.AutoCAD.DatabaseServices.ViewTable
This class is the symbol table for ViewTableRecords, which represent stored views within the drawing database. Within AutoCAD and DXF files this table is known as the "VIEW" table.

Autodesk.AutoCAD.DatabaseServices.ViewTable.{dtor}
