Autodesk.AutoCAD.DatabaseServices.TextHorizontalMode
Horizontal orientation for the text.

Autodesk.AutoCAD.DatabaseServices.TextHorizontalMode.TextFit
THV_FIT.

Autodesk.AutoCAD.DatabaseServices.TextHorizontalMode.TextMid
THV_MID.

Autodesk.AutoCAD.DatabaseServices.TextHorizontalMode.TextAlign
THV_ALIGN.

Autodesk.AutoCAD.DatabaseServices.TextHorizontalMode.TextRight
TH_RIGHT.

Autodesk.AutoCAD.DatabaseServices.TextHorizontalMode.TextCenter
TH_CENT.

Autodesk.AutoCAD.DatabaseServices.TextHorizontalMode.TextLeft
TH_LEFT.