Autodesk.AutoCAD.DatabaseServices.DBVisualStyle
Describes the visual style database object, which contains a collection of properties that can be applied to faces, edges and the display.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.InternalUseOnly
Gets or sets a Boolean indicating whether this visual style is for internal use only and will not be exposed in any UI.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.DisplayStyle
Gets or sets the collection of properties that are applied to the display in a display style.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.EdgeStyle
Gets or sets the collection of properties that are applied to edges.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.FaceStyle
Gets or sets FaceStyle const reference to the collection of properties that are applied to faces.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.Type
Gets or sets the type of this visual style as a value from the VisualStyleType enumeration.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.Description
Gets or sets a string containing the description of this visual style.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.CopyTo(Autodesk.AutoCAD.GraphicsInterface.VisualStyle)
Copies this visual style to the given destination visual style.
pDest: The desination visual style .

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.CopyFrom(Autodesk.AutoCAD.GraphicsInterface.VisualStyle)
Copies the given visual style to this visual style.
pSrc: The visual style to copy from.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.{dtor}
