Autodesk.AutoCAD.Runtime.IExtensionApplication
This optional interface may be implemented by one class, and only one class, in a managed application. If defined, it provides the entry point that AutoCAD uses to initialize and terminate the application that defines it.

Autodesk.AutoCAD.Runtime.IExtensionApplication.Initialize
AutoCAD calls this method when the defining application is loaded. Applications use this method to perform startup initialization tasks.

Autodesk.AutoCAD.Runtime.IExtensionApplication.Terminate
AutoCAD calls this method when the defining application is unloaded. Applications use this method to perform cleanup tasks.