Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.LayerFlags


Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.LayerFlags.Frozen


Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.LayerFlags.Off


Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.LayerFlags.Zero


Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.LayerFlags.None
