Autodesk.AutoCAD.Runtime.SystemObjects
Provides access to the Class Dictionary, Service Dictionary, and Dynamic Linker system objects.

Autodesk.AutoCAD.Runtime.SystemObjects.DynamicLinker
Gets the Dynamic Linker system object.

Autodesk.AutoCAD.Runtime.SystemObjects.ServiceDictionary
Gets the Service Dictionary system object.

Autodesk.AutoCAD.Runtime.SystemObjects.ClassDictionary
Gets the Class Dictionary system object.