Autodesk.AutoCAD.DatabaseServices.UnderlayItem
This interface is implemented by host applications that wish to support underlays. UnderlayDefinition and UnderlayReference objects use this interface to accomplish their mission.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.UsingPartialContent
Gets a boolean indicating whether or not the item is using only some of the content of the sheet/model represented by the item.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.Thumbnail
Gets the preview bitmap for the item.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.Units
Gets the units used by the item.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.Extents
Gets the item's extents in item-model coordinates.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.Name
Gets the name for the item. The name is unique within the file.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.{dtor}
