Autodesk.AutoCAD.DatabaseServices.PlaceHolder
Provides a way to instantiate what is essentially just a DBObject. This class has no data members of its own, nor does it implement any new methods. Its sole intent is to provide objects that can be added to dictionaries so that the dictionary lookup key strings can be associated with object IDs.Objects of this class are used in the Plot Style Name Dictionary.

Autodesk.AutoCAD.DatabaseServices.PlaceHolder.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.PlaceHolder.{dtor}
