Autodesk.AutoCAD.DatabaseServices.PolygonMesh
Represents the polygon mesh entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.#ctor(Autodesk.AutoCAD.DatabaseServices.PolyMeshType,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Boolean,System.Boolean)
This constructor initializes the PolygonMesh with the parameters passed in. In addition, the polyline flag's fifth bit is set (to indicate that the entity is a PolygonMesh) and the Smooth surface density in M and N directions is initialized to 0.
type: PolyMeshType for the PolygonMesh.
size: Vertex count in the M direction (must be 2-256).
sizeValue: Vertex count in the N direction (must be 2-256).
vertices: Array of points to be used as vertices for the PolygonMesh.
closedValue: Boolean indicates whether or not the mesh is closed in the M direction.
closed: Boolean indicates whether or not the mesh is closed in the N direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.#ctor
Default constructor.Initializes the polyline flag to 16 (indicating a PolygonMesh open in both M and N directions). Initializes to 0 the MeshType, vertices in M direction, vertices in N direction, Smooth surface density in M direction, and Smooth surface density in N direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.PolygonMesh.NSurfaceDensity
Gets or sets the surface density in the N direction. The N surface density is the number of vertices in the N direction after a surface fit operation is performed.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MSurfaceDensity
Gets or setsthe surface density in the M direction. The M surface density is the number of vertices in the M direction after a surface fit operation is performed.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.IsNClosed
Gets true if the PolygonMesh is closed in the N direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.IsMClosed
Gets true if the PolygonMesh is closed in the M direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.NSize
Gets or sets the vertex count in the N direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MSize
Gets or sets the vertex count in the M direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.PolyMeshType
Gets or sets the PolyMeshType of the PolygonMesh.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.ConvertToPolyMeshType(Autodesk.AutoCAD.DatabaseServices.PolyMeshType)
Uses the SurfaceFit() method to convert the PolygonMesh to the type specified by the newVal argument value.
newVal: Type to which the polygon mesh should be converted.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeMClosed
Sets the PolygonMesh to be closed in the M direction. This means that the mesh will be treated as continuous from the last row on to the first row.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeMOpen
Sets the PolygonMesh to be open in the M direction. This means that the mesh will be discontinuous between the last row and the first row.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeNClosed
Sets the PolygonMesh to be closed in the N direction. This means that the mesh will be treated as continuous from the last column on to the first column.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeNOpen
Sets the PolygonMesh to be open in the N direction. This means that the mesh will be discontinuous between the last column and the first column.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.Straighten
Removes all spline-fit vertices and restores the original control point polygon mesh. This operation performs the same modification as the PEDIT command "Desmooth" option.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.SurfaceFit(Autodesk.AutoCAD.DatabaseServices.PolyMeshType,System.Int32,System.Int32)
Surface fits the polyline using the surfType, surfu, and surfv argument values. This is the same as the PEDIT command's "SMOOTH SURFACE" option except that this method uses the passed in control values whereas PEDIT uses those in the database.
surfType: Surface type.
surfU: Surface density in the M direction (an integer value between 2 and 200).
surfV: Surface density in the N direction (An integer value between 2 and 200).

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.SurfaceFit
Fits a smooth surface to a control point mesh defined by vertices of this polygonal mesh. This operation performs the same modification as the PEDIT command "Smooth surface" option.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.AppendVertex(Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex)
Appends the PolygonMeshVertex object defined by toAppend to the vertex list of the PolygonMesh, establishes the PolygonMesh as the vertex's owner, and adds the vertex to the database that contains the PolygonMesh (the PolygonMesh must be database-resident for this method to succeed).
toAppend: Vertex to append to mesh.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.GetEnumerator
Gets enumerator that can be used to iterate over the vertices of the PolygonMesh.
Returns: An enumerator that can be used to iterate over the vertices of the PolygonMesh.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.{dtor}
