Autodesk.AutoCAD.DatabaseServices.NurbsData
Encapsulates the data returned by the Spline.NurbsData property.

Autodesk.AutoCAD.DatabaseServices.NurbsData.KnotTolerance


Autodesk.AutoCAD.DatabaseServices.NurbsData.ControlPointTolerance


Autodesk.AutoCAD.DatabaseServices.NurbsData.Periodic
Gets true if the spline is periodic. A periodic spline is a spline with period T such that the point at parameter t + T is equal to the point at parameter t for any value of t.

Autodesk.AutoCAD.DatabaseServices.NurbsData.Closed
Gets true if the spline is closed.

Autodesk.AutoCAD.DatabaseServices.NurbsData.Rational
Gets true if the spline is rational.

Autodesk.AutoCAD.DatabaseServices.NurbsData.Degree
Gets degree of spline.

Autodesk.AutoCAD.DatabaseServices.NurbsData.GetControlPoints
Returns array of control points (in WCS coordinates) of the spline.
Returns: Array of control points (in WCS coordinates) of the spline.

Autodesk.AutoCAD.DatabaseServices.NurbsData.GetKnots
Returns array of knot values of the spline.
Returns: Array of knot values of the spline.

Autodesk.AutoCAD.DatabaseServices.NurbsData.GetWeights
Returns array of weights for the control points of the spline. If the spline is not rational, this array will be empty.
Returns: Array of weights for the control points of the spline.

Autodesk.AutoCAD.DatabaseServices.NurbsData.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.NurbsData)


Autodesk.AutoCAD.DatabaseServices.NurbsData.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.NurbsData,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.DatabaseServices.NurbsData.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.NurbsData.GetHashCode


Autodesk.AutoCAD.DatabaseServices.NurbsData.op_Inequality(Autodesk.AutoCAD.DatabaseServices.NurbsData,Autodesk.AutoCAD.DatabaseServices.NurbsData)


Autodesk.AutoCAD.DatabaseServices.NurbsData.op_Equality(Autodesk.AutoCAD.DatabaseServices.NurbsData,Autodesk.AutoCAD.DatabaseServices.NurbsData)
