Autodesk.AutoCAD.DatabaseServices.FieldFilingOptions
Specifies the filing option set by the field evaluators.

Autodesk.AutoCAD.DatabaseServices.FieldFilingOptions.SkipFilingResult
Do not file out the cached evaluation result with the field.