Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d
Represents the intersection set of two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an object that represents the intersection of the two input curves.
curve1: First curve.
curve2: Second curve.
range1: First range interval.
range2: Second range interval.
planeNormal: Plane normal.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an object that represents the intersection of the two input curves. Intersection points and overlaps are only returned if they are within the two specified parameter ranges. Intersection points are returned within the accuracy of the specified tolerance (or to within the default tolerance if no tolerance parameter is specified).
curve1: First curve.
curve2: Second curve.
range1: First range interval.
range2: Second range interval.
planeNormal: Plane normal.
tolerance: Tolerance value.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an object that represents the intersection of the two input curves.
curve1: First curve.
curve2: Second curve.
planeNormal: Plane normal.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an object that represents the intersection of the two input curves.
curve1: First curve.
curve2: Second curve.
tolerance: Tolerance value.
planeNormal: Plane normal.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor
This default constructor is used as a placeholder where the curves are specified by a subsequent call to one of the Set() methods. This constructor sets the two curves to be the infinite lines represented by the X and Y axes.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.NumberOfIntersectionPoints
Gets the number of intersection points between the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Tolerance
Gets the tolerance that will be used when intersecting the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.PlaneNormal
Gets the plane normal.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Curve2
Gets the second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Curve1
Gets the first curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetIntersectionRanges
Returns the two intervals for which intersection points.
Returns: The two intervals for which intersection points.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetIntersectionPoint(System.Int32)
Returns the specified intersection point.
number: Index to the intersection desired.
Returns: The specified intersection point.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetIntersectionParameters(System.Int32)
Returns the parameter values on each curve of the specified intersection point.
intersection: Index to the intersection desired.
Returns: The parameter values on each curve of the specified intersection point.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetPointOnCurve1(System.Int32)
Returns the specified intersection point as a PointOnCurve3d object of the first curve.
intersection: Index to the intersection desired.
Returns: Intersection point on the first curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetPointOnCurve2(System.Int32)
Returns the specified intersection point as a PointOnCurve3d object of the second curve.
intersection: Index to the intersection desired.
Returns: Intersection point on the second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.IsTangential(System.Int32)
Returns a boolean indicating whether the specified intersection point is a tangential intersection.
intersection: Index to the intersection desired.
Returns: A boolean indicating whether the specified intersection point is a tangential intersection.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.IsTransversal(System.Int32)
Returns a boolean indicating whether the specified intersection point is a transversal intersection.
intersection: Index to the intersection desired.
Returns: A boolean indicating whether the specified intersection point is a transversal intersection.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetIntersectionPointTolerance(System.Int32)
Returns the tolerance that was used to find the specified intersection point.
intersection: Index to the intersection desired.
Returns: The tolerance that was used to find the specified intersection point.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.OverlapCount
Returns the number of intervals of overlap between the two curves.
Returns: The number of intervals of overlap between the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.OverlapDirection
Returns true if the two curves are oriented in the same direction where they overlap.
Returns: true if the two curves are oriented in the same direction where they overlap.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetOverlapRanges(System.Int32)
Returns the intervals of overlap of each curve of the specified overlap.
overlap: Number of overlaps to get intervals for.
Returns: The intervals of overlap of each curve of the specified overlap.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.OrderWithRegardsTo1
Reorders intersection points so that they will be returned in increasing parameter values with respect to the first curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.OrderWithRegardsTo2
Reorders intersection points so that they will be returned in increasing parameter values with respect to the second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Vector3d)
Resets the two curves that are to be intersected and resets the intervals.
curve1: First curve.
curve2: Second curve.
range1: First range interval.
range2: Second range interval.
planeNormal: Normal to both curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Resets the two curves that are to be intersected and resets the intervals.
curve1: First curve.
curve2: Second curve.
range1: First range interval.
range2: Second range interval.
planeNormal: Normal to both curves.
tolerance: Tolerance value.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d)
Resets the two curves that are to be intersected.
curve1: First curve.
curve2: Second curve.
planeNormal: Normal to both curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Resets the two curves that are to be intersected.
curve1: First curve.
curve2: Second curve.
planeNormal: Normal to both curves.
tolerance: Tolerance value.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.{dtor}
