Autodesk.AutoCAD.Geometry.Line2d
Represents an unbounded line in 2D space.

Autodesk.AutoCAD.Geometry.Line2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs an unbounded line that passes through point1 and point2. point1 and point2 must not be the same point.
point1: Any 2D point.
point2: Any 2D point different from point1.

Autodesk.AutoCAD.Geometry.Line2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs an unbounded line that passes through point and has a direction of vector. vector must not be a zero-length vector.
point: Any 2D point.
vector: Any 2D vector.

Autodesk.AutoCAD.Geometry.Line2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Line2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Changes the definition of the line to pass through point1 and point2. point1 and point2 must not be the same point.
point1: Any 2D point.
point2: Any 2D point different from point1.

Autodesk.AutoCAD.Geometry.Line2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Changes the definition of the line to pass through pnt in the direction of vector. vector must not be a zero-length vector.
point: Any 2D point.
vector: Any 2D vector.

Autodesk.AutoCAD.Geometry.Line2d.{dtor}
