Autodesk.AutoCAD.Geometry.Cylinder
Represents a bounded cylinder surface.

Autodesk.AutoCAD.Geometry.Cylinder.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Interval,System.Double,System.Double)
Constructs a bounded cylinder defined by the input data.
radius: Cylinder radius.
origin: Base point on the cylinder axis.
axisOfSymmetry: Axis of rotation.
referenceAxis: Reference vector on the base circle.
height: Interval on the axis referred by the origin.
startAngle: Start angle on the base circle.
endAngle: End angle on the base circle.

Autodesk.AutoCAD.Geometry.Cylinder.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an infinite cylinder defined by the input data.
radius: First curve.
origin: First curve.
axisOfSymmetry: First curve.

Autodesk.AutoCAD.Geometry.Cylinder.Height
Gets or sets interval on the axis parameterized by the origin and the axis vector.

Autodesk.AutoCAD.Geometry.Cylinder.IsOuterNormal
Gets true if the surface normal is pointing outwards.

Autodesk.AutoCAD.Geometry.Cylinder.ReferenceAxis
Gets reference vector on the base circle.

Autodesk.AutoCAD.Geometry.Cylinder.AxisOfSymmetry
Gets vector indicating the rotation axis.

Autodesk.AutoCAD.Geometry.Cylinder.Origin
Gets origin of the cylinder.

Autodesk.AutoCAD.Geometry.Cylinder.Radius
Gets or sets radius of the cylinder.

Autodesk.AutoCAD.Geometry.Cylinder.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Cylinder.GetAngles
Returns start and end angles on the base circle.
Returns: Start and end angles on the base circle.

Autodesk.AutoCAD.Geometry.Cylinder.GetHeightAt(System.Double)
Returns the input parameter converted into the parameterization defined by the origin and the axis vector.
parameter: Parameter from cylinder domain.
Returns: The input parameter converted into the parameterization defined by the origin and the axis vector.

Autodesk.AutoCAD.Geometry.Cylinder.IsClosed
Returns flag indicating if cylindrical segment is a full circular cylinder with respect to the tolerance specified.
Returns: true if cylindrical segment is a full circular cylinder with respect to the tolerance specified.

Autodesk.AutoCAD.Geometry.Cylinder.IsClosed(Autodesk.AutoCAD.Geometry.Tolerance)
Returns flag indicating if cylindrical segment is a full circular cylinder with respect to the tolerance specified.
tolerance: Tolerance.
Returns: true if cylindrical segment is a full circular cylinder with respect to the tolerance specified.

Autodesk.AutoCAD.Geometry.Cylinder.SetAngles(System.Double,System.Double)
Changes cylinder definition to satisfy the input data.
startAngle: Start angle.
endAngle: End angle.

Autodesk.AutoCAD.Geometry.Cylinder.Set(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Interval,System.Double,System.Double)
Changes cylinder definition to satisfy the input data.
radius: Cylinder radius.
origin: Base point on the cylinder axis.
axisOfSymmetry: Axis of rotation.
referenceAxis: Reference vector on the base circle.
height: Interval on the axis referred by the origin.
startAngle: Start angle on the base circle.
endAngle: End angle on the base circle.

Autodesk.AutoCAD.Geometry.Cylinder.Set(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes cylinder definition to satisfy the input data.
radius: First curve.
origin: First curve.
axisOfSymmetry: First curve.

Autodesk.AutoCAD.Geometry.Cylinder.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Computes the intersections with a linear entity.
linearEntity: Any linear entity.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.Cylinder.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Computes the intersections with a linear entity.
linearEntity: Any linear entity.
tolerance: Tolerance for tangent intersections.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.Cylinder.{dtor}
