Autodesk.AutoCAD.Geometry.Line3d
Represents an unbounded line in 3D space.

Autodesk.AutoCAD.Geometry.Line3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs an unbounded line that passes through point1 and point2. point1 and point2 must not be the same point.
point1: Any 3D point.
point2: Any 3D point different from point1.

Autodesk.AutoCAD.Geometry.Line3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an unbounded line that passes through point and has a direction of vector. vector must not be a zero-length vector.
point: Any 3D point.
vector: Any 3D vector.

Autodesk.AutoCAD.Geometry.Line3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Line3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes the definition of the line to pass through point1 and point2. point1 and point2 must not be the same point.
point1: Any 3D point.
point2: Any 3D point different from point1.

Autodesk.AutoCAD.Geometry.Line3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes the definition of the line to pass through and has a direction of vector. vector must not be a zero-length vector.
point: Any 3D point.
vector: Any 3D vector.

Autodesk.AutoCAD.Geometry.Line3d.{dtor}
