Autodesk.AutoCAD.DatabaseServices.BulgeVertex.#ctor(Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Constructor.
point: Autodesk.AutoCAD.Geometry.Point2d object.
bulge: System.Double object.

Autodesk.AutoCAD.DatabaseServices.BulgeVertex.Bulge
Gets or sets the Bulge property value.

Autodesk.AutoCAD.DatabaseServices.BulgeVertex.Vertex
Gets or sets the Vertex property value.