Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits
Represents mental ray specific render settings to the underlying display system.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.EnergyMultiplier
Gets or sets the energy multiplier value. This value is used to control the magnitude of indirect illumination.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ModelScaleFactor
Gets or sets the model scale factor relative to meters. For example, if the model is drawn in mm, the scael factor is 0.001.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.DiagnosticBackgroundEnabled
Gets or sets the type of photon information to visualize with the photon diagnostic mode.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ProgressMonitor
Gets or sets the progress monitor.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.MemoryLimit
Gets or sets the maximum amount of memory (in MB) that the renderer will allocate for rendering.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.TileOrder
Gets or sets the sequence (order) used to render image tiles.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.TileSize
Gets or sets the size of the image tiles to use when rendering.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ExportMIFileName
Gets or sets the full path and file name to use for an exported MI file.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ExportMIEnabled
Gets or sets Boolean indicating whether to export an MI file after rendering.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.DiagnosticBSPMode
Gets or sets the type of diagnostic BSP mode in use.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.DiagnosticPhotonMode
Gets or sets the type of photon information to visualize with the photon diagnostic mode.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.DiagnosticGridMode
Gets or sets the coordinate system to use for the diagnostic grid including the distance between grid lines (size).

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.DiagnosticMode
Gets or sets the type of diagnostic mode being used.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.LightLuminanceScale
Gets or sets the luminance scale.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.FGSampleRadius
Gets or sets the minimum and maximum radii of the area used to sample final gather points to compute indirect illumination.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.FGSampleRadiusState
Gets or sets the flags indicating which user-defined final gathering sampling radii are used, and what units they are defined in.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.FGRayCount
Gets or sets the number of final gather rays to be used for each final gather point.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.FinalGatheringEnabled
Gets or sets boolean indicating whether final gathering is applied.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.PhotonTraceDepth
Gets or sets the maximum trace depth (recursion level) for photons.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.GIPhotonsPerLight
Gets or sets the average number of GI photons to shoot for each light. The default value is 10000.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.GISampleRadius
Gets or sets radius of the area used to sample photons for global illumination.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.GISampleRadiusEnabled
Gets or sets a Boolean indicating whether the user-defined photon sampling radius is used.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.GISampleCount
Gets or sets the maximum number of photons near a render sample point to use for computing global illumination.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.GlobalIlluminationEnabled
Gets or sets a Boolean indicating whether global illumination (using photon mapping) is computed.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.RayTraceDepth
Gets or sets the maximum trace depth (recursion level) for rays.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.RayTraceEnabled
Gets or sets a Boolean indicating whether ray-tracing is performed.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ShadowMapEnabled
Gets or sets true if shadow maps are computed.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.ShadowMode
Gets or sets ray-traced shadows.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.SamplingContrastColor
Gets or sets the threshold above which further samples will be taken, per color channel.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.SamplingFilter
Gets or sets the filtering parameters for combining multiple samples into a single pixel color.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.Sampling
Gets or sets the minimum and maximum numbers of samples to take when shading a pixel during rendering.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraits.{dtor}
