Autodesk.AutoCAD.DatabaseServices.MText
Represents the MTEXT entity type within AutoCAD.An MTEXT object is a multiline text entity that stores a specified line width and performs automatic word wrap to keep the text within this width boundary.

Autodesk.AutoCAD.DatabaseServices.MText.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.MText.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.MText.UseBackgroundColor
Gets or sets true if background color is in use for this object.

Autodesk.AutoCAD.DatabaseServices.MText.BackgroundTransparency
Gets or sets the background fill transparency value in the transp output parameter if background fill is defined for this object.

Autodesk.AutoCAD.DatabaseServices.MText.BackgroundScaleFactor
Gets or sets the background scale factor in the scale output parameter if background fill is defined for this object.

Autodesk.AutoCAD.DatabaseServices.MText.BackgroundFillColor
Gets or sets the current background fill color in the color output parameter if background fill is defined for this object.

Autodesk.AutoCAD.DatabaseServices.MText.BackgroundFill
Gets or sets a Boolean value indicating whether background fill is on.

Autodesk.AutoCAD.DatabaseServices.MText.LineSpacingFactor
Gets or sets the line spacing factor (a value between 0.25 and 4.00).

Autodesk.AutoCAD.DatabaseServices.MText.LineSpacingStyle
Gets or sets the line spacing style.

Autodesk.AutoCAD.DatabaseServices.MText.BlockEnd
Gets the string "\}". This property can be used in place of the string constant "\}" in order to make your code more understandable. When used in the string that's returned from MText.Contents , the "\}" indicates a block ending.

Autodesk.AutoCAD.DatabaseServices.MText.BlockBegin
Gets the string "\{". This property can be used in place of the string constant "\{" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\{" indicates a block beginning.

Autodesk.AutoCAD.DatabaseServices.MText.AlignChange
Gets the string "\A". This property can be used in place of the string constant "\A" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\A" indicates an alignment change.

Autodesk.AutoCAD.DatabaseServices.MText.StackStart
Gets the string "\S". This property can be used in place of the string constant "\S" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\S" indicates a stack start.

Autodesk.AutoCAD.DatabaseServices.MText.ParagraphBreak
Gets the string "\P". This property can be used in place of the string constant "\P" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\P" indicates a paragraph break.

Autodesk.AutoCAD.DatabaseServices.MText.LineBreak
Gets the string "\p". This property can be used in place of the string constant "\p" in order to make your code more understandable. When used in a string that is returned from MText.Contents, the "\p" indicates a line break.

Autodesk.AutoCAD.DatabaseServices.MText.TrackChange
Gets the string "\T". This property can be used in place of the string constant "\T" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\T" indicates a tracking change.

Autodesk.AutoCAD.DatabaseServices.MText.ObliqueChange
Gets the string "\Q". This property can be used in place of the string constant "\Q" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\Q" indicates an oblique change.

Autodesk.AutoCAD.DatabaseServices.MText.WidthChange
Gets the string "\W". This property can be used in place of the string constant "\W" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\W" indicates a width change.

Autodesk.AutoCAD.DatabaseServices.MText.HeightChange
Gets the string "\H". This property can be used in place of the string constant "\H" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\H" indicates a height change.

Autodesk.AutoCAD.DatabaseServices.MText.FontChange
Gets the string "\F". This property can be used in place of the string constant "\F" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\F" indicates a font change.

Autodesk.AutoCAD.DatabaseServices.MText.ColorChange
Gets the string "\C". This property can be used in place of the string constant "\C" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\C" indicates a color change.

Autodesk.AutoCAD.DatabaseServices.MText.UnderlineOff
Gets the string "\l". This property can be used in place of the string constant "\l" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\l" indicates underline off.

Autodesk.AutoCAD.DatabaseServices.MText.UnderlineOn
Gets the string "\L". This property can be used in place of the string constant "\L" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\L" indicates underline on.

Autodesk.AutoCAD.DatabaseServices.MText.OverlineOff
Gets the string "\o". This property can be used in place of the string constant "\o" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\o" indicates overline off.

Autodesk.AutoCAD.DatabaseServices.MText.OverlineOn
Gets the string "\O". This property can be used in place of the string constant "\O" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\O" indicates overline off.

Autodesk.AutoCAD.DatabaseServices.MText.NonBreakSpace
Gets the string "\~". This property can be used in place of the string constant "\~" in order to make your code more understandable. When used in the string that's returned from MText.Contents, the "\~" indicates a nonbreaking space.

Autodesk.AutoCAD.DatabaseServices.MText.ActualWidth
Gets the overall width of the bounding rectangle that surrounds the formatted text. Note that this value may be different from the value returned by MText.Width.

Autodesk.AutoCAD.DatabaseServices.MText.ActualHeight
Gets the overall height of the bounding rectangle that surrounds the formatted text.

Autodesk.AutoCAD.DatabaseServices.MText.Contents
Gets or sets a copy of the character contents of the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.FlowDirection
Gets or sets the direction that the text string follows from its start to its finish.

Autodesk.AutoCAD.DatabaseServices.MText.Attachment
Gets or sets a value describing the attachment point for the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.TextHeight
Gets or sets the nominal text height of the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.TextStyle
Gets or sets the ObjectId of the textStyle currently referenced by the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.Descent
Gets the height of the maximum descender for the last line of the text.

Autodesk.AutoCAD.DatabaseServices.MText.Ascent
Gets the height of the maximum ascender for the first line of the text.

Autodesk.AutoCAD.DatabaseServices.MText.Width
Gets or sets the maximum width setting used by the MText object for word wrap formatting.

Autodesk.AutoCAD.DatabaseServices.MText.Rotation
Gets or sets the angle between the X axis of the OCS for the normal vector of the current AutoCAD editor's UCS and the projection of the MText object's direction vector onto the plane of the AutoCAD editor's current UCS. The rotation value is in radians, with positive angles as counterclockwise when looking down the UCS normal towards the UCS origin.

Autodesk.AutoCAD.DatabaseServices.MText.Direction
Gets or sets a Vector3d (in WCS) representing the X axis ("horizontal") for the MText.

Autodesk.AutoCAD.DatabaseServices.MText.Normal
Gets or sets a Vector3d (in WCS) containing the unit normal vector of the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.Location
Gets or sets a Point3d (in WCS coordinates) containing the insertion point of the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.SetAttachmentMovingLocation(Autodesk.AutoCAD.DatabaseServices.AttachmentPoint)
Changes the attachment of the MTEXT object, just as Attachment property does, however it also moves the location (as per setLocation) in order to keep the current extent unchanged. This differs from Attachment property, which keeps the Location constant, thus moving the extent relative to that location.
value: Desired AttachmentPoint type value.

Autodesk.AutoCAD.DatabaseServices.MText.SetContentsRtf(System.String)
Sets the contents of the MText object from the RTF-encoded text string pointed to by unnamed. RTF codes are translated to MText codes. Fonts, colors, tabs, and indents are preserved. Bullets and numbered lists are mapped to hanging paragraphs using the implied setting for tabs and indents.
value: RTF-encoded string.
Returns: 0 if successful.

Autodesk.AutoCAD.DatabaseServices.MText.CorrectSpelling
Intended to be used internally, and requires that additional speller initialization be performed before calling. It cannot be used from within ObjectARX applications.
Returns: 0 if successful.

Autodesk.AutoCAD.DatabaseServices.MText.GetBoundingPoints
Returns an array of points (in WCS) defining bounding box of text as displayed on screen.
Returns: An array of points (in WCS) defining bounding box of text as displayed on screen.

Autodesk.AutoCAD.DatabaseServices.MText.ExplodeFragments(Autodesk.AutoCAD.DatabaseServices.MTextFragmentCallback)
Runs through the MText object's text string breaking it up into fragments, calling the fragment elaboration function enumerator for each fragment.
enumerator: A fragment elaboration callback function.

Autodesk.AutoCAD.DatabaseServices.MText.ExplodeFragments(Autodesk.AutoCAD.DatabaseServices.MTextFragmentCallback,System.Object)
Runs through the MText object's text string breaking it up into fragments, calling the fragment elaboration function enumerator for each fragment.
enumerator: A fragment elaboration callback function.
userData: Anything desired to pass into enumerator.

Autodesk.AutoCAD.DatabaseServices.MText.ExplodeFragments(Autodesk.AutoCAD.DatabaseServices.MTextFragmentCallback,System.Object,Autodesk.AutoCAD.GraphicsInterface.WorldDraw)
Runs through the MText object's text string breaking it up into fragments, calling the fragment elaboration function enumerator for each fragment. If the default of null is used for the context argument, the current WorldDraw object is used.
enumerator: A fragment elaboration callback function.
userData: Anything desired to pass into enumerator.
context: WorldDraw object.

Autodesk.AutoCAD.DatabaseServices.MText.{dtor}
