Autodesk.AutoCAD.DatabaseServices.CellAlignment
Enums specify how text will be aligned in a table cell and are available for horizontally oriented text only.

Autodesk.AutoCAD.DatabaseServices.CellAlignment.BottomRight
Right-justifies text at a point specified for the bottom of the text within a text table cell.

Autodesk.AutoCAD.DatabaseServices.CellAlignment.BottomCenter
Centers text at a point specified for the bottom of the text within a text table cell.

Autodesk.AutoCAD.DatabaseServices.CellAlignment.BottomLeft
Left-justifies text at a point specified for the bottom of the text within a text table cell.

Autodesk.AutoCAD.DatabaseServices.CellAlignment.MiddleRight
Right-justifies text at a point specified for the middle of the text within a text table cell.

Autodesk.AutoCAD.DatabaseServices.CellAlignment.MiddleCenter
Centers text at a point specified for the middle of the text within a text table cell.

Autodesk.AutoCAD.DatabaseServices.CellAlignment.MiddleLeft
Left-justifies text at a point specified for the middle of the text within a text table cell.

Autodesk.AutoCAD.DatabaseServices.CellAlignment.TopRight
Right-justifies text at a point specified for the top of the text within a text table cell.

Autodesk.AutoCAD.DatabaseServices.CellAlignment.TopCenter
Centers text at a point specified for the top of the text within a text table cell.

Autodesk.AutoCAD.DatabaseServices.CellAlignment.TopLeft
Left-justifies text at a point specified for the top of the text within a text table cell.