Autodesk.AutoCAD.DatabaseServices.AddObjectSnapInfo
This callback function is implemented by the client to calculate the object snap points for a given object. The object and other contextual information are passed in the context parameter, while the result parameter must be filled with the object snap information calculated.