Autodesk.AutoCAD.Runtime.RXObject
This is a base class for classes whose objects require runtime-identifiable classes, and runtime analysis of the ancestry of a class. Implemented to support registration of new classes from ObjectARX applications at runtime.

Autodesk.AutoCAD.Runtime.RXObject.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Runtime.RXObject.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Runtime.RXObject.GetClass(System.Type)
Looks up and returns the RXClass object that corresponds to type.
type: Type.
Returns: The RXClass object that corresponds to type.

Autodesk.AutoCAD.Runtime.RXObject.X(Autodesk.AutoCAD.Runtime.RXClass)
Searches for a protocol extension object associated with this class.
protocolClass: RXClass object of the protocol extension class being searched for.
Returns: The pointer to protocol extension object.

Autodesk.AutoCAD.Runtime.RXObject.QueryX(Autodesk.AutoCAD.Runtime.RXClass)
Searches for a protocol extension object associated with this object.
protocolClass: RXClass object of the protocol extension class being searched for.
Returns: The pointer to protocol extension object.

Autodesk.AutoCAD.Runtime.RXObject.GetRXClass
Returns the RXClass object for the class of the object in which this method is called.
Returns: The RXClass object for the class of the object.

Autodesk.AutoCAD.Runtime.RXObject.CompareTo(System.Object)


Autodesk.AutoCAD.Runtime.RXObject.Clone
Creates a clone of the object and returns the clone. If the method is not successful in creating the clone, then null is returned.
Returns: A clone of the object.

Autodesk.AutoCAD.Runtime.RXObject.CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
Copies source into this object.
source: Source object.

Autodesk.AutoCAD.Runtime.RXObject.DeleteUnmanagedObject


Autodesk.AutoCAD.Runtime.RXObject.{dtor}
