Autodesk.AutoCAD.Colors.Transparency
Provides transparency information about a Drawable object.

Autodesk.AutoCAD.Colors.Transparency.#ctor(System.Byte)


Autodesk.AutoCAD.Colors.Transparency.#ctor(Autodesk.AutoCAD.Colors.TransparencyMethod)


Autodesk.AutoCAD.Colors.Transparency.IsSolid
Gets true if the transparency method is TransparencyMethod.ByAlpha and the alpha value is 255.

Autodesk.AutoCAD.Colors.Transparency.IsClear
Gets true if the transparency method is TransparencyMethod.ByAlpha and the alpha value is zero.

Autodesk.AutoCAD.Colors.Transparency.IsByLayer
Gets true if the transparency method is TransparencyMethod.ByLayer.

Autodesk.AutoCAD.Colors.Transparency.IsByBlock
Gets true if the transparency method is TransparencyMethod.ByBlock.

Autodesk.AutoCAD.Colors.Transparency.IsByAlpha
Gets true if the transparency method is TransparencyMethod.ByAlpha.

Autodesk.AutoCAD.Colors.Transparency.Alpha
Gets the alpha value. The valid alpha value range is from 0 (for totally transparent) to 255 (for totally opaque). This property is applicable only when the transparency method is TransparencyMethod.ByAlpha.

Autodesk.AutoCAD.Colors.Transparency.Equals(System.Object)


Autodesk.AutoCAD.Colors.Transparency.GetHashCode


Autodesk.AutoCAD.Colors.Transparency.ToString


Autodesk.AutoCAD.Colors.Transparency.ToString(System.IFormatProvider)


Autodesk.AutoCAD.Colors.Transparency.op_Inequality(Autodesk.AutoCAD.Colors.Transparency,Autodesk.AutoCAD.Colors.Transparency)


Autodesk.AutoCAD.Colors.Transparency.op_Equality(Autodesk.AutoCAD.Colors.Transparency,Autodesk.AutoCAD.Colors.Transparency)
