Autodesk.AutoCAD.Geometry.PointOnCurve3d
Represents a point on a 3D parametric curve. This class encapsulates all of the geometric information of a point on a 3D curve including its parameter value, 3D coordinates, and derivatives.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Constucts a point on the input curve at the specified parameter value.
curve: Any 3D curve.
parameter: Parameter value on curve.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.Point
Gets the coordinates of the point on curve.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.Parameter
Gets or sets the parameter value of the point on curve.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.Curve
Gets or sets the curve on which the point lies.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetPointAtParameter(System.Double)
Returns the coordinates of the point on curve at the specified parameter value. This method resets the parameter value of the point on curve.
parameter: Parameter value.
Returns: The coordinates of the point on curve at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetPointOnCurve(Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Returns the coordinates of the point on the input curve at the specified parameter value. This method resets the underlying curve and parameter value of the point on curve.
curve: Any 3D curve.
parameter: Parameter value.
Returns: The coordinates of the point on curve at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Returns the derivative of the specified order on the input curve at the specified parameter value. order must be greater than 0 and no larger than 2. This method resets the underlying curve and parameter value of the point on curve.
order: Order of derivative.
curve: Any 3D curve.
parameter: Parameter value on curve.
Returns: The derivative of the specified order on the input curve at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetDerivative(System.Int32,System.Double)
Returns the derivative of the specified order at the specified parameter value. order must be greater than 0 and no larger than 2. This method resets the parameter value of the point on curve.
order: Order of derivative.
parameter: Parameter value on curve.
Returns: The derivative of the specified order at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetDerivative(System.Int32)
Returns the derivative of the specified order. order must be greater than 0 and no larger than 2.
order: Order of derivative.
Returns: The derivative of the specified order.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.IsSingular
Determines if first derivative vector is zero-length.
Returns: true if first derivative vector is zero-length.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.IsSingular(Autodesk.AutoCAD.Geometry.Tolerance)
Determines if first derivative vector is zero-length.
tolerance: Tolerance.
Returns: true if first derivative vector is zero-length.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetCurvature(System.Double)
Returns the curvature of the curve on the curve at the specified parameter value.
parameter: Parameter value.
Returns: The curvature of the curve at the point on the curve at the specified parameter value.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetCurvature
Returns the curvature of the curve.
parameter: Parameter value.
Returns: The curvature of the curve.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.{dtor}
