Autodesk.AutoCAD.DatabaseServices.ObjectId
A container for the address of a database-resident object's stub. As such, it is an extremely important object because it contains the only session-persistent locator for the database-resident object.

Autodesk.AutoCAD.DatabaseServices.ObjectId.#ctor(System.Int32)


Autodesk.AutoCAD.DatabaseServices.ObjectId.Null
Gets an object ID with value of 0.

Autodesk.AutoCAD.DatabaseServices.ObjectId.NonForwardedHandle
Gets the handle in the xref database if this object ID is in an xref database and the object associated with this object ID has been redirected to the host database;If the object associated with this objectId is not from an xref database or is not redirected, then this property is the same as ObjectId.Handle.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Handle
Gets the handle of the object associated with the object ID.

Autodesk.AutoCAD.DatabaseServices.ObjectId.OriginalDatabase
Gets the xref database if this object ID is in an xref database and the object associated with this object ID has been redirected to the host database;If the object associated with this object ID is not from an xref database or is not redirected, then this property is the same as ObjectId.Database.

Autodesk.AutoCAD.DatabaseServices.ObjectId.ObjectLeftOnDisk
For internal use only.

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsEffectivelyErased
Gets true if the object associated with this object ID is erased or if any of the owners in the ownership hierarchy for the object (in other words, the object's owner, the object's owner's owner, etc.) are erased.

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsErased
Gets true if the object associated with this object ID is erased.

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsValid
Gets true if the object ID is associated with a database that is currently in memory.

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsNull
Gets true if the object ID has a null value (0) or false otherwise.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Database
Gets the database in which the object ID is resident.

Autodesk.AutoCAD.DatabaseServices.ObjectId.OldId
Gets the objectId value as a Int32, which is the old ads_name format.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Open(Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Attempts to open the database object represented by this object ID in the mode represented by mode. If openErased is true, this method attempts to open the object even if it has been erased. If forceOpenOnLockedLayer is true, this method attempts to open the object if it is on locked layer.
mode: Mode in which to open the object.
openErased: Boolean indicates whether to open the object if it is erased.
forceOpenOnLockedLayer: Boolean indicates whether to open the object if it is on locked layer.
Returns: The opened object.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Open(Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean)
Attempts to open the database object represented by this object ID in the mode represented by mode. If openErased is true, this method attempts to open the object even if it has been erased. Otherwise, it ignores erased objects. This method does not open objects on locked layers.
mode: Mode in which to open the object.
openErased: Boolean indicates whether to open the object if it is erased.
Returns: The opened object.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Open(Autodesk.AutoCAD.DatabaseServices.OpenMode)
Attempts to open the database object represented by this object ID in the mode represented by mode. This method does not open erased objects or objects on locked layers.
mode: Mode in which to open the object.
Returns: The opened object.

Autodesk.AutoCAD.DatabaseServices.ObjectId.GetObject(Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
This method calls the TransactionManager.GetObject() method of the top transaction passing on all the arguments it has received.
mode: Mode in which to open the object.
openErased: Boolean indicates whether to open the object if it is erased.
forceOpenOnLockedLayer: Boolean indicates whether to open the object if it is on locked layer.
Returns: The opened object.

Autodesk.AutoCAD.DatabaseServices.ObjectId.GetObject(Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean)
This method calls the TransactionManager.GetObject() method of the top transaction passing on all the arguments it has received.This method does not open objects on locked layers
mode: Mode in which to open the object.
openErased: Boolean indicates whether to open the object if it is erased.
Returns: The opened object.

Autodesk.AutoCAD.DatabaseServices.ObjectId.GetObject(Autodesk.AutoCAD.DatabaseServices.OpenMode)
This method calls the TransactionManager.GetObject() method of the top transaction passing on all the arguments it has received.This method does not open erased objects or objects on locked layers
mode: Mode in which to open the object.
Returns: The opened object.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj: System.Object object.
Returns: True if this object is identical to the argument object.

Autodesk.AutoCAD.DatabaseServices.ObjectId.GetHashCode


Autodesk.AutoCAD.DatabaseServices.ObjectId.ToString(System.IFormatProvider)


Autodesk.AutoCAD.DatabaseServices.ObjectId.ToString


Autodesk.AutoCAD.DatabaseServices.ObjectId.Compare(Autodesk.AutoCAD.DatabaseServices.ObjectId)


Autodesk.AutoCAD.DatabaseServices.ObjectId.ConvertToRedirectedId
Takes the object ID for this object if it has been redirected from another database, and convert it to the actual object ID for the other database (for example: the object ID from an xref database).
Returns: The actual object ID for the other database.

Autodesk.AutoCAD.DatabaseServices.ObjectId.op_Inequality(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)


Autodesk.AutoCAD.DatabaseServices.ObjectId.op_Equality(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)


Autodesk.AutoCAD.DatabaseServices.ObjectId.op_LessThan(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)


Autodesk.AutoCAD.DatabaseServices.ObjectId.op_GreaterThan(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
