Autodesk.AutoCAD.LayerManager.RelationalExpression
This class represents a relational expression.

Autodesk.AutoCAD.LayerManager.RelationalExpression.Constant
Gets a constant.

Autodesk.AutoCAD.LayerManager.RelationalExpression.Variable
Gets the name of the variable.