Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits
Represents a ground plane background to the underlying display system.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorGroundPlaneFar
Gets or sets the color of the near ground plane.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorGroundPlaneNear
Gets or sets the color of the far ground plane.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorUndergroundAzimuth
Gets or sets the color of the underground azimuth.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorUndergroundHorizon
Gets or sets the color of the underground horizon.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorSkyHorizon
Gets or sets the color of the sky at the horizon.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorSkyZenith
Gets or sets the sky color at the zenith.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.{dtor}
