Autodesk.AutoCAD.GraphicsInterface.LightingQuality
Describes the calculation method used for application of lighting effects to faces.

Autodesk.AutoCAD.GraphicsInterface.LightingQuality.PerVertexLighting
Each vertex of a face has its color calculated based on its orientation to the light source(s) of the scene.

Autodesk.AutoCAD.GraphicsInterface.LightingQuality.PerFaceLighting
Each face has a color calculated based on its orientation to the light source(s) of the scene.

Autodesk.AutoCAD.GraphicsInterface.LightingQuality.NoLighting
Apply no lighting calculations to the faces.