Autodesk.AutoCAD.DatabaseServices.Arc
Represents the arc entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Arc.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
This constructor creates an arc using the values passed in. center must be in WCS coordinates. The arc is initialized with a thickness of 0.0.
center: Center point for the arc.
normal: Normal vector of the plane containing the arc.
radius: Radius of the arc.
startAngle: Starting angle of the arc.
endAngle: Ending angle of the arc.

Autodesk.AutoCAD.DatabaseServices.Arc.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double,System.Double)
This constructor creates an arc using the values passed in. center must be in WCS coordinates. The arc is initialized with a normal of (0,0,1) and a thickness of 0.0.
center: Center point for the arc.
radius: Radius of the arc.
startAngle: Starting angle of the arc.
endAngle: Ending angle of the arc.

Autodesk.AutoCAD.DatabaseServices.Arc.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Arc.Normal
Gets or sets the arc's unit normal vector in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Arc.Thickness
Gets or sets the thickness value for the arc. The thickness is the arc's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.Arc.EndAngle
Gets or sets the end angle of the arc in radians. The angle is relative to the OCS X axis for the arc with positive angles going counterclockwise when looking down the Z axis towards the origin. The OCS X axis is determined by using the arc's normal, the WCS Z axis, and the arbitrary axis algorithm.

Autodesk.AutoCAD.DatabaseServices.Arc.StartAngle
Gets or sets the start angle of the arc in radians. The angle is relative to the OCS X axis for the arc with positive angles going counterclockwise when looking down the Z axis towards the origin. The OCS X axis is determined by using the arc's normal, the WCS Z axis, and the arbitrary axis algorithm.

Autodesk.AutoCAD.DatabaseServices.Arc.Radius
Gets or sets the radius of the arc.

Autodesk.AutoCAD.DatabaseServices.Arc.Center
Gets or sets the center point of the arc in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Arc.{dtor}
