Autodesk.AutoCAD.Geometry.ExternalSurface
ExternalSurface class is a representation for an unbounded (other than by the parametric bounds of the surface) surface geometry that has its definition external to GeLib.

Autodesk.AutoCAD.Geometry.ExternalSurface.#ctor(System.IntPtr,Autodesk.AutoCAD.Geometry.ExternalEntityKind)
This constructor creates an external surface from a surface definition passed in by the caller.
surfaceDefinition: Definition of the external surface.
surfaceKind: Information about the system in which the external surface definition was created.

Autodesk.AutoCAD.Geometry.ExternalSurface.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsOwnerOfSurface
Gets true if the instance is the owner of its data.

Autodesk.AutoCAD.Geometry.ExternalSurface.nativeSurface
Gets gelib native representation for the external surface.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsNativeSurface
Gets true if there exists a native gelib representation corresponding to the external surface.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsDefined
Gets true if the instance does have a surface definition.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsNurbSurface
Gets true if the external surface does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsTorus
Gets true if the external surface does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsCone
Gets true if the external surface does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsCylinder
Gets true if the external surface does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsSphere
Gets true if the external surface does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsPlane
Gets true if the external surface does have an exact gelib native representation.

Autodesk.AutoCAD.Geometry.ExternalSurface.ExternalSurfaceKind
Gets information concerning the native system in which the external bounded surface definition was created.

Autodesk.AutoCAD.Geometry.ExternalSurface.ExternalSurfaceDefiniton
Gets copy of the definition data as a pointer.

Autodesk.AutoCAD.Geometry.ExternalSurface.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.ExternalSurface.Set(System.IntPtr,Autodesk.AutoCAD.Geometry.ExternalEntityKind)
Resets the definition of an instance of this class.
surfaceDef: Definition of the external surface.
surfaceKind: Information about the system in which the external surface definition was created.

Autodesk.AutoCAD.Geometry.ExternalSurface.{dtor}
