Autodesk.AutoCAD.DatabaseServices.ArcDimension
Represents an arc length dimension.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Primary constructor.
centerPoint: Center of the arc being dimensioned.
xLine1Point: First extension line end point.
xLine2Point: Second extension line end point.
arcPoint: Point on arc being dimensioned.
dimensionText: Dimension text to use instead of calculated value.
dimensionStyle: Dimension style object ID.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.ArcDimension.HasLeader
Gets or sets true if this arc length dimension has an extra leader drawn to resolve ambiguity. Gets or sets false if the arc length dimension has no extra leader drawn.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.ArcSymbolType
Gets or sets the type of symbol used within the arc length dimension's text string.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.XLine2Point
Gets or sets the start point for the arc length dimension's second extension line.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.XLine1Point
Gets or sets the start point for the arc length dimension's first extension line.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.Leader2Point
Gets or sets the end point for the arc length dimension's extra leader, if drawn.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.Leader1Point
Gets or sets the start point for the arc length dimension's extra leader, if drawn.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.CenterPoint
Gets or sets the center point of the arc dimensioned by the arc length dimension.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.ArcPoint
Gets or sets a point on the arc length dimension's dimension arc.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.ArcEndParam
Gets or sets the parameter of the arc being dimensioned corresponding to the arc length dimension's second definition point.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.ArcStartParam
Gets or sets the parameter of the arc being dimensioned corresponding to the arc length dimension's first definition point.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.{dtor}
