Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator
Exports access methods that validate data on a PlotSettings object before actually setting the data on the object.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.Current


Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotConfigurationName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String,System.String)
Specifies a system printer or PC3 file containing the "how to plot" information.
plotSet: PlotSettings object.
plotDeviceName: Plot device name.
mediaName: Media name.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetCanonicalMediaName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String)
Sets a locale-independent identifier for a specific media size.
plotSet: PlotSettings object.
mediaName: Canonical media name.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotOrigin(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.Geometry.Point2d)
Sets the plot origin offset that is applied inside of the paper margins.
plotSet: PlotSettings object.
origin: Coordinate of offset.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotPaperUnits(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.PlotPaperUnit)
Sets the units for plotting using the enumeration PlotPaperUnits.
plotSet: PlotSettings object.
units: Units by which the margins, offset, and paper size are interpreted.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotRotation(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.PlotRotation)
Sets the rotation of the plot on the paper.
plotSet: PlotSettings object.
rotationType: Enumeration indicates rotation.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotCentered(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Boolean)
Sets whether the plot will be centered. If true, the paper margins are automatically computed to position the plot in the center of the sheet.
plotSet: PlotSettings object.
isCentered: Boolean indicates whether the plot should be centered.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotType(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.PlotType)
Specifies what portion of the layout to output to the media.
plotSet: PlotSettings object.
plotAreaType: Enumeration indicates the portion of the layout to plot.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotWindowArea(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.Extents2d)
Sets the portion of the layout to plot.
plotSet: PlotSettings object.
windowArea: Lowerl eft  and upper right coordinates of window.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotViewName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String)
Specifies what portion of the layout to plot.
plotSet: PlotSettings object.
viewName: Named view indicates the portion of the layout to plot.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetUseStandardScale(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Boolean)
Determines whether the layout will use the StdScaleType property to calculate the current plot scale.
plotSet: PlotSettings object.
useStandard: Boolean indicates whether to use standard scale.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetCustomPrintScale(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.CustomScale)
Sets the custom scale, a ratio of paperspace units to media units.
plotSet: PlotSettings object.
scale: A ratio of paperspace units to media units.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetCurrentStyleSheet(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String)
Sets a specific plot style table on a layout.
plotSet: PlotSettings object.
styleSheetName: Plot style table name.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetStdScaleType(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.StdScaleType)
Sets the standard scale from a value in the enumerated type StdScaleType.
plotSet: PlotSettings object.
scaleType: Standard scale.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetStdScale(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Double)
Sets the standard scale value as a floating point scale.
plotSet: PlotSettings object.
standardScale: Standard scale value.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetPlotDeviceList
Returns an array of all available plot devices found on the system. This list is built only once per AutoCAD session.
Returns: Array of available plot devices.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetCanonicalMediaNameList(Autodesk.AutoCAD.DatabaseServices.PlotSettings)
Returns all available canonical media names available for the plot device configured on the PlotSettings object defined by plotSet.
plotSet: PlotSettings object.
Returns: Array of available canonical media names.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetPlotStyleSheetList
Returns an array of all available plot style tables found on the system. This list is built only once per AutoCAD session.
Returns: Array of all available plot style tables.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetLocaleMediaName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Int32)
Given an index into the canonical media name list returned by GetCanonicalMediaNameList(), returns the localized version of the media name at the index.
plotSet: PlotSettings object.
index: Index into array returned by GetCanonicalMediaNameList.
Returns: Localized version of media name represented by index list parameter.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetLocaleMediaName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String)
Given the canonical (locale-independent) representation for a given media name, returns the localized version.
plotSet: PlotSettings object.
canonicalName: Locale independent media name identifier.
Returns: Localized version of media name represented by canonicalName parameter.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetClosestMediaName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.PlotPaperUnit,System.Boolean)
For the configured plot device, sets the closest matching media size on the given PlotSettings object using the input criteria.
plotSet: PlotSettings object.
paperWidth: Paper width to match.
paperHeight: Paper height to match.
units: Units represented by paper width and height.
matchPrintableArea: Boolean as to whether a match should be performed against the printable area or the physical boundary of the target media size.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.RefreshLists(Autodesk.AutoCAD.DatabaseServices.PlotSettings)
Rebuilds the plot, canonical media, and plot style table arrays to reflect the current system state.
plotSet: PlotSettings object.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetZoomToPaperOnUpdate(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Boolean)
Sets a flag on a Layout object to indicate that a zoom to the associated paper image represented by the underlying Layout be performed if the paper receives update notification.
plotSet: PlotSettings object.
doZoom: Boolean indicates whether to zoom.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetDefaultPlotConfig(Autodesk.AutoCAD.DatabaseServices.PlotSettings)
Sets default plot configuration values on the given PlotSettings object defined by plotSet.
plotSet: PlotSettings object.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.{dtor}
