Autodesk.AutoCAD.DatabaseServices.DataCell
Provides a way to represent the following data types in a generic manner: Boolean, integer, double, string, Point3d, ObjectId, HardOwnershipId, SoftOwnershipId, HardPointerId, and SoftPointerId.

Autodesk.AutoCAD.DatabaseServices.DataCell.#ctor
Default constructor.Initializes the type of the cell as CellType.Unknown.

Autodesk.AutoCAD.DatabaseServices.DataCell.CellType
Gets the type of this cell.

Autodesk.AutoCAD.DatabaseServices.DataCell.Value


Autodesk.AutoCAD.DatabaseServices.DataCell.Init
Reinitializes the cell by clearing its value and setting its type to CellType.Unknown.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetBool(System.Boolean)
Casts this DataCell object to a Boolean value.
value: A Boolean value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetInteger(System.Int32)
Casts this DataCell object to an integer value.
value: An integer value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetDouble(System.Double)
Casts this DataCell object to a double value.
value: A double value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetString(System.String)
Casts this DataCell object to a string value.
value: A string value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetPoint(Autodesk.AutoCAD.Geometry.Point3d)
Casts this DataCell object to a Point3d value.
value: A Point3d value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetVector(Autodesk.AutoCAD.Geometry.Vector3d)
Casts this DataCell object to a Vector3d value.
value: A Vector3d value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetObjectId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Casts this DataCell object to an ObjectId value.
value: An ObjectId value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetHardOwnershipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Casts this DataCell object to a HardOwnershipId value.
value: A HardOwnershipId value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetSoftOwnershipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Casts this DataCell object to a SoftOwnershipId value.
value: A SoftOwnershipId value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetHardPointerId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Casts this DataCell object to a HardPointerId value.
value: A HardPointerId value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetSoftPointerId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Casts this DataCell object to a SoftPointerId value.
value: A SoftPointerId value.

Autodesk.AutoCAD.DatabaseServices.DataCell.{dtor}
