Autodesk.AutoCAD.LayerManager.LayerFilterDisplayImages
This class encapsulates the information returned by the LayerFilter.DisplayImages property.

Autodesk.AutoCAD.LayerManager.LayerFilterDisplayImages.#ctor(System.IntPtr,System.Int32,System.Int32)
Constructor.
imageListHandle: The handle of the image list that contains the normal and selected image.
imageIndex: Zero-based index of the normal image in the image list.
selectedImageIndex: Zero-based index of the selected image in the image list.

Autodesk.AutoCAD.LayerManager.LayerFilterDisplayImages.SelectedImageIndex
Gets the zero-based index of the selected image in the image list.

Autodesk.AutoCAD.LayerManager.LayerFilterDisplayImages.ImageIndex
Gets the zero-based index of the normal image in the image list.

Autodesk.AutoCAD.LayerManager.LayerFilterDisplayImages.ImageListHandle
Gets the handle of the image list that contains the normal and selected image.