Autodesk.AutoCAD.DatabaseServices.RegAppTableRecord
Objects of this class represent records in the RegAppTable(known as the APPID symbol table in AutoCAD and DXF). Each of these records represents an application ID used to identify a group of Extended Entity Data attached to objects in the drawing database.

Autodesk.AutoCAD.DatabaseServices.RegAppTableRecord.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RegAppTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RegAppTableRecord.{dtor}
