Autodesk.AutoCAD.Runtime.DynamicLinker
An object of this class provides the following services:Gets the address of a service registered by name;Loads and initializes a list of ObjectARX-type applications;Loads and initializes a single ObjectARX-type module;Registers a named service with the service registry;Unloads an ObjectARX-type module;Adds a event to the dynamic.

Autodesk.AutoCAD.Runtime.DynamicLinker.ProductLcid
Gets the locale identifier.

Autodesk.AutoCAD.Runtime.DynamicLinker.ProductKey
Gets the string that is the path from the root of the registry tree to the branch for this particular version of AutoCAD.

Autodesk.AutoCAD.Runtime.DynamicLinker.LoadModule(System.String,System.Boolean,System.Boolean)
Loads the fileName ObjectARX program.
fileName: The file name of the ObjectARX module to load.
printIt: Boolean indicates whether or not to print load status message.
asCmd: Boolean indicates whether to load the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.UnloadModule(System.String,System.Boolean)
Unloads the ObjectARX module fileName.
fileName: The file name of the program to unload.
asCmd: Boolean indicates whether to unload the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.LoadApp(System.String,System.Boolean,System.Boolean)
Loads the appName ObjectARX program.
appName: The application name (as set in the system registry) of the ObjectARX module to load.
printIt: Boolean indicates whether or not to print load status message.
asCmd: Boolean indicates whether to load the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.UnloadApp(System.String,System.Boolean)
Unloads the appName ObjectARX program.
appName: The application name (as set in the system registry) of the ObjectARX module to unload.
asCmd: Boolean indicates whether to unload the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.IsApplicationLocked(System.String)
Indicates whether the modulename application is locked and cannot be unloaded, or is unlocked and can be successfully unloaded.
moduleName: Name of loaded ObjectARX program.
Returns: true if the modulename application is locked.

Autodesk.AutoCAD.Runtime.DynamicLinker.IsAppMdiAware(System.String)
Determines if an application already loaded is MDI aware.
moduleName: Name of the module to check.
Returns: true if the application is MDI.

Autodesk.AutoCAD.Runtime.DynamicLinker.IsAppBusy(System.String)
For internal use.
moduleName: For internal use.
Returns: For internal use.

Autodesk.AutoCAD.Runtime.DynamicLinker.SetAppBusy(System.String,System.Boolean)
For internal use only.
moduleName: For internal use only.
busyFlag: For internal use only.

Autodesk.AutoCAD.Runtime.DynamicLinker.{dtor}
