Autodesk.AutoCAD.DatabaseServices.XrefGraph
A derived class for representing xrefs, using the XrefGraphNode class to represent one xref database at each node.

Autodesk.AutoCAD.DatabaseServices.XrefGraph.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.XrefGraph.HostDrawing
Gets the node associated with the host drawing.

Autodesk.AutoCAD.DatabaseServices.XrefGraph.GetXrefNode(System.Int32)
Searches for the node that corresponds to its passed in parameter.
idx: Index into the graph.
Returns: The node that corresponds to its passed in parameter.

Autodesk.AutoCAD.DatabaseServices.XrefGraph.GetXrefNode(Autodesk.AutoCAD.DatabaseServices.Database)
Searches for the node that corresponds to its passed in parameter.
db: Node database to search for.
Returns: The node that corresponds to its passed in parameter.

Autodesk.AutoCAD.DatabaseServices.XrefGraph.GetXrefNode(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Searches for the node that corresponds to its passed in parameter.
btrId: Block table record ID to search for.
Returns: The node that corresponds to its passed in parameter.

Autodesk.AutoCAD.DatabaseServices.XrefGraph.GetXrefNode(System.String)
Searches for the node that corresponds to its passed in parameter.
name: Node name to search for.
Returns: The node that corresponds to its passed in parameter.

Autodesk.AutoCAD.DatabaseServices.XrefGraph.MarkUnresolvedTrees
Marks all unresolved xrefs and their nested xrefs with the GraphNode.UnresTree flag. It is really only effective on an xref graph which includes ghost references.
Returns: True if the graph includes any unresolved xrefs.

Autodesk.AutoCAD.DatabaseServices.XrefGraph.{dtor}
