Autodesk.AutoCAD.DatabaseServices.OrthographicView
Specifies the type of the OrthoView.

Autodesk.AutoCAD.DatabaseServices.OrthographicView.RightView
Specifies that the view is a right view relative to the UCS.

Autodesk.AutoCAD.DatabaseServices.OrthographicView.LeftView
Specifies that the view is a left view relative to the UCS.

Autodesk.AutoCAD.DatabaseServices.OrthographicView.BackView
Specifies that the view is a back view relative to the UCS.

Autodesk.AutoCAD.DatabaseServices.OrthographicView.FrontView
Specifies that the view is a front view relative to the UCS.

Autodesk.AutoCAD.DatabaseServices.OrthographicView.BottomView
Specifies that the view is a bottom view relative to the UCS.

Autodesk.AutoCAD.DatabaseServices.OrthographicView.TopView
Specifies that the view is a top view relative to the UCS.

Autodesk.AutoCAD.DatabaseServices.OrthographicView.NonOrthoView
Specifies that the view is non-orthographic relative to the UCS.