Autodesk.AutoCAD.GraphicsInterface.PointLightTraits
Represents a point light source, whose light is emitted in all directions.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.Attenuation
Gets or sets the attenuation parameters for this light.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.Position
Gets or sets the position of the light source, in the coordinate space of the current context.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.{dtor}
