Autodesk.AutoCAD.GraphicsInterface.AutoTransform
This enumeration provides values that describe the automatic transform mode of the mapper.

Autodesk.AutoCAD.GraphicsInterface.AutoTransform.Model
Multiply the mapper transform by the model (block) transform.

Autodesk.AutoCAD.GraphicsInterface.AutoTransform.TransformObject
Multiply the mapper transform by a transform that scales by the bounds of the current object and translates to the origin of the current object.

Autodesk.AutoCAD.GraphicsInterface.AutoTransform.None
No automatic transform or identity.

Autodesk.AutoCAD.GraphicsInterface.AutoTransform.InheritAutoTransform
Inherit auto transform method from current material's mapper.