Autodesk.AutoCAD.GraphicsInterface.Source
This enumeration provides values that describe the source of a MaterialMap object's image data.

Autodesk.AutoCAD.GraphicsInterface.Source.Procedural


Autodesk.AutoCAD.GraphicsInterface.Source.Scene
Image data is generated from the current scene.

Autodesk.AutoCAD.GraphicsInterface.Source.File
Image data is from a file.