Autodesk.AutoCAD.Runtime.DisposableWrapper.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Runtime.DisposableWrapper.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Runtime.DisposableWrapper.AutoDelete
If true, this wrapper "owns" the underlying object and will attempt to delete it when the wrapper is deleted. If false, the calling application is responsible for the underlying object's memory.

Autodesk.AutoCAD.Runtime.DisposableWrapper.IsDisposed


Autodesk.AutoCAD.Runtime.DisposableWrapper.UnmanagedObject
Gets the unmanaged ObjectARX pointer of the DisposableWrapper.

Autodesk.AutoCAD.Runtime.DisposableWrapper.Finalize


Autodesk.AutoCAD.Runtime.DisposableWrapper.Dispose(System.Boolean)


Autodesk.AutoCAD.Runtime.DisposableWrapper.Dispose
Releases all resources owned by this wrapper's base types, to the root of its hierarchy. Because the underlying resources used by ObjectARX managed wrappers are unmanaged classes, you must explicitly call this method on every managed wrapper object when you are finished using it. Do not rely on .NET garbage collection to free the memory used by unmanaged resources.

Autodesk.AutoCAD.Runtime.DisposableWrapper.DeleteUnmanagedObject


Autodesk.AutoCAD.Runtime.DisposableWrapper.Create(System.Type,System.IntPtr,System.Boolean)
Creates a managed wrapper from the unmanaged ObjectARX pointer passed to unmanagedPointer.
type: The wrapper type required for the unmanaged object.
unmanagedPointer: The unmanaged ObjectARX pointer.
autoDelete: If true, this wrapper "owns" the underlying object and will attempt to delete it when the wrapper is deleted. If false, the calling application is responsible for the underlying object's memory.
Returns: A managed wrapper from the unmanaged ObjectARX pointer.

Autodesk.AutoCAD.Runtime.DisposableWrapper.Equals(System.Object)


Autodesk.AutoCAD.Runtime.DisposableWrapper.GetHashCode


Autodesk.AutoCAD.Runtime.DisposableWrapper.op_Inequality(Autodesk.AutoCAD.Runtime.DisposableWrapper,Autodesk.AutoCAD.Runtime.DisposableWrapper)


Autodesk.AutoCAD.Runtime.DisposableWrapper.op_Equality(Autodesk.AutoCAD.Runtime.DisposableWrapper,Autodesk.AutoCAD.Runtime.DisposableWrapper)


Autodesk.AutoCAD.Runtime.DisposableWrapper.{dtor}
