Autodesk.AutoCAD.DatabaseServices.AbstractViewTable
AbstractViewTable is the base class for the two symbol table classes,ViewTable and ViewportTable.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTable.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.AbstractViewTable.{dtor}
