Autodesk.AutoCAD.Geometry.BoundBlock2d
Provides a two-dimensional bounding volume implementation.Bounding blocks may exist in two forms: as an ordinary coordinate-aligned bounding box and as a parallelogram.

Autodesk.AutoCAD.Geometry.BoundBlock2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs a parallelogram given a vertex and two sides.
basePoint: Origin vertex a corner of the bounding area.
direction1: Direction and size for first side of the bounding area.
direction2: Direction and size for second side of the bounding area.

Autodesk.AutoCAD.Geometry.BoundBlock2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs a box contracted to a segment between two points.
point1: Point 1.
point2: Point 2.

Autodesk.AutoCAD.Geometry.BoundBlock2d.IsBox
Gets or sets true if the block is a coordinate box.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Direction2
Gets direction and size for second side of the bounding area.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Direction1
Gets direction and size for first side of the bounding area.

Autodesk.AutoCAD.Geometry.BoundBlock2d.BasePoint
Gets origin vertex a corner of the bounding area.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.BoundBlock2d.GetMaximumPoint
Returns the second corner vertex for bounding area.
Returns: The second corner vertex for bounding area.

Autodesk.AutoCAD.Geometry.BoundBlock2d.GetMinimumPoint
Returns the first corner vertex for bounding area.
Returns: The first corner vertex for bounding area.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Sets the block as a parallelogram with given vertex and sides.
basePoint: Origin vertex a corner of the bounding area.
direction1: Direction and size for first side of the bounding area.
direction2: Direction and size for second side of the bounding area.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Sets the block as a parallelogram contracted to a segment between two points.
firstPoint: First point.
secondPoint: Second point.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Extend(Autodesk.AutoCAD.Geometry.Point2d)
Extends the block to include the new point.
point: Extension point.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Swell(System.Double)
Swells the block by moving the sides for the distance distance.
distance: Distance to expand the block.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Contains(Autodesk.AutoCAD.Geometry.Point2d)
Gets true if the point belongs to the block.
point: Point to test whether the point belongs to the block.
Returns: true if the point belongs to the block.

Autodesk.AutoCAD.Geometry.BoundBlock2d.IsDisjoint(Autodesk.AutoCAD.Geometry.BoundBlock2d)
Gets true if the input block does not intersect with this block.
block: Another BoundBlock2d object.
Returns: true if the input block does not intersect with this block.

Autodesk.AutoCAD.Geometry.BoundBlock2d.{dtor}
