Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatusResult.#ctor(Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatus,System.Int32,System.String)


Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatusResult.ErrorMessage


Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatusResult.ErrorCode


Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatusResult.Status
