Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsBoolParameter
This class is a container for the MentalRayRenderSettingsTraits.FGSampleRadiusState property.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsBoolParameter.#ctor(System.Boolean,System.Boolean,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsBoolParameter.Pixels


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsBoolParameter.Max


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsBoolParameter.Min
