Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType


Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType.Extend


Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType.Chamfer


Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType.Fillet
