Autodesk.AutoCAD.DatabaseServices.Ray
Represents the RAY entity type within AutoCAD.A ray entity is a line that has a start point, but continues on to infinity in some direction.

Autodesk.AutoCAD.DatabaseServices.Ray.#ctor
The default constructor.A Ray object is constructed with a basepoint of (0,0,0) and a direction of (0,0,1).

Autodesk.AutoCAD.DatabaseServices.Ray.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Ray.UnitDir
Gets or sets the unit direction vector of the ray.

Autodesk.AutoCAD.DatabaseServices.Ray.BasePoint
Gets or sets the base point of the ray.

Autodesk.AutoCAD.DatabaseServices.Ray.{dtor}
