Autodesk.AutoCAD.Geometry.EllipticalArc3d
Represents both full circles and circular arcs in 3D space.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Constructs an ellipse with the specified center, major and minor axes, major and minor radii, and start and end angles.
center: Ellipse center.
majorAxis: Ellipse major axis.
minorAxis: Ellipse minor axis.
majorRadius: Ellipse major radius.
minorRadius: Ellipse minor radius.
startAngle: Angle of ellipse start point.
endAngle: Angle of ellipse endpoint.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double)
Constructs a full ellipse with the specified center, major and minor axes, and major and minor radii.
center: Ellipse center.
majorAxis: Ellipse major axis.
minorAxis: Ellipse minor axis.
majorRadius: Ellipse major radius.
minorRadius: Ellipse minor radius.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.EndPoint
Gets the endpoint of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.StartPoint
Gets the start point of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.EndAngle
Gets the angle of the endpoint of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.StartAngle
Gets the angle of the ellipse start point.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MajorRadius
Gets or sets the major radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MinorRadius
Gets or sets the minor radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MajorAxis
Gets the major axis vector of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MinorAxis
Gets the minor axis vector of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.Normal
Gets the normal vector of the ellipse. The ellipse is oriented counterclockwise around this vector.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.Center
Gets or sets the center point of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.EllipticalArc3d.ClosestPointToPlane(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns the point on this ellipse that is closest to the given plane.
plane: Plane.
Returns: The point on this ellipse that is closest to the given plane.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.ClosestPointToPlane(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the point on this ellipse that is closest to the given plane.
plane: Plane.
tolerance: Tolerance.
Returns: The point on this ellipse that is closest to the given plane.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity)
Determines if the input plane intersects the ellipse.
plane: Any plane.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input plane intersects the ellipse.
plane: Any plane.
tolerance: Tolerance for tangent intersections.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Determines if the input line intersects the ellipse.
line: Any 3D linear entity.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input line intersects the ellipse.
line: Any 3D linear entity.
tolerance: Tolerance for tangent intersections.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d)
Finds the points on the ellipse and line that projects to the same point when projected onto a plane whose normal is projectionDirection.
line: Any 3D linear entity.
projectionDirection: Direction of projection.
Returns: Intersection points on line.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the points on the ellipse and line that projects to the same point when projected onto a plane whose normal is projectionDirection.
line: Any 3D linear entity.
projectionDirection: Direction of projection.
tolerance: Tolerance.
Returns: Intersection points on line.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.GetPlane
Returns the infinite plane in which the ellipse lies.
Returns: The infinite plane in which the ellipse lies.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IsCircular
Determines if ellipse is a circular arc.
Returns: true if ellipse is a circular arc.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IsCircular(Autodesk.AutoCAD.Geometry.Tolerance)
Determines if ellipse is a circular arc.
tolerance: Tolerance.
Returns: true if ellipse is a circular arc.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IsInside(Autodesk.AutoCAD.Geometry.Point3d)
Determines whether the input point lies inside the ellipse.
pointValue: Any 3D point.
Returns: true if the input point lies inside the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IsInside(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines whether the input point lies inside the ellipse.
pointValue: Any 3D point.
tolerance: Tolerance for tangent intersections.
Returns: true if the input point lies inside the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.SetAxes(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Resets the major and minor axes of the ellipse.
majorAxis: Ellipse major axis.
minorAxis: Ellipse minor axis.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.SetAngles(System.Double,System.Double)
Changes the start point and endpoint of the ellipse by resetting the angles of the start point and endpoint.
startAngle: Angle of ellipse start point.
endAngle: Angle of ellipse endpoint.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Changes the definition of the ellipse to have the specified center, major and minor axes, major and minor radii, and start and end angles.
center: Ellipse center.
majorAxis: Ellipse major axis.
minorAxis: Ellipse minor axis.
majorRadius: Ellipse major radius.
minorRadius: Ellipse minor radius.
startAngle: Angle of ellipse start point.
endAngle: Angle of ellipse endpoint.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double)
Changes the definition of the ellipse to be a full ellipse with the specified center, major and minor axes, and major and minor radii.
center: Ellipse center.
majorAxis: Ellipse major axis.
minorAxis: Ellipse minor axis.
majorRadius: Ellipse major radius.
minorRadius: Ellipse minor radius.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.{dtor}
