Autodesk.AutoCAD.DatabaseServices.SubentityType


Autodesk.AutoCAD.DatabaseServices.SubentityType.Null


Autodesk.AutoCAD.DatabaseServices.SubentityType.Class


Autodesk.AutoCAD.DatabaseServices.SubentityType.MlineCache


Autodesk.AutoCAD.DatabaseServices.SubentityType.Vertex


Autodesk.AutoCAD.DatabaseServices.SubentityType.Edge


Autodesk.AutoCAD.DatabaseServices.SubentityType.Face
