Autodesk.AutoCAD.DatabaseServices.TransactionManager
There is a single object of class TransactionManager created by the ObjectARX system when AutoCAD first starts up. This TransactionManager object is globally available to all ObjectARX applications.The system TransactionManager object is used to start, end, or terminate transactions. In addition, it provides functionality to manage transactions and the objects within them.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.TransactionManager.TopTransaction
Gets the Transaction object that is at the top of the transaction stack (that is, the most recently created Transaction object).

Autodesk.AutoCAD.DatabaseServices.TransactionManager.NumberOfActiveTransactions
Gets the number of currently active transactions.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.StartTransaction
Creates a new Transaction object, adds this new transaction to the list of current transactions making it the new top transaction.
Returns: The new Transaction object.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.AddNewlyCreatedDBObject(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
If add == true, the object defined by obj is added to the top transaction. If add == false, then the object is removed from whatever transaction it's within.
obj: The object to be added or removed.
add: Boolean indicating whether to add or remove the object.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetAllObjects
Searches all currently existing transaction objects and returns the objects array in with all objects it finds.
Returns: All transaction resident objects.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Opens the object specified by id in the mode specified by mode.
id: Object ID of the object to open.
mode: Mode in which to open the object.
openErased: If true, attempts to open the object even if it is erased.
forceOpenOnLockedLayer: If true, attempts to open the object even if it resides on a locked layer.
Returns: The opened object.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean)
Opens the object specified by id in the mode specified by mode.It does not open objects on locked layers.
id: Object ID of the object to open.
mode: Mode in which to open the object.
openErased: If true, attempts to open the object even if it is erased.
Returns: The opened object.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode)
Opens the object specified by id in the mode specified by mode.This method does not open the object if it is erased or if it is on a locked layer.
id: Object ID of the object to open.
mode: Mode in which to open the object.
Returns: The opened object.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.QueueForGraphicsFlush
Queues up the graphics changes of all transaction-resident modified entities from any existing transaction. This places these changes on the graphics queue in preparation for a call to ApplicationServices.TransactionManager.FlushGraphics() to send them to the display.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.{dtor}
