Autodesk.AutoCAD.Runtime.Dictionary
Maintains a collection of pointers to an RXObject, with keyed search via either a text string, or a 32-bit ID.

Autodesk.AutoCAD.Runtime.Dictionary.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Runtime.Dictionary.Item(System.String)


Autodesk.AutoCAD.Runtime.Dictionary.Count
Gets the number of entries in the dictionary.

Autodesk.AutoCAD.Runtime.Dictionary.IsSorted
Gets true if the dictionary is sorted.

Autodesk.AutoCAD.Runtime.Dictionary.IsCaseSensitive
Gets true if the dictionary keys are case sensitive.

Autodesk.AutoCAD.Runtime.Dictionary.DeletesObjects
Gets true if the dictionary calls delete on the contained RXObject before they are removed or the dictionary is deleted.

Autodesk.AutoCAD.Runtime.Dictionary.At(System.Int32)
Returns the RXObject at the id.
id: Dictionary entry ID of the object to retrieve,must be greater than 0.
Returns: The RXObject at the id.

Autodesk.AutoCAD.Runtime.Dictionary.At(System.String)
Returns the RXObject at the key.
key: Lookup key string to search for.
Returns: The RXObject at the key.

Autodesk.AutoCAD.Runtime.Dictionary.AtPut(System.Int32,Autodesk.AutoCAD.Runtime.RXObject)
Puts value into the dictionary at index id.
id: Dictionary entry ID at which to put value.
value: The object to add to the dictionary.
Returns: The RXObject that was at this index prior to this call.

Autodesk.AutoCAD.Runtime.Dictionary.AtPut(System.String,Autodesk.AutoCAD.Runtime.RXObject,System.Int32@)
Puts value into the dictionary with key as the lookup key and returns the new entry's dictionary ID in retId for future searches for this object using retId instead of the key.
key: Lookup key string to use.
value: The object to add to the dictionary.
retId: Returns the dictionary entry ID for the newly entered value.
Returns: The RXObject with lookup key prior to this call.

Autodesk.AutoCAD.Runtime.Dictionary.AtPut(System.String,Autodesk.AutoCAD.Runtime.RXObject)
Puts value into the dictionary with key as the lookup key.
key: Lookup key string to use.
value: The object to add to the dictionary.
Returns: The RXObject with lookup key prior to this call.

Autodesk.AutoCAD.Runtime.Dictionary.ResetKey(System.Int32,System.String)
Makes a copy of the newKey string and sets it to be the lookup key for the entry at index id.
id: Dictionary entry ID.
newKey: New lookup key string to use.

Autodesk.AutoCAD.Runtime.Dictionary.ResetKey(System.String,System.String)
Makes a copy of the newKey string and sets it to be the lookup key for the entry that currently has the lookup key oldKey.
oldKey: Lookup key string to be found and changed.
newKey: New lookup key string to use.

Autodesk.AutoCAD.Runtime.Dictionary.AtKeyAndIdPut(System.String,System.Int32,Autodesk.AutoCAD.Runtime.RXObject)
Adds value to the dictionary with an existing id. newKey is not used to index into the dictionary.
newKey: Lookup key string to use.
id: Dictionary entry ID at which to put value.
value: The object to add to the dictionary.

Autodesk.AutoCAD.Runtime.Dictionary.Remove(System.Int32)
Removes the dictionary entry at index id. id must be greater than 0.
id: Dictionary entry ID of the entry to remove.
Returns: The RXObject that was removed.

Autodesk.AutoCAD.Runtime.Dictionary.Remove(System.String)
Removes the dictionary entry with lookup key, key.
key: Lookup key string for entry to be removed.
Returns: The RXObject that was removed.

Autodesk.AutoCAD.Runtime.Dictionary.Contains(System.Int32)
Returns true if and only if the dictionary contains an entry indexed by id.
id: Dictionary entry ID to search for.
Returns: true if and only if the dictionary contains an entry indexed by id.

Autodesk.AutoCAD.Runtime.Dictionary.Contains(System.String)
Returns true if and only if the dictionary contains an entry indexed by key.
key: Lookup key string to search for.
Returns: true if and only if the dictionary contains an entry indexed by key.

Autodesk.AutoCAD.Runtime.Dictionary.IdAt(System.String)
Returns the dictionary ID for the entry indexed by key. If key is not found, 0 is returned.
key: Lookup key string to search for.
Returns: The dictionary ID for the entry indexed by key.

Autodesk.AutoCAD.Runtime.Dictionary.KeyAt(System.Int32)
Returns the lookup key string for the entry indexed by id. id must be greater than 0.
id: Dictionary entry ID to search for.
Returns: The lookup key string for the entry indexed by id.

Autodesk.AutoCAD.Runtime.Dictionary.CopyTo(System.Collections.DictionaryEntry[],System.Int32)


Autodesk.AutoCAD.Runtime.Dictionary.{dtor}
