Autodesk.AutoCAD.DatabaseServices.OrdinateDimension
Represents the ordinate dimension type within AutoCAD.Ordinate dimensions measure the "horizontal" (X axis) or "vertical" (Y axis) distance from a specified origin point to some other specified point.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.#ctor(System.Boolean,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor uses the parameters passed in to initialize the dimension. In addition, the origin point is set to (0,0,0) in WCS coordinates and the rest of the Dimension, Entity, etc., default constructor initializations are performed.
useXAxis: Boolean indicates whether to use the X axis (true) or the Y axis (false).
definingPoint: Point where ordinate leader should start.
leaderEndPoint: Point where ordinate leader should end.
dimText: Text string to use as the dimension annotation.
dimStyle: Object ID of DimStyleTableRecord to use.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.#ctor
Default constructor. Initializes the origin, defining, and leader endpoints all to (0,0,0), and sets the X axis to be used. In addition, all the initializations of the default constructor for Dimension, Entity, etc. are performed.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.LeaderEndPoint
Gets or sets the point that is used as the dimension leader's endpoint and is used in the text position calculations.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.DefiningPoint
Gets or sets the ordinate point (in WCS coordinates) to be measured. The dimension measures the X or Y distance between this point and the dimension's origin point.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.Origin
Gets or sets the point (in WCS coordinates) that the dimension treats as (0,0,0) for distance calculations.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.UsingYAxis
Gets true if the dimension measures the Y axis distance between the dimension's origin point and the definingPoint.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.UsingXAxis
Gets true if the dimension measures the X axis distance between the dimension's origin point and the definingPoint.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.{dtor}
