Autodesk.AutoCAD.DatabaseServices.UnderlayItemCollection
Provides a collection for UnderlayItem objects.

Autodesk.AutoCAD.DatabaseServices.UnderlayItemCollection.Count
Gets the number of objects in the collection.
Returns: Returns a value representing the number of objects in the collection.

Autodesk.AutoCAD.DatabaseServices.UnderlayItemCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.UnderlayItemCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.UnderlayItem[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.

Autodesk.AutoCAD.DatabaseServices.UnderlayItemCollection.GetEnumerator
Gets an enumerator for the collection.
Returns: An enumerator that can be used to iterate through the collection.