Autodesk.AutoCAD.GraphicsInterface.EdgeVisibilityModes
Describes a collection of bitflags representing the combination of edge styles that are in effect for display of edges.

Autodesk.AutoCAD.GraphicsInterface.EdgeVisibilityModes.Intersection
Intersection edges will be displayed. An intersection edge is that which is inferred from portions of different intersecting objects.

Autodesk.AutoCAD.GraphicsInterface.EdgeVisibilityModes.Obscured
Obscured edges will be displayed. An obscured edge is that which would not be visible when in a shaded view.

Autodesk.AutoCAD.GraphicsInterface.EdgeVisibilityModes.Silhouette
Silhouette edges will be displayed. A silhouette edge is an edge connecting a back facing polygon with a front facing polygon.

Autodesk.AutoCAD.GraphicsInterface.EdgeVisibilityModes.Visible
Visible edges will be displayed.

Autodesk.AutoCAD.GraphicsInterface.EdgeVisibilityModes.None
No styles will be applied to the edges.