Autodesk.AutoCAD.DatabaseServices.SecurityActions
Encapsulates a corresponding ObjectARX enum that is used by the SecurityParams ObjectARX struct.

Autodesk.AutoCAD.DatabaseServices.SecurityActions.AddTimeStamp


Autodesk.AutoCAD.DatabaseServices.SecurityActions.SignData


Autodesk.AutoCAD.DatabaseServices.SecurityActions.EncryptProperties


Autodesk.AutoCAD.DatabaseServices.SecurityActions.EncryptData
