Autodesk.AutoCAD.DatabaseServices.Filters.Index
This is the base class for Index objects.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Filters.Index.IsUptoDate
Gets true if the index is up-to-date.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.LastUpdatedAtU
Gets or sets the Universal time that the index was last updated.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.LastUpdatedAt
Gets or sets the TDUPDATE value of the Database when the index was last updated.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.ObjectBeingIndexedId
Gets ObjectId of owning block table record or ObjectId.Null if no owner.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.RebuildFull(Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData)
Completely rebuilds the index from the entities in the associated block table record.
indexData: IndexUpdateData object for use during the index rebuild.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.GetIterator(Autodesk.AutoCAD.DatabaseServices.Filters.Filter)
Creates a new FilteredBlockIterator object.
filter: Filter(query)to be applied to the index for the iterator based traversal.
Returns: Index iterator.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.{dtor}
