Autodesk.AutoCAD.DatabaseServices.Polyline2d
Represents the 2D polyline entity within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.#ctor(Autodesk.AutoCAD.DatabaseServices.Poly2dType,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Double,System.Boolean,System.Double,System.Double,Autodesk.AutoCAD.Geometry.DoubleCollection)
Constructor.
type: Polyline type.
vertices: Array of points to be used as the vertices for the polyline.
elevation: Elevation, which is 0 by default.
closed: Boolean indicates if polyline should be closed.
startWidth: Default start width value.
endWidth: Default end width value.
bulges: Array of doubles which are the bulge values for all the vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.#ctor
Default constructor. Constructs an open polyline with linetype generation off and initializes the start and end widths to 0.0, the bulge to 0.0, the elevation to 0.0, the type to Poly2dType.implePoly, the normal to (0,0,1), and the thickness to 0.0.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Polyline2d.LinetypeGenerationOn
Gets or sets true if linetype generation is turned on for the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Elevation
Gets or sets the elevation of the polyline. The elevation is the OCS Z axis value of the polyline (that is, the shortest distance from the WCS origin to the plane containing the polyline).

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Normal
Gets or sets the normal vector of the plane containing the polyline. The normal vector is in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Thickness
Gets or sets the thickness of the polyline. The thickness is the polyline's dimension along its normal vector direction (sometimes called the extrusion direction).

Autodesk.AutoCAD.DatabaseServices.Polyline2d.DefaultEndWidth
Gets or sets the default polyline segment ending width value for the polyline. This value is used as the default end width for all vertices within the polyline. So, for DXFOUT, vertices that have this end width will not write the value out. For DXFIN, vertices that do not have a DXF group code 41 value will use the polyline's default end width.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.DefaultStartWidth
Gets or sets the default polyline segment starting width value for the polyline. This value is used as the default start width for all vertices within the polyline. So, for DXFOUT, vertices that have this start width will not write the value out. For DXFIN, vertices that do not have a DXF group code 40 value will use the polyline's default start width.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Closed
Gets or sets a boolean indicating the polyline is closed.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.PolyType
Gets or sets the curve/spline-fit type for this polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.ConvertToPolyType(Autodesk.AutoCAD.DatabaseServices.Poly2dType)
Uses the SplineFit() and/or CurveFit() methods to convert the polyline to the type specified by the newVal argument value.
newVal: Type to which the polyline should be converted.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Straighten
Removes all spline and curve-fit vertices from the polyline and sets all remaining vertices to be simple vertices. This operation performs the same modification as the PEDIT command "Decurve" option.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.SplineFit(Autodesk.AutoCAD.DatabaseServices.Poly2dType,System.Int32)
This method removes any existing spline or curve-fit vertices, converts all remaining vertices to spline-control vertices, and generates a new set of spline-fit vertices. The resultant polyline is spline fit through the new set of vertices. This operation performs the same modification as the PEDIT command "Spline fit" option except that it uses value and segments as control parameters for the SplineFit operation rather than the splinetype and splinesegs database/system variables.
value: SplineType to be used for the SplineFit operation on the polyline.
segments: SplineSegments value to be used for the SplineFit operation on the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.SplineFit
This method removes any existing spline or curve-fit vertices, converts all remaining vertices to spline-control vertices, and generates a new set of spline-fit vertices. The resultant polyline is spline fit through the new set of vertices. This operation performs the same modification as the PEDIT command "Spline fit" option.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.CurveFit
This method creates a smooth curve consisting of pairs of arcs joining each pair of vertices. The curve passes through all the vertices of the polyline and uses any tangent direction specified by the individual vertices. This operation performs the same modification as the PEDIT command "Fit" option.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.NonDBAppendVertex(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This method appends the Vertex2d object defined by vertexToAppend to the vertex list of the polyline and establishes the polyline as the vertex's owner. In addition, if the polyline is resident within a Database, the vertex will be added to the same database. If the polyline is not database-resident, then when it is added to a database, the vertex will be added as well.
vertexToAppend: The vertex to add to the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.AppendVertex(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This method appends the Vertex2d object defined by vertexToAppend to the vertex list of the polyline, establishes the polyline as the vertex's owner, and adds the vertex the Database that contains the polyline (the polyline must be database-resident for this method to succeed).
vertexToAppend: The vertex to add to the polyline.
Returns: Object ID of the added vertex.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This method inserts the Vertex2d object defined by newVertex into the vertex list of the polyline just after the Vertex2d object with objectId vertexId, establishes the polyline as the vertex's owner, and adds the vertex to the Database that contains the polyline (the polyline must be database-resident for this method to succeed).
vertexId: ObjectId of the vertex in the polyline after which the new vertex is to be inserted.
newVertex: Vertex to be inserted.
Returns: Object ID of newVertex.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.Vertex2d,Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This method inserts the Vertex2d object defined by newVertex into the vertex list of the polyline just after the Vertex2d object defined by indexVertex and establishes the polyline as the vertex's owner. In addition, if the polyline is resident within a Database, the vertex will be added to the same database. If the polyline is not database-resident, then when it is added to a database, the vertex will be added as well.
indexVertex: Vertex in polyline after which the new vertex is to be inserted.
newVertex: Vertex to be inserted.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.GetEnumerator
Gets an enumerator to iterate over the vertices of the polyline.
Returns: An enumerator that can be used to iterate over the vertices of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.VertexPosition(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
Returns the WCS coordinate position value of vertex.
vertex: Vertex object to get the WCS coordinate for.
Returns: The WCS coordinate position value of vertex.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.{dtor}
