Autodesk.AutoCAD.DatabaseServices.PlotStyleTableChangedEventArgs
Provides data for PlotStyleTableChanged event of the LayoutManager class.

Autodesk.AutoCAD.DatabaseServices.PlotStyleTableChangedEventArgs.NewName
Gets the name of the plot style table that is newly associated with the layout denoted by Id.

Autodesk.AutoCAD.DatabaseServices.PlotStyleTableChangedEventArgs.Id
Gets the object ID of the layout that is changing.