Autodesk.AutoCAD.GraphicsInterface.ShadowMode
The available methods for computing ray-traced shadows.

Autodesk.AutoCAD.GraphicsInterface.ShadowMode.Simple
Simple shadows, with no sorting of shadow rays.

Autodesk.AutoCAD.GraphicsInterface.ShadowMode.Segments
Shadow segments, from light to sample point.

Autodesk.AutoCAD.GraphicsInterface.ShadowMode.Sorted
Shadow sorting, from sample point to light.