Autodesk.AutoCAD.Geometry.Scale2d
The class Scale2d is called "scale vector 2D." This class is used to represent scaling transformations in 2D space.

Autodesk.AutoCAD.Geometry.Scale2d.#ctor(System.Double[])
Constructor.Constructs scale transformation with scale factors xy.
xy: X and Y direction scale.

Autodesk.AutoCAD.Geometry.Scale2d.#ctor(System.Double,System.Double)
Constructor.Constructs scale transformation with scale factors x and y.
x: X direction scale.
y: Y direction scale.

Autodesk.AutoCAD.Geometry.Scale2d.#ctor(System.Double)
Constructor. Constructs the uniform scale transformation with scale factor factor.
factor: Uniform scale factor.

Autodesk.AutoCAD.Geometry.Scale2d.Coordinate(System.Int32)
Gets the ith axis coordinate of this object, where i is the zero-based index of the desired coordinate. For 2D objects, i must be in the range 0-1. For 3D objects, i must be in the range 0-2.

Autodesk.AutoCAD.Geometry.Scale2d.Y
Gets scaling component on the y-axis.

Autodesk.AutoCAD.Geometry.Scale2d.X
Gets scaling component on the x-axis.

Autodesk.AutoCAD.Geometry.Scale2d.PreMultiplyBy(Autodesk.AutoCAD.Geometry.Scale2d)
Sets this scale vector to the product of itself and the scale vector leftSide. Note that the multiplication of scale vectors is commutative.
leftSide: Scale vector.
Returns: The reference to this scale vector.

Autodesk.AutoCAD.Geometry.Scale2d.PostMultiplyBy(Autodesk.AutoCAD.Geometry.Scale2d)
Sets this scale vector to the product of itself and the scale vector rightSide. Note that the multiplication of scale vectors is commutative.
rightSide: Scale vector.
Returns: The reference to this scale vector.

Autodesk.AutoCAD.Geometry.Scale2d.MultiplyBy(System.Double)


Autodesk.AutoCAD.Geometry.Scale2d.Inverse
Returns the scale vector with the inverse scale factors.
Returns: The scale vector with the inverse scale factors.

Autodesk.AutoCAD.Geometry.Scale2d.IsProportional
Returns true if the matrix of scaling corresponding to this scale vector IsUniScaledOrtho().
Returns: true if the matrix of scaling corresponding to this scale vector IsUniScaledOrtho().

Autodesk.AutoCAD.Geometry.Scale2d.IsProportional(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the matrix of scaling corresponding to this scale vector IsUniScaledOrtho().
tolerance: Tolerance.
Returns: true if the matrix of scaling corresponding to this scale vector IsUniScaledOrtho().

Autodesk.AutoCAD.Geometry.Scale2d.GetMatrix
Returns the matrix that corresponds to the same scaling transformations as the one determined by this scale vector.
Returns: The matrix that corresponds to the same scaling transformations as the one determined by this scale vector.

Autodesk.AutoCAD.Geometry.Scale2d.ExtractScale(Autodesk.AutoCAD.Geometry.Matrix2d)
Returns scale vector with scale factors equal to the lengths of the vectors forming the columns of the matrix mat.
mat: Matrix.
Returns: Scale vector with scale factors equal to the lengths of the vectors forming the columns of the matrix mat.

Autodesk.AutoCAD.Geometry.Scale2d.RemoveScale(Autodesk.AutoCAD.Geometry.Matrix2d)
For each index i is less than 2, this method sets the i-th scale factor of this scale vector to the length of the i-th column of the matrix mat considered as vector. If det(mat) is not positive, then sx is negated. Then for each index i that is less than 2, the i-th column is divided by i-th scale factor.
mat: Matrix.
Returns: The reference to this scale vector.

Autodesk.AutoCAD.Geometry.Scale2d.GetHashCode


Autodesk.AutoCAD.Geometry.Scale2d.Equals(System.Object)


Autodesk.AutoCAD.Geometry.Scale2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Scale2d)


Autodesk.AutoCAD.Geometry.Scale2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Scale2d,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.Geometry.Scale2d.ToString(System.IFormatProvider)


Autodesk.AutoCAD.Geometry.Scale2d.ToString


Autodesk.AutoCAD.Geometry.Scale2d.ToArray
Returns an array containing the coordinates of this scale vector.
Returns: An array containing the coordinates of this scale vector.

Autodesk.AutoCAD.Geometry.Scale2d.op_Inequality(Autodesk.AutoCAD.Geometry.Scale2d,Autodesk.AutoCAD.Geometry.Scale2d)


Autodesk.AutoCAD.Geometry.Scale2d.op_Equality(Autodesk.AutoCAD.Geometry.Scale2d,Autodesk.AutoCAD.Geometry.Scale2d)


Autodesk.AutoCAD.Geometry.Scale2d.op_Multiply(System.Double,Autodesk.AutoCAD.Geometry.Scale2d)


Autodesk.AutoCAD.Geometry.Scale2d.op_Multiply(Autodesk.AutoCAD.Geometry.Scale2d,System.Double)


Autodesk.AutoCAD.Geometry.Scale2d.op_Multiply(Autodesk.AutoCAD.Geometry.Scale2d,Autodesk.AutoCAD.Geometry.Scale2d)
