Autodesk.AutoCAD.DatabaseServices.TypedValue
This value type may contain objects of various types. The type of the value is indicated by this object's TypeCode property, which is analogous to the restype member of the ObjectARX resbuf structure.

Autodesk.AutoCAD.DatabaseServices.TypedValue.#ctor(System.Int32,System.Object)
Constructor.
typeCode: The type of the value.
value: Value.

Autodesk.AutoCAD.DatabaseServices.TypedValue.#ctor(System.Int32)
Constructor.
typeCode: The type of the value.

Autodesk.AutoCAD.DatabaseServices.TypedValue.Value
Gets the value.

Autodesk.AutoCAD.DatabaseServices.TypedValue.TypeCode
Gets the type of the value.

Autodesk.AutoCAD.DatabaseServices.TypedValue.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.TypedValue.GetHashCode


Autodesk.AutoCAD.DatabaseServices.TypedValue.ToString(System.IFormatProvider)


Autodesk.AutoCAD.DatabaseServices.TypedValue.ToString


Autodesk.AutoCAD.DatabaseServices.TypedValue.op_Inequality(Autodesk.AutoCAD.DatabaseServices.TypedValue,Autodesk.AutoCAD.DatabaseServices.TypedValue)


Autodesk.AutoCAD.DatabaseServices.TypedValue.op_Equality(Autodesk.AutoCAD.DatabaseServices.TypedValue,Autodesk.AutoCAD.DatabaseServices.TypedValue)
