Autodesk.AutoCAD.DatabaseServices.RadialDimension
Represents the radius dimension type in AutoCAD.

Autodesk.AutoCAD.DatabaseServices.RadialDimension.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor uses the parameters passed in to initialize the dimension. In addition, the rest of the Dimension, Entity, etc. default constructor initializations are performed.
center: Center point (in WCS coordinates) of curve being dimensioned.
chordPoint: Point (in WCS coordinates) on the curve being dimensioned.
leaderLength: Leader length.
dimensionText: Text string to use as the dimension annotation.
dimensionStyle: Object ID of DimStyleTableRecord to use.

Autodesk.AutoCAD.DatabaseServices.RadialDimension.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RadialDimension.ChordPoint
Gets or sets the point (in WCS coordinates) where the dimension line intersects the curve being dimensioned.

Autodesk.AutoCAD.DatabaseServices.RadialDimension.Center
Gets or sets the center point (in WCS coordinates) of the curve being dimensioned.

Autodesk.AutoCAD.DatabaseServices.RadialDimension.LeaderLength
Obsolete.

Autodesk.AutoCAD.DatabaseServices.RadialDimension.{dtor}
