Autodesk.AutoCAD.DatabaseServices.BeginWblockSelectedObjectsEventArgs
Provides data for the BeginWblockSelectedObjects event of the database.

Autodesk.AutoCAD.DatabaseServices.BeginWblockSelectedObjectsEventArgs.From
Gets the database being wblocked.