Autodesk.AutoCAD.GraphicsInterface.WorldDraw
Provides functionality that has the ability to generate geometry that doesn't change for different viewports.

Autodesk.AutoCAD.GraphicsInterface.WorldDraw.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.WorldDraw.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.WorldDraw.Geometry
Gets a reference to the WorldGeometry object. The WorldGeometry object allows the user to generate geometry (polylines, arcs, meshes, etc.).

Autodesk.AutoCAD.GraphicsInterface.WorldDraw.{dtor}
