Autodesk.AutoCAD.DatabaseServices.FieldEvaluationOptions
Specifies the evaluation option for the field.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationOptions.OnSave
Evaluate during drawing save.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationOptions.Automatic
Automatically evaluate fields during all the operations.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationOptions.OnDemand
Evaluate only on demand by the user or the API.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationOptions.OnRegen
Evaluate during regen.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationOptions.OnEtransmit
Evaluate during eTransmit.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationOptions.OnPlot
Evaluate during drawing plot.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationOptions.OnOpen
Evaluate during drawing load.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationOptions.Disable
Disable evaluationFieldEvaluationStatus.