Autodesk.AutoCAD.DatabaseServices.CustomScale
Encapsulates the numerator and denominator values that define a custom print scale.

Autodesk.AutoCAD.DatabaseServices.CustomScale.#ctor(System.Double,System.Double)
Constructor.
numerator: Input System.Double object.
denominator: Input System.Double object.

Autodesk.AutoCAD.DatabaseServices.CustomScale.Denominator
Gets the Denominator property value.

Autodesk.AutoCAD.DatabaseServices.CustomScale.Numerator
Gets the Numerator property value.

Autodesk.AutoCAD.DatabaseServices.CustomScale.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.CustomScale.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: System.IFormatProvider object.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.CustomScale.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj: System.Object object.
Returns: true if this object is identical to the argument object.

Autodesk.AutoCAD.DatabaseServices.CustomScale.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.CustomScale)
Calls the IsEqualTo(CustomScale a, Tolerance tolerance) overload with tolerance set to Global.
a: Autodesk.AutoCAD.DatabaseServices.CustomScale object.
Returns: A value that indicates whether the difference between the two falls within the range of tolerance.

Autodesk.AutoCAD.DatabaseServices.CustomScale.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.CustomScale,Autodesk.AutoCAD.Geometry.Tolerance)
Compares this CustomScale object to a.
a: Autodesk.AutoCAD.DatabaseServices.CustomScale object.
tolerance: Autodesk.AutoCAD.Geometry.Tolerance object.
Returns: A value that indicates whether the difference between the two falls within the range of tolerance.

Autodesk.AutoCAD.DatabaseServices.CustomScale.GetHashCode
Returns the hash code for this object.
Returns: the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.CustomScale.op_Inequality(Autodesk.AutoCAD.DatabaseServices.CustomScale,Autodesk.AutoCAD.DatabaseServices.CustomScale)
.
: .
: .

Autodesk.AutoCAD.DatabaseServices.CustomScale.op_Equality(Autodesk.AutoCAD.DatabaseServices.CustomScale,Autodesk.AutoCAD.DatabaseServices.CustomScale)
.
: .
: .