Autodesk.AutoCAD.Geometry.Sphere
Represents a spherical surface.

Autodesk.AutoCAD.Geometry.Sphere.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Constructs a spherical segment defined by the input data.
radius: Radius for the sphere.
center: Center point for the sphere.
northAxis: Direction to the north pole.
referenceAxis: Direction to the zero meridian.
startAngleU: Start longitude.
endAngleU: End longitude.
startAngleV: Start latitude.
endAngleV: End latitude.

Autodesk.AutoCAD.Geometry.Sphere.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Constructs a sphere with the input radius centered at the input center.
radius: Radius for the sphere.
center: Center point for the sphere.

Autodesk.AutoCAD.Geometry.Sphere.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.Sphere.IsOuterNormal
Gets flag indicating if the sphere normal is pointing outwards.

Autodesk.AutoCAD.Geometry.Sphere.SouthPole
Gets position of the south pole.

Autodesk.AutoCAD.Geometry.Sphere.NorthPole
Gets position of the north pole.

Autodesk.AutoCAD.Geometry.Sphere.ReferenceAxis
Gets direction to the zero meridian.

Autodesk.AutoCAD.Geometry.Sphere.NorthAxis
Gets direction to the north pole.

Autodesk.AutoCAD.Geometry.Sphere.Center
Gets sphere's center.

Autodesk.AutoCAD.Geometry.Sphere.Radius
Gets sphere's radius.

Autodesk.AutoCAD.Geometry.Sphere.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Sphere.GetAnglesInU
Computes start and end longitudes.
Returns: Start and end longitudes.

Autodesk.AutoCAD.Geometry.Sphere.GetAnglesInV
Computes start and end latitudes.
Returns: Start and end latitudes.

Autodesk.AutoCAD.Geometry.Sphere.IsClosed
Returns flag indicating if spherical segment is a full circular belt.
Returns: Flag indicating if spherical segment is a full circular belt.

Autodesk.AutoCAD.Geometry.Sphere.IsClosed(Autodesk.AutoCAD.Geometry.Tolerance)
Returns flag indicating if spherical segment is a full circular belt with respect to the tolerance specified.
tolerance: Tolerance.
Returns: Flag indicating if spherical segment is a full circular belt.

Autodesk.AutoCAD.Geometry.Sphere.SetAnglesInU(System.Double,System.Double)
Changes sphere definition to satisfy the input data.
startAngle: Start longitude.
endAngle: End longitude.

Autodesk.AutoCAD.Geometry.Sphere.SetAnglesInV(System.Double,System.Double)
Changes sphere definition to satisfy the input data.
startAngle: Start latitude.
endAngle: End latitude.

Autodesk.AutoCAD.Geometry.Sphere.Set(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Changes sphere definition to satisfy the input data.
radius: Radius for the sphere.
center: Center point for the sphere.
northAxis: Direction to the north pole.
referenceAxis: Direction to the zero meridian.
startAngleU: Start longitude.
endAngleU: End longitude.
startAngleV: Start latitude.
endAngleV: End latitude.

Autodesk.AutoCAD.Geometry.Sphere.Set(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Changes sphere definition to satisfy the input data.
radius: Radius for the sphere.
center: Center point for the sphere.

Autodesk.AutoCAD.Geometry.Sphere.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
Computes intersections with a linear entity.
linearEntity: Linear entity.
Returns: First and second intersection.

Autodesk.AutoCAD.Geometry.Sphere.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Computes intersections with a linear entity.
linearEntity: Linear entity.
tolerance: Tolerance.
Returns: First and second intersection.

Autodesk.AutoCAD.Geometry.Sphere.{dtor}
