Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits
Represents render environment (fog and environment map) to the underlying display system.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.EnvironmentMap
Gets or sets the enviroment texture map.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.FarPercentage
Gets or sets the far percentage of the fog.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.NearPercentage
Gets or sets the near percentage of the fog.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.FarDistance
Gets or sets the far distance of the fog.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.NearDistance
Gets or sets the near distance of the fog.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.FogColor
Gets or sets the color of the fog.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.IsBackground
Gets or sets true if the fog is set as background.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.Enable
Gets or sets true if the fog is enabled.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.{dtor}
