Autodesk.AutoCAD.Geometry.Matrix2d
Represents an affine transformation of 2D space, including translation.

Autodesk.AutoCAD.Geometry.Matrix2d.#ctor(System.Double[])


Autodesk.AutoCAD.Geometry.Matrix2d.ElementAt(System.Int32,System.Int32)


Autodesk.AutoCAD.Geometry.Matrix2d.CoordinateSystem2d
Gets the origin and axes of the coordinate system to which this matrix maps the coordinate system with the origin (0, 0) and axes (1, 0) and (0,1).

Autodesk.AutoCAD.Geometry.Matrix2d.Translation
Gets the translation part of this matrix.

Autodesk.AutoCAD.Geometry.Matrix2d.Multiply(Autodesk.AutoCAD.Geometry.Matrix2d)


Autodesk.AutoCAD.Geometry.Matrix2d.PreMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Sets this matrix to the product leftSide * (this matrix).
leftSide: Left side of matrix.
Returns: leftSide * (this matrix).

Autodesk.AutoCAD.Geometry.Matrix2d.PostMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Sets this matrix to the product (this matrix) * rightSide.
rightSide: Left side of matrix.
Returns: (this matrix) * rightSide.

Autodesk.AutoCAD.Geometry.Matrix2d.Inverse
Returns inverse matrix.
Returns: Inverse matrix.

Autodesk.AutoCAD.Geometry.Matrix2d.IsSingular
Returns true if either of the vectors returned by the property CoordinateSystem2d has zero length, or if these vectors are parallel.
Returns: true if either of the vectors returned by the property CoordinateSystem2d has zero length, or if these vectors are parallel.

Autodesk.AutoCAD.Geometry.Matrix2d.IsSingular(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if either of the vectors returned by the property CoordinateSystem2d has zero length, or if these vectors are parallel.
tolerance: Tolerance.
Returns: true if either of the vectors returned by the property CoordinateSystem2d has zero length, or if these vectors are parallel.

Autodesk.AutoCAD.Geometry.Matrix2d.Transpose
Returns the matrix that is the result of transposition of this matrix.
Returns: The matrix that is the result of transposition of this matrix.

Autodesk.AutoCAD.Geometry.Matrix2d.IsUniscaledOrtho
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors and these two vectors have equal length.
Returns: true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors and these two vectors have equal length.

Autodesk.AutoCAD.Geometry.Matrix2d.IsUniscaledOrtho(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors and these two vectors have equal length.
tolerance: Tolerance.
Returns: true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors and these two vectors have equal length.

Autodesk.AutoCAD.Geometry.Matrix2d.IsScaledOrtho
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors.
Returns: true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors.

Autodesk.AutoCAD.Geometry.Matrix2d.IsScaledOrtho(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors.
tolerance: Tolerance.
Returns: true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors.

Autodesk.AutoCAD.Geometry.Matrix2d.GetScale
Returns scale factor of matrix. The returned scale is the square root of the maximum length of the two column vectors.
Returns: Scale factor of matrix.

Autodesk.AutoCAD.Geometry.Matrix2d.GetDeterminant
Returns the determinant of this matrix.
Returns: The determinant of this matrix.

Autodesk.AutoCAD.Geometry.Matrix2d.IsConformal(Autodesk.AutoCAD.Geometry.Matrix2dInfo)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors and these two vectors have equal length.
info: The scale factor of the matrix, the angle of rotation, and whether there is a mirror component to the matrix.
Returns: true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors and these two vectors have equal length.

Autodesk.AutoCAD.Geometry.Matrix2d.Displacement(Autodesk.AutoCAD.Geometry.Vector2d)
Returns the matrix of the translation by the vector vector.
vector: Translation vector.
Returns: The matrix of the translation by the vector vector.

Autodesk.AutoCAD.Geometry.Matrix2d.Rotation(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Returns the matrix of the rotation by angle angle around the point center.
angle: Rotation angle.
center: Center of rotation.
Returns: The matrix of the rotation by angle angle around the point center.

Autodesk.AutoCAD.Geometry.Matrix2d.Scaling(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Returns the matrix of uniform scaling by scale factor scaleAll with respect to the point center.
scaleAll: Scale factor.
center: Origin of the scale.
Returns: The matrix of uniform scaling by scale factor scaleAll with respect to the point center.

Autodesk.AutoCAD.Geometry.Matrix2d.Mirroring(Autodesk.AutoCAD.Geometry.Line2d)
Returns the matrix of mirroring with respect to line line.
line: The mirror line.
Returns: The matrix of mirroring with respect to line line.

Autodesk.AutoCAD.Geometry.Matrix2d.Mirroring(Autodesk.AutoCAD.Geometry.Point2d)
Returns the matrix of mirroring with respect to point point. This is the same as central symmetry with a center point.
point: Point that defines the mirror line.
Returns: The matrix of mirroring with respect to point point.

Autodesk.AutoCAD.Geometry.Matrix2d.AlignCoordinateSystem(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Returns matrix that maps the coordinate system with the origin fromOrigin and the axes fromE0 and fromE1 to the coordinate system with the origin toOrigin and the axes toE0 and toE1.
fromOrigin: Point that defines the origin of the from coordinate system.
fromE0: Vector that defines the x axis of the from coordinate system.
fromE1: Vector that defines the y axis of the from coordinate system.
toOrigin: Point that defines the origin of the to coordinate system.
toE0: Vector that defines the x axis of the to coordinate system.
toE1: Vector that defines the y axis of the to coordinate system.
Returns: Matrix that maps the coordinate system with the origin fromOrigin and the axes fromE0 and fromE1 to the coordinate system with the origin toOrigin and the axes toE0 and toE1.

Autodesk.AutoCAD.Geometry.Matrix2d.Equals(System.Object)


Autodesk.AutoCAD.Geometry.Matrix2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix2d)


Autodesk.AutoCAD.Geometry.Matrix2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.Geometry.Matrix2d.GetHashCode


Autodesk.AutoCAD.Geometry.Matrix2d.ToString(System.IFormatProvider)


Autodesk.AutoCAD.Geometry.Matrix2d.ToString


Autodesk.AutoCAD.Geometry.Matrix2d.ToArray
Returns this matrix as a 1-dimensional array containing 9 elements of type System.Double. The array elements store the matrix row (rn) and column (cn) indices in the following order:r0c0r0c1r0c2r1c0r1c1r1c2r2c0r2c1r2c2.
Returns: A 1-dimensional array containing 9 elements of type System.Double.

Autodesk.AutoCAD.Geometry.Matrix2d.op_Inequality(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Matrix2d)


Autodesk.AutoCAD.Geometry.Matrix2d.op_Equality(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Matrix2d)


Autodesk.AutoCAD.Geometry.Matrix2d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Matrix2d)
