Autodesk.AutoCAD.LayerManager.AndExpression
This class represents a term of the form a AND b AND c and so on.

Autodesk.AutoCAD.LayerManager.AndExpression.GetRelationalExpressions
Returns relational expressions that are joined by AND.
Returns: Relational expressions that are joined by AND.