Autodesk.AutoCAD.GraphicsInterface.ShadowParameters
This is a container class for all shadow related light properties.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowMapSoftness
Gets or sets the softness (or fuzziness) of the edge of the shadow. This value represents the number of pixels at the edge of the shadow that are blended into the underlying image.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowMapSize
Gets or sets the shadow map size. The value should be one of: 64, 128, 256, 512, 1024, 2048, or 4096.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowType
Gets or sets the method used to calculate shadows cast by this light.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowsOn
Gets or sets a boolean indicating whether or not this light casts shadows.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.{dtor}
