Autodesk.AutoCAD.Geometry.Entity2d
Abstract base class for all point set classes. Any class that is derived from this class represents a set of points in 2D space.

Autodesk.AutoCAD.Geometry.Entity2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Entity2d.Clone


Autodesk.AutoCAD.Geometry.Entity2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Entity2d)


Autodesk.AutoCAD.Geometry.Entity2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Entity2d,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.Geometry.Entity2d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Transforms the entity by applying the input matrix.
transform: Transformation matrix.

Autodesk.AutoCAD.Geometry.Entity2d.TranslateBy(Autodesk.AutoCAD.Geometry.Vector2d)
Translates the entity by the input vector.
translateVector: Vector by which entity is to be translated.

Autodesk.AutoCAD.Geometry.Entity2d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Rotates the entity about the input point by the input angle.
angle: Angle of rotation.
point: Point about which to rotate.

Autodesk.AutoCAD.Geometry.Entity2d.Mirror(Autodesk.AutoCAD.Geometry.Line2d)
Transforms the entity by mirroring it across the input line.
line: 2D mirror line.

Autodesk.AutoCAD.Geometry.Entity2d.ScaleBy(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Scales the entity about the input point by the input scale factor. Input scale factor must be greater than 0.
scaleFactor: Amount by which entity is to be scaled.
point: Point about which entity is to be scaled.

Autodesk.AutoCAD.Geometry.Entity2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d)
Returns true if point lies on entity.
point: Any 2D point.
Returns: true if point lies on entity.

Autodesk.AutoCAD.Geometry.Entity2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if point lies on entity.
point: Any 2D point.
tolerance: Tolerance for tangent intersections.
Returns: true if point lies on entity.

Autodesk.AutoCAD.Geometry.Entity2d.DeleteUnmanagedObject


Autodesk.AutoCAD.Geometry.Entity2d.{dtor}
