Autodesk.AutoCAD.DatabaseServices.PlotPaperUnit
Plot Paper Unit.

Autodesk.AutoCAD.DatabaseServices.PlotPaperUnit.Pixels
Plot in pixels.

Autodesk.AutoCAD.DatabaseServices.PlotPaperUnit.Millimeters
Plot in millimeters.

Autodesk.AutoCAD.DatabaseServices.PlotPaperUnit.Inches
Plot in inches.