Autodesk.AutoCAD.DatabaseServices.DrawOrderTable
Is the persistent container for draw order information. It resides in the extension dictionary of an associated BlockTableRecord under the key ACAD_SORTENTS.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.BlockId
Gets or sets the object ID for the associated block table record.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.GetSortHandle(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Given an input object ID, this method returns the Handle that indicates the draw order.
id: Object ID.
Returns: Handle that indicates the draw order.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveToBottom(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Places all the entities specified in the input object ID array at the beginning of the draw order. The entities being moved retain their relative draw order.
collection: Array of object IDs.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveToTop(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Places all the entities specified in the input object ID array at the ending of the draw order. The entities being moved retain their relative draw order.
collection: Array of object IDs.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveBelow(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Places all the entities specified in the input object ID array below the specified target entity. The entities being moved retain their relative draw order.
collection: Array of object IDs.
target: Target entity.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveAbove(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Places all the entities specified in the input object ID array above the specified target entity. The entities being moved retain their relative draw order.
collection: Array of object IDs.
target: Target entity.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.SwapOrder(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Swaps the draw order positions of the entities.
id1: Object ID of first entity.
id2: Object ID of second entity.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.FirstEntityIsDrawnBeforeSecond(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets true if first is drawn before second.
first: First object ID.
second: Second object ID.
Returns: True if first is drawn before second.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.GetFullDrawOrder(System.Byte)
Returns an array of the entity object IDs of the block in the order in which they would be drawn in SORTENTS-enabled contexts. The caller supplies an empty object ID array, and disposes of it after use.
honorSortEntitiesMask: Indicating whether to test the host database's $SORTENTS variable.
Returns: Array of object IDs.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.GetRelativeDrawOrder(System.Byte)
Rearranges the object IDs in the input array into their current relative draw order.
honorSortEntitiesMask: Indicating whether to test the host database's $SORTENTS variable.
Returns: Array of object IDs.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.SetRelativeDrawOrder(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Takes the object IDs in the input array and moves them in their current associated draw order slots so that they are drawn in the specified order.
collection: Array of object IDs.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.{dtor}
