Autodesk.AutoCAD.GraphicsInterface.ClipBoundary
Used to pass a clip boundary specification from a drawable to the underlying Autodesk.AutoCAD.GraphicsInterface system.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.DrawBoundary
Gets or sets true if the clipping boundary will be drawn to the display.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.BackClipZ
Gets or sets the Z depth for the back clipping plane, if active.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.FrontClipZ
Gets or sets the Z depth for the front clipping plane, if active.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.ClippingBack
Gets or sets true if a front clipping plane is active and BackClipZ should contain a valid Z depth.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.ClippingFront
Gets or sets true if a front clipping plane is active and FrontClipZ should contain a valid Z depth.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.TransformInverseBlockRefXForm
Gets or sets the transform that the compound object uses to transform its contents. For a block reference, this is based on the block insertion transform and the translation stored in the block table record.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.TransformToClipSpace
Gets or sets the transformation from the compound object's coordinate system to the desired clip space. Often this will be an identity transform.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.Point
Gets or sets the origin of the clip space expressed in the compound object's coordinate system. Often this will be Point3d.Origin.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.NormalVector
Gets or sets Z-Axis of the clip space expressed in the compound object's coordinate system. Often this will be Vector3d.ZAxis.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.GetAptPoints
Gets AptPoints of the ClipBoundary.AptPoints is an array of 2D points expressed in the clip coordinate system.If the array contains less than two points, the boundary is invalid and the results are undefined.If the array contains only two points, then boundary is inferred to be rectangular, where the two points define the opposing corners of the rectangle. If the array contains more than two points, it is taken to define a polygon.
Returns: AptPoints of the ClipBoundary.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.SetAptPoints(Autodesk.AutoCAD.Geometry.Point2dCollection)
Sets AptPoints of the ClipBoundary.
point: Point2dCollection object.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.{dtor}
