Autodesk.AutoCAD.DatabaseServices.DwgFiler
Provides the interface for derived classes that are used for I/O operations that work with the DWG information format.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.Position
This property is not implemented.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.DwgVersion
Gets the drawing file version, such as Release 13 or Release 14.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.FilerType
Gets a FilerType value indicating the actual type of the filer.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.FilerStatus
Gets or sets a FileStatus value indicating the current status of the filer.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ResetFilerStatus
Resets the filer status.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadHardOwnershipId
Reads an object ID (a long) into the pre-allocated HardOwnershipId object.
Returns: An object ID (a long) into the pre-allocated HardOwnershipId object.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteHardOwnershipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Writes out the long within value.
value: Reference to HardOwnershipId to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadSoftOwnershipId
Reads an object ID (a long) into the pre-allocated SoftOwnershipId object.
Returns: An object ID (a long) into the pre-allocated SoftOwnershipId object.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteSoftOwnershipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Writes out the long within value.
value: Reference to SoftOwnershipId to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadHardPointerId
Reads an object ID (a long) into the pre-allocated HardPointerId object.
Returns: An object ID (a long) into the pre-allocated HardPointerId object.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteHardPointerId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Writes out the long within value.
value: Reference to HardPointerId to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadSoftPointerId
Reads an object ID (a long) into the pre-allocated SoftPointerId object.
Returns: An object ID (a long) into the pre-allocated SoftPointerId object.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteSoftPointerId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Writes out the long within value.
value: Reference to HardPointerId to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadString
Reads in a string value.
Returns: A string value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteString(System.String)
Writes out the string pointed to by value.
value: The string to write out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadHandle
Reads in a handle value.
Returns: A handle value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteHandle(Autodesk.AutoCAD.DatabaseServices.Handle)
Writes out the handle value (a 64-bit integer) contained in value.
value: The Handle object containing the handle value to write out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadInt32
Reads in an Int32 value.
Returns: An Int32 value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteInt32(System.Int32)
Writes out the Int32 value (a short).
value: Int32(a short) to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadInt16
Reads in a an Int16 value.
Returns: An Int16 value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteInt16(System.Int16)
Writes out the Int16 value (a short).
value: Int16(a short) to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadUInt32
Reads in a UInt32 value.
Returns: A UInt32 value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteUInt32(System.UInt32)
Writes out the UInt32 (an unsigned long).
value: UInt32 (an unsigned long) to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadUInt16
Reads in a UInt16 value.
Returns: A UInt16 value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteUInt16(System.UInt16)
Writes out the UInt32(an unsigned short).
value: UInt32(an unsigned short) to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadByte
Reads in a Byte value.
Returns: A Byte value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteByte(System.Byte)
Writes out the Byte(an unsigned char).
value: Byte(an unsigned char) to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadBoolean
Reads in a Boolean value.
Returns: A Boolean value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteBoolean(System.Boolean)
Writes out the Boolean.
value: Boolean to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadDouble
Reads in a Double value.
Returns: A Double value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteDouble(System.Double)
Writes out the Double.
value: Double to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadPoint2d
Reads in a Point2d value.
Returns: A Point2d value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WritePoint2d(Autodesk.AutoCAD.Geometry.Point2d)
Writes out the Point2d.
value: Point2d to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadPoint3d
Reads in a Point3d value.
Returns: A Point3d value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WritePoint3d(Autodesk.AutoCAD.Geometry.Point3d)
Writes out the Point3d.
value: Point3d to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadVector2d
Reads in a Vector2d value.
Returns: A Vector2d value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteVector2d(Autodesk.AutoCAD.Geometry.Vector2d)
Writes out the Vector2d.
value: Vector2d to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadVector3d
Reads in a Vector3d value.
Returns: A Vector3d value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteVector3d(Autodesk.AutoCAD.Geometry.Vector3d)
Writes out the Vector3d.
value: Vector3d to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadScale3d
Reads in a Scale3d value.
Returns: A Scale3d value.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteScale3d(Autodesk.AutoCAD.Geometry.Scale3d)
Writes out the Scale3d.
value: Scale3d to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadBytes(System.Byte[])
Reads in Byte array.
value: Byte array.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteBytes(System.Byte[])
Writes out Byte array.
value: Byte array to be written out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadBinaryChunk
Reads in the short indicating the length of binary data and reads in the address of the start of the data,then copies the data.
Returns: The data.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteBinaryChunk(System.Byte[])
Writes out Byte array.
value: Byte array containing the data to write out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadAddress
Reads in a memory address.
Returns: A memory address.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteAddress(System.IntPtr)
Writes out Memory address.
value: Memory address to write out.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.Seek(System.Int32,System.Int32)
This function is not implemented.
offset: Number of bytes.
method: Initial position.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.{dtor}
