Autodesk.AutoCAD.GraphicsInterface.ImageOrg


Autodesk.AutoCAD.GraphicsInterface.ImageOrg.RGB
24 bits, red-green-blue.

Autodesk.AutoCAD.GraphicsInterface.ImageOrg.BGR
24 bits, blue-green-red.

Autodesk.AutoCAD.GraphicsInterface.ImageOrg.ABGR
32 bits, alpha-blue-green-red.

Autodesk.AutoCAD.GraphicsInterface.ImageOrg.ARGB
32 bits, alpha-red-green-blue.

Autodesk.AutoCAD.GraphicsInterface.ImageOrg.BGRA
32 bits, blue-green-red-alpha.

Autodesk.AutoCAD.GraphicsInterface.ImageOrg.RGBA
32 bits, red-green-blue-alpha.

Autodesk.AutoCAD.GraphicsInterface.ImageOrg.Gray
8 bits per pixel gray scale (0 = black, 255 = white).

Autodesk.AutoCAD.GraphicsInterface.ImageOrg.Palette
8 bits per pixel, paletted.

Autodesk.AutoCAD.GraphicsInterface.ImageOrg.Bitonal
1 bit per pixel.