Autodesk.AutoCAD.DatabaseServices.ProxyObject
This abstract class provides an interface to the description data for the objects stored within ProxyObjects in drawings.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.ProxyObject.ApplicationDescription
Gets the string that represents the application description of the class stored within the proxy object.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.OriginalDxfName
Gets a string that is the DXF name of the custom object stored in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.OriginalClassName
Gets a string that is the C++ class name of the custom object stored in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.ProxyFlags
Gets the proxy edit flags bit settings for the class of the custom object contained in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.GetReferences
Gets all reference objectIds in the data of the custom object contained in the proxy.
Returns: All reference objectIds in the data of the custom object contained in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.ResurrectMeNow(Autodesk.AutoCAD.DatabaseServices.ObjectId)
If id represents a proxy object, and the application that defines the class of the object within the proxy is currently loaded, then this method resurrects the proxy by replacing it with the object it contains.
id: Object ID of object to be resurrected .

Autodesk.AutoCAD.DatabaseServices.ProxyObject.{dtor}
