Autodesk.AutoCAD.DatabaseServices.Entity
Base class for all database objects having a graphical representation.

Autodesk.AutoCAD.DatabaseServices.Entity.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Entity.MaterialMapper
Gets or sets material mapper set on this entity.

Autodesk.AutoCAD.DatabaseServices.Entity.MaterialId
Gets or sets the ID of the associated Material object.

Autodesk.AutoCAD.DatabaseServices.Entity.Material
Gets or sets a copy of the material name.

Autodesk.AutoCAD.DatabaseServices.Entity.ReceiveShadows
Gets or sets a boolean value indicating whether this entity can receive shadows.

Autodesk.AutoCAD.DatabaseServices.Entity.CastShadows
Gets or sets a boolean value that indicates whether the entity can cast shadows.

Autodesk.AutoCAD.DatabaseServices.Entity.Hyperlinks
Gets the hyperlinks of the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.CloneMeForDragging
Gets true indicating that a clone will be created for the dragging operation.

Autodesk.AutoCAD.DatabaseServices.Entity.CompoundObjectTransform
Gets transformation matrix used for nested objects.

Autodesk.AutoCAD.DatabaseServices.Entity.GeometricExtents
Gets the entity's extents.Unimplemented at the Entity level, this property is intended to be overridden in derived classes.Derived classes should calculate and return the corner points (in WCS coordinates) of a box (with edges parallel to the WCS X, Y, and Z axes) that encloses the 3D extents of the entity, and return those points as an instance of class Extents3d.

Autodesk.AutoCAD.DatabaseServices.Entity.Ecs
Gets transformation matrix to go from OCS to WCS.

Autodesk.AutoCAD.DatabaseServices.Entity.IsPlanar
Gets true if and only if there is a plane that contains the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.CollisionType
Gets the collision detection treatment for this entity. Subclasses may override this method to customize how the class interacts in collision-aware features.

Autodesk.AutoCAD.DatabaseServices.Entity.LineWeight
Gets or sets the LineWeight of the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Visible
Gets or sets the entity's current visibility state.

Autodesk.AutoCAD.DatabaseServices.Entity.LinetypeScale
Gets or sets the linetype scale factor for the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.LinetypeId
Gets or sets the ObjectId of the LinetypeTableRecord referenced by the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Linetype
Gets or sets a copy of the name string in the LinetypeTableRecord object referenced by the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.LayerId
Gets or sets the ObjectId of the LayerTableRecord referenced by the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Layer
Gets or sets a copy of the name string in the LayerTableRecord object referenced by the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.PlotStyleNameId
Gets or sets the object ID of the PlaceHolder object representing the plotStyleName used by the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.PlotStyleName
Gets or sets a copy of the plotStyleName string of the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Transparency
Gets or sets the transparency value for the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.EntityColor
Gets or sets the color settings of the entity in an EntityColor form.

Autodesk.AutoCAD.DatabaseServices.Entity.ColorIndex
Gets or sets the AutoCAD color number of the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Color
Gets or sets the full true color information for the entity within an instance of Color.

Autodesk.AutoCAD.DatabaseServices.Entity.BlockId
Gets the ObjectId of the entity's owner, which must be a BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.Entity.SetLayerId(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the entity to reference the LayerTableRecord that has the object ID newValue. For a BlockReference entity, this method will also update any associated SequenceEnd subentity.
newValue: Name of the LayerTableRecord to be referenced by the entity.
allowHidden: Boolean indicating whether to allow newValue to specify a hidden layer.

Autodesk.AutoCAD.DatabaseServices.Entity.SetPropertiesFrom(Autodesk.AutoCAD.DatabaseServices.Entity)
Copies the color,layer,linetype,linetype scale,visibility values from the entity pointed to by entityPointer into this entity.
entityPointer: Entity from which to copy the properties.

Autodesk.AutoCAD.DatabaseServices.Entity.GetPlane
If the entity is planar, then the plane containing the entity is returned in plane;If the entity is nonplanar, but is linear, then plane is set to an arbitrary plane that contains the entity;If the entity is nonplanar and nonlinear, then plane is left unset.
Returns: The plane which contains the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.AddSubentityPaths(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Adds one or more subentities to an entity.
subPaths: An array of FullSubentityPath identifiers to add to the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.DeleteSubentityPaths(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Deletes one or more subentities from an entity.
subPaths: An array of FullSubentityPath identifiers to delete from the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.TransformSubentityPathsBy(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],Autodesk.AutoCAD.Geometry.Matrix3d)
Applies a geometric transformation to one or more subentities on the entity.
subPaths: An array of one or more FullSubentityPath objects identifying the subentities to transform.
transform: The WCS transformation to apply to each of the supplied subentities.

Autodesk.AutoCAD.DatabaseServices.Entity.GetSubentityGeometricExtents(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Retrieves the geometric extents for a subentity.Unimplemented at the Entity level, this method is intended to be overridden in derived classes.Derived classes should calculate and return the corner points (in WCS coordinates) of a box (with edges parallel to the WCS X, Y, and Z axes) that encloses the 3D extents of the subentity, and return those points as an instance of class Extents3d.
subPath: The path to the subentity.
Returns: Geometric extents, expressed in world coordinates, of the subentity.

Autodesk.AutoCAD.DatabaseServices.Entity.GetSubentityPathsAtGraphicsMarker(Autodesk.AutoCAD.DatabaseServices.SubentityType,System.Int32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Through the use of certain selection mechanisms, the GS marker for the actual subentity selected on screen can be obtained and, along with some other information passed into this method, can be used to create one or more FullSubentityPath objects, each one representing a subentity and providing a more complete description of the subentity and its environment.
type: Subentity type desired.
gsMark: GS marker representing a specific subentity.
pickPoint: Point (in WCS coordinates) picked during selection of the entity (this point will be on or very near the desired subentity).
viewTransform: Transformation matrix to transform from WCS to DCS.
numInserts: Number of object IDs for BlockReferences in entityAndInsertStack(should be one less than the total number of entries in entityAndInsertStack because the first entry is the entity itself, which is not a BlockReference). If the entity is directly owned by the model or paper space BlockTableRecords, then leave this argument out so its default of 0 will be used.
entityAndInsertStack: Array of objectIds of the objects that are the nested containers of the subentity. The list is in order from the "main" entity that the subentity is a part of, out to the outermost BlockReference that is in model or paper space. If the entity is itself directly owned by model or paper space, then leave this argument out so that its default of null will be used.
Returns: Array of one or more FullSubentityPaths generated from the GS marker and other information passed into this method.

Autodesk.AutoCAD.DatabaseServices.Entity.GetGraphicsMarkersAtSubentityPath(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Associate an integer identifier called a graphics system marker (or, GS marker) with each primitive or with groups of primitives.
subPath: FullSubentityPath object that contains a SubentityId object with the information necessary to determine the subentity (or subentities) for which the GS Marker(s) is requested.
Returns: Array with the GSMarker(s) for the subentity (or subentities).

Autodesk.AutoCAD.DatabaseServices.Entity.Highlight(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.Boolean)
This method uses the FullSubentityPath subId to determine which subentity in the entity is desired. It then highlights that subentity on screen. If no FullSubentityPath argument is provided, then the entire entity will be highlighted.
subId: FullSubentityPath that identifies the subentity to highlight.
highlightAll: Boolean indicating whether to highlight in all viewports.

Autodesk.AutoCAD.DatabaseServices.Entity.Highlight
Highlights the entire entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Unhighlight(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.Boolean)
This method uses the FullSubentityPath subId to determine which subentity in the entity is desired. It then unhighlights that subentity on screen. If no FullSubentityPath argument is provided, then the entire entity will be unhighlighted.
subId: FullSubentityPath that identifies which subentity to unhighlight.
highlightAll: Boolean indicating whether to unhighlight in all viewports.

Autodesk.AutoCAD.DatabaseServices.Entity.Unhighlight
Unhighlights the entire entity.

Autodesk.AutoCAD.DatabaseServices.Entity.GetObjectSnapPoints(Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes,System.Int32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Matrix3d)
This method must use the material provided in snapMode, gsSelectionMark, pickPoint, lastPoint, and viewTransform to determine all appropriate osnap points for the entity. It must then append all such osnap points to the snapPoints array.
snapMode: ObjectSnap mode being requested.
gsSelectionMark: GS marker of the subentity involved in the object snap operation.
pickPoint: Point (in WCS coordinates) picked during the object snap operation.
lastPoint: Point (in WCS coordinates) selected just before pickPoint.
viewTransform: Transformation matrix to transform from WCS to DCS.
snapPoints: Input pre-existing array to append osnap points to (may already contain points); output with object snap points appended.
geometryIds: Not in use.

Autodesk.AutoCAD.DatabaseServices.Entity.GetObjectSnapPoints(Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes,System.Int32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
This method must use the material provided in snapMode, gsSelectionMark, pickPoint, lastPoint, and viewTransform to determine all appropriate osnap points for the entity. It must then append all such osnap points to the snapPoints array.
snapMode: ObjectSnap mode being requested.
gsSelectionMark: GS marker of the subentity involved in the object snap operation.
pickPoint: Point (in WCS coordinates) picked during the object snap operation.
lastPoint: Point (in WCS coordinates) selected just before pickPoint.
viewTransform: Transformation matrix to transform from WCS to DCS.
snapPoints: Input pre-existing array to append osnap points to (may already contain points); output with object snap points appended.
geometryIds: Not in use.
insertionMat: Block transformation.

Autodesk.AutoCAD.DatabaseServices.Entity.GetGripPoints(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
Append to the gripPoints array any points that are to treated as grip points for the entity.
gripPoints: Pre-existing array to append the grip points to; output with the entity's grip points appended.
snapModes: Not currently in use.
geometryIds: Not currently in use.

Autodesk.AutoCAD.DatabaseServices.Entity.MoveGripPointsAt(Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Vector3d)
Modifies the entity in whatever way it deems appropriate so that the grip points identified by the index values in indices are moved the direction and magnitude of the offset vector.
indices: Array containing index values (which correspond to grip points reported by the GetGripPoints() method) that indicate which grip points are currently "hot".
offset: Vector (in WCS coordinates) indicating the direction and magnitude that the grip points have been translated.

Autodesk.AutoCAD.DatabaseServices.Entity.GetStretchPoints(Autodesk.AutoCAD.Geometry.Point3dCollection)
Appends to the stretchPoints array any points that are to treated as stretch points for the entity.
stretchPoints: Input pre-existing array to append the stretch points to; output with the entity's stretch points appended.

Autodesk.AutoCAD.DatabaseServices.Entity.MoveStretchPointsAt(Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Vector3d)
Modifies the entity such that the stretch points identified by the indices array are translated to the direction and magnitude specified by the offset vector (which is in WCS coordinates).
indices: Array containing index values (which correspond to stretch points reported by the GetStretchPoints() method) that indicate which stretch points are being translated.
offset: Vector (in WCS coordinates) indicating the direction and magnitude that the stretch points have been translated.

Autodesk.AutoCAD.DatabaseServices.Entity.IntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int32,System.Int32)
Finds the intersections of the entity pointed to by entityPointer and all the edges of the bounding box of this entity.
entityPointer: Entity with which "this" entity is to intersect.
intersectType: Type of intersection requested.
projectionPlane: Projection plane for the apparent intersection of the two entities.
points: Output with the points of intersection appended.
thisGraphicSystemMarker: GS marker of subentity of "this" entity that's involved in the intersection operation. Use the 0 default if not applicable.
otherGraphicSystemMarker: GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. Use the 0 default if not applicable.

Autodesk.AutoCAD.DatabaseServices.Entity.IntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int32,System.Int32)
Finds the intersections of the entity pointed to by entityPointer and all the edges of the bounding box of this entity.
entityPointer: Entity with which "this" entity is to intersect.
intersectType: Type of intersection requested.
points: Output with the points of intersection appended.
thisGraphicSystemMarker: GS marker of subentity of "this" entity that's involved in the intersection operation. Use the 0 default if not applicable.
otherGraphicSystemMarker: GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. Use the 0 default if not applicable.

Autodesk.AutoCAD.DatabaseServices.Entity.BoundingBoxIntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int32,System.Int32)
This method first calculates the bounding box for this entity (in WCS coordinates) by calling the entity's GeometricExtents property.It then finds the intersections of the entity pointed to by entityPointer and all the edges of the bounding box of this entity.
entityPointer: Entity with which "this" entity is to intersect.
intersectType: Type of intersection requested.
points: Output with the points of intersection appended.
thisGraphicSystemMarker: GS marker of subentity of "this" entity that's involved in the intersection operation. Use the 0 default if not applicable.
otherGraphicSystemMarker: GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. Use the 0 default if not applicable.

Autodesk.AutoCAD.DatabaseServices.Entity.BoundingBoxIntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int32,System.Int32)
This method first calculates the bounding box for this entity (in WCS coordinates) by calling the entity's GeometricExtents property.It then finds the intersections of the entity pointed to by entityPointer and all the edges of the bounding box of this entity.
entityPointer: Entity with which "this" entity is to intersect.
intersectType: Type of intersection requested.
projectionPlane: Projection plane for the apparent intersection of the two entities.
points: Output with the points of intersection appended.
thisGraphicSystemMarker: GS marker of subentity of "this" entity that's involved in the intersection operation. Use the 0 default if not applicable.
otherGraphicSystemMarker: GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. Use the 0 default if not applicable.

Autodesk.AutoCAD.DatabaseServices.Entity.List
Prints entity specific information to the AutoCAD command line.

Autodesk.AutoCAD.DatabaseServices.Entity.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Apply the transformation matrix transform to the entity and change the entity's state to reflect the transformation.
transform: Transformation matrix to be applied to the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.GetTransformedCopy(Autodesk.AutoCAD.Geometry.Matrix3d)
Creates a clone of the entity, applies the transform transformation matrix to the clone, and then returns the transformed clone.
transform: Matrix by which to transform the copy of the entity.
Returns: The transformed copy of the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.GetSubentity(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This method uses the FullSubentityPath id to determine which subentity in the entity is desired. It then creates a copy of that subentity using one of the classes derived from Entity so that the copy is a true "entity" that can be added to the database.
id: FullSubentityPath that identifies the subentity to be copied.
Returns: A copy of the subentity in the entity determined by id.

Autodesk.AutoCAD.DatabaseServices.Entity.Explode(Autodesk.AutoCAD.DatabaseServices.DBObjectCollection)
This method is primarily intended for AutoCAD to call as part of an explode operation that includes this entity. However, this method can be used by ObjectARX applications to obtain an array of non-database-resident entity objects that are what the entity considers to be its exploded parts.
entitySet: Input array to contain the new entities; this array may already contain entities from other entities Explode() methods; output with all entities that result from exploding this entity, appended to the array.

Autodesk.AutoCAD.DatabaseServices.Entity.RecordGraphicsModified(System.Boolean)
Sets the entity's state to indicate whether or not the entity should be updated on screen when it is closed. If the entity is set not to update, then any changes made will appear the next time the entity is regenerated.
setModified: Boolean value to indicate if the entity's graphics should be updated on screen when the object is closed.

Autodesk.AutoCAD.DatabaseServices.Entity.SaveAs(Autodesk.AutoCAD.GraphicsInterface.WorldDraw,Autodesk.AutoCAD.DatabaseServices.SaveType)
Generate the graphic primitives whenever a DWG save is occurring that requires proxy graphics to be saved for the entity.
mode: Fully initialized WorldDraw object(or an object of a class derived from WorldDraw).
st: SaveType indicates why the SaveAs is being called.

Autodesk.AutoCAD.DatabaseServices.Entity.SetDatabaseDefaults(Autodesk.AutoCAD.DatabaseServices.Database)
Sets the entity's color,layer,linetype,linetype scale,visibility,plot style name and Line weight,to the default values of the database indicated by sourceDatabase.If sourceDatabase == null, then the current database in the AutoCAD editor is used.
sourceDatabase: Database whose defaults will be used to set the values of the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.SetDatabaseDefaults
Sets the entity's color,layer,linetype,linetype scale,visibility,plot style name and Line weight,to the default values of the database in which the entity currently resides or, if the entity is not part of a database yet, the current database in the AutoCAD editor is used.

Autodesk.AutoCAD.DatabaseServices.Entity.SetDragStatus(Autodesk.AutoCAD.DatabaseServices.DragStatus)
Is called when a drag operation involving this entity is starting, ending, or aborting. The status argument provides information about what is happening with the drag operation.
status: Value describing the status of the drag operation.

Autodesk.AutoCAD.DatabaseServices.Entity.SetGripStatus(Autodesk.AutoCAD.DatabaseServices.GripStatus)
Is called with a status value of GripStatus.GripsToBeDeleted when the grips for the entity are about to be deleted in the host application.
status: Value describing the status of the grip operation.

Autodesk.AutoCAD.DatabaseServices.Entity.SetSubentityGripStatus(Autodesk.AutoCAD.DatabaseServices.GripStatus,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Is called with a status value of GripStatus.GripsToBeDeleted when the grips for the subentity are about to be deleted in the host application.
status: The status of the grip operation.
subentity: The subobject on the object whose grip status changed.

Autodesk.AutoCAD.DatabaseServices.Entity.{dtor}
