Autodesk.AutoCAD.GraphicsInterface.Context
The context can be thought of as the root object of the regeneration. A single instance of a Context-derived class serves as a point of reference during a given regen. It is accessible via both WorldDraw and ViewportDraw and hence is always available to the client.

Autodesk.AutoCAD.GraphicsInterface.Context.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.Context.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.Context.SupportsTrueTypeText
Gets true if the current implementation of Autodesk.AutoCAD.GraphicsInterface supports True type font elaboration. Gets false indicates that the device will be using a stroke based font for any text specified with a true type font.

Autodesk.AutoCAD.GraphicsInterface.Context.ByBlockPlotStyleNameId
Gets the plotstyle that will be used if byblock is specified.

Autodesk.AutoCAD.GraphicsInterface.Context.ByBlockLineWeight
Gets the lineweight that will be used if byblock lineweight is specified. This does not include any change that may be caused in the plot pipeline by any active plot style.

Autodesk.AutoCAD.GraphicsInterface.Context.EffectiveColor
Gets the color that would be used to draw a primitive at this point, any bylayer and byblock resolution has been done. This does not include any change that may be caused in the plot pipeline by any active plot style.

Autodesk.AutoCAD.GraphicsInterface.Context.IsNesting
Gets true if the system is regenerating a compound object.

Autodesk.AutoCAD.GraphicsInterface.Context.IsBoundaryClipping
Gets true if boundary clipping is currently active. This indicates that any primitive drawn will be clipped to a boundary.

Autodesk.AutoCAD.GraphicsInterface.Context.Database
Gets a specific database relates to regeneration.

Autodesk.AutoCAD.GraphicsInterface.Context.IsPlotGeneration
Gets true if the regen is for hard copy output.

Autodesk.AutoCAD.GraphicsInterface.Context.IsPostScriptOut
Gets true if the regen is for the purposes of PostScript out.

Autodesk.AutoCAD.GraphicsInterface.Context.DisableFastMoveDrag
If your object needs to be redrawn for translation transforms (MOVE), you can force the system to re-request graphics for all objects in the current drag.

Autodesk.AutoCAD.GraphicsInterface.Context.{dtor}
