Autodesk.AutoCAD.DatabaseServices.DxfCode
This enumerated type contains all the primary DXF group code values.

Autodesk.AutoCAD.DatabaseServices.DxfCode.ColorName


Autodesk.AutoCAD.DatabaseServices.DxfCode.PlotStyleNameId


Autodesk.AutoCAD.DatabaseServices.DxfCode.Int8


Autodesk.AutoCAD.DatabaseServices.DxfCode.CircleSides


Autodesk.AutoCAD.DatabaseServices.DxfCode.Visibility


Autodesk.AutoCAD.DatabaseServices.DxfCode.Elevation


Autodesk.AutoCAD.DatabaseServices.DxfCode.Handle


Autodesk.AutoCAD.DatabaseServices.DxfCode.Description


Autodesk.AutoCAD.DatabaseServices.DxfCode.Start


Autodesk.AutoCAD.DatabaseServices.DxfCode.Operator


Autodesk.AutoCAD.DatabaseServices.DxfCode.PlotStyleNameType


Autodesk.AutoCAD.DatabaseServices.DxfCode.LineWeight


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataInteger32


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataInteger16


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataScale


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataDist


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataReal


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataWorldZDir


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataWorldYDir


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataWorldXDir


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataWorldZDisp


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataWorldYDisp


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataWorldXDisp


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataWorldZCoordinate


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataWorldYCoordinate


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataWorldXCoordinate


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataZCoordinate


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataYCoordinate


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataXCoordinate


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataHandle


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataBinaryChunk


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataLayerName


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataControlString


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataRegAppName


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedDataAsciiString


Autodesk.AutoCAD.DatabaseServices.DxfCode.GradientName


Autodesk.AutoCAD.DatabaseServices.DxfCode.GradientColVal


Autodesk.AutoCAD.DatabaseServices.DxfCode.GradientTintVal


Autodesk.AutoCAD.DatabaseServices.DxfCode.GradientShift


Autodesk.AutoCAD.DatabaseServices.DxfCode.GradientAngle


Autodesk.AutoCAD.DatabaseServices.DxfCode.GradientColCount


Autodesk.AutoCAD.DatabaseServices.DxfCode.GradientTintType


Autodesk.AutoCAD.DatabaseServices.DxfCode.GradientPatType


Autodesk.AutoCAD.DatabaseServices.DxfCode.GradientObjType


Autodesk.AutoCAD.DatabaseServices.DxfCode.ColorRgb


Autodesk.AutoCAD.DatabaseServices.DxfCode.LayoutName


Autodesk.AutoCAD.DatabaseServices.DxfCode.ExtendedInt16


Autodesk.AutoCAD.DatabaseServices.DxfCode.HardOwnershipId


Autodesk.AutoCAD.DatabaseServices.DxfCode.SoftOwnershipId


Autodesk.AutoCAD.DatabaseServices.DxfCode.HardPointerId


Autodesk.AutoCAD.DatabaseServices.DxfCode.SoftPointerId


Autodesk.AutoCAD.DatabaseServices.DxfCode.ArbitraryHandle


Autodesk.AutoCAD.DatabaseServices.DxfCode.BinaryChunk


Autodesk.AutoCAD.DatabaseServices.DxfCode.XTextString


Autodesk.AutoCAD.DatabaseServices.DxfCode.XXInt16


Autodesk.AutoCAD.DatabaseServices.DxfCode.NormalZ


Autodesk.AutoCAD.DatabaseServices.DxfCode.NormalY


Autodesk.AutoCAD.DatabaseServices.DxfCode.NormalX


Autodesk.AutoCAD.DatabaseServices.DxfCode.XInt16


Autodesk.AutoCAD.DatabaseServices.DxfCode.XReal


Autodesk.AutoCAD.DatabaseServices.DxfCode.UcsOrientationY


Autodesk.AutoCAD.DatabaseServices.DxfCode.UcsOrientationX


Autodesk.AutoCAD.DatabaseServices.DxfCode.UcsOrg


Autodesk.AutoCAD.DatabaseServices.DxfCode.DimVarHandle


Autodesk.AutoCAD.DatabaseServices.DxfCode.ControlString


Autodesk.AutoCAD.DatabaseServices.DxfCode.EmbeddedObjectStart


Autodesk.AutoCAD.DatabaseServices.DxfCode.Subclass


Autodesk.AutoCAD.DatabaseServices.DxfCode.Int32


Autodesk.AutoCAD.DatabaseServices.DxfCode.LinetypePdc


Autodesk.AutoCAD.DatabaseServices.DxfCode.LinetypeAlign


Autodesk.AutoCAD.DatabaseServices.DxfCode.TxtStyleFlags


Autodesk.AutoCAD.DatabaseServices.DxfCode.RegAppFlags


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportSnapPair


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportSnapStyle


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportGrid


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportSnap


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportIcon


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportZoom


Autodesk.AutoCAD.DatabaseServices.DxfCode.Int16


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportNumber


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportActive


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportVisibility


Autodesk.AutoCAD.DatabaseServices.DxfCode.HasSubentities


Autodesk.AutoCAD.DatabaseServices.DxfCode.LayerLinetype


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportTwist


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportSnapAngle


Autodesk.AutoCAD.DatabaseServices.DxfCode.LinetypeElement


Autodesk.AutoCAD.DatabaseServices.DxfCode.MlineOffset


Autodesk.AutoCAD.DatabaseServices.DxfCode.DashLength


Autodesk.AutoCAD.DatabaseServices.DxfCode.LinetypeScale


Autodesk.AutoCAD.DatabaseServices.DxfCode.PixelScale


Autodesk.AutoCAD.DatabaseServices.DxfCode.ShapeScale


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewHeight


Autodesk.AutoCAD.DatabaseServices.DxfCode.ShapeYOffset


Autodesk.AutoCAD.DatabaseServices.DxfCode.ShapeXOffset


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewBackClip


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewFrontClip


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewLensLength


Autodesk.AutoCAD.DatabaseServices.DxfCode.TxtStylePSize


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportAspect


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewWidth


Autodesk.AutoCAD.DatabaseServices.DxfCode.TxtStyleXScale


Autodesk.AutoCAD.DatabaseServices.DxfCode.TxtSize


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewportHeight


Autodesk.AutoCAD.DatabaseServices.DxfCode.Real


Autodesk.AutoCAD.DatabaseServices.DxfCode.ZCoordinate


Autodesk.AutoCAD.DatabaseServices.DxfCode.YCoordinate


Autodesk.AutoCAD.DatabaseServices.DxfCode.XCoordinate


Autodesk.AutoCAD.DatabaseServices.DxfCode.CLShapeText


Autodesk.AutoCAD.DatabaseServices.DxfCode.LayerName


Autodesk.AutoCAD.DatabaseServices.DxfCode.TextStyleName


Autodesk.AutoCAD.DatabaseServices.DxfCode.DimBlk2


Autodesk.AutoCAD.DatabaseServices.DxfCode.LinetypeName


Autodesk.AutoCAD.DatabaseServices.DxfCode.DimBlk1


Autodesk.AutoCAD.DatabaseServices.DxfCode.DimensionBlock


Autodesk.AutoCAD.DatabaseServices.DxfCode.SymbolTableRecordComments


Autodesk.AutoCAD.DatabaseServices.DxfCode.CLShapeName


Autodesk.AutoCAD.DatabaseServices.DxfCode.DimensionAlternativePrefixSuffix


Autodesk.AutoCAD.DatabaseServices.DxfCode.TextBigFontFile


Autodesk.AutoCAD.DatabaseServices.DxfCode.DimPostString


Autodesk.AutoCAD.DatabaseServices.DxfCode.TextFontFile


Autodesk.AutoCAD.DatabaseServices.DxfCode.LinetypeProse


Autodesk.AutoCAD.DatabaseServices.DxfCode.DimStyleName


Autodesk.AutoCAD.DatabaseServices.DxfCode.AttributePrompt


Autodesk.AutoCAD.DatabaseServices.DxfCode.SymbolTableRecordName


Autodesk.AutoCAD.DatabaseServices.DxfCode.MlineStyleName


Autodesk.AutoCAD.DatabaseServices.DxfCode.SymbolTableName


Autodesk.AutoCAD.DatabaseServices.DxfCode.AttributeTag


Autodesk.AutoCAD.DatabaseServices.DxfCode.BlockName


Autodesk.AutoCAD.DatabaseServices.DxfCode.ShapeName


Autodesk.AutoCAD.DatabaseServices.DxfCode.XRefPath


Autodesk.AutoCAD.DatabaseServices.DxfCode.End


Autodesk.AutoCAD.DatabaseServices.DxfCode.FirstEntityId


Autodesk.AutoCAD.DatabaseServices.DxfCode.HeaderId


Autodesk.AutoCAD.DatabaseServices.DxfCode.XDataStart


Autodesk.AutoCAD.DatabaseServices.DxfCode.PReactors


Autodesk.AutoCAD.DatabaseServices.DxfCode.XDictionary


Autodesk.AutoCAD.DatabaseServices.DxfCode.Comment


Autodesk.AutoCAD.DatabaseServices.DxfCode.Alpha


Autodesk.AutoCAD.DatabaseServices.DxfCode.Bool


Autodesk.AutoCAD.DatabaseServices.DxfCode.RenderMode


Autodesk.AutoCAD.DatabaseServices.DxfCode.ViewMode


Autodesk.AutoCAD.DatabaseServices.DxfCode.Color


Autodesk.AutoCAD.DatabaseServices.DxfCode.Angle


Autodesk.AutoCAD.DatabaseServices.DxfCode.Thickness


Autodesk.AutoCAD.DatabaseServices.DxfCode.Text


Autodesk.AutoCAD.DatabaseServices.DxfCode.Invalid
