Autodesk.AutoCAD.Geometry.Vector2dCollectionEnumerator
Supports a simple iteration over a Vector2dCollection.

Autodesk.AutoCAD.Geometry.Vector2dCollectionEnumerator.#ctor(Autodesk.AutoCAD.Geometry.Vector2dCollection)


Autodesk.AutoCAD.Geometry.Vector2dCollectionEnumerator.Current
Gets the current element in the collection.

Autodesk.AutoCAD.Geometry.Vector2dCollectionEnumerator.MoveNext
Moves the enumerator to the next entry in the collection.
Returns: true if the enumerator was successfully moved to the next entry; false if the enumerator has passed the end of the collection.

Autodesk.AutoCAD.Geometry.Vector2dCollectionEnumerator.Reset
Resets the enumerator to the first entry in the collection.