Autodesk.AutoCAD.DatabaseServices.DwfReference
Represents DWF underlays in the drawing. Underlays are similar to raster images but their content is snappable.

Autodesk.AutoCAD.DatabaseServices.DwfReference.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.DwfReference.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DwfReference.{dtor}
