Autodesk.AutoCAD.DatabaseServices.UnderlayFile
This interface is implemented by host applications that wish to support underlays. UnderlayDefinition and UnderlayReference objects use this interface to accomplish their mission.

Autodesk.AutoCAD.DatabaseServices.UnderlayFile.Items


Autodesk.AutoCAD.DatabaseServices.UnderlayFile.{dtor}
