Autodesk.AutoCAD.GraphicsInterface.DrawableTraits
Allows a drawable to express its graphical traits to the graphics system.

Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.SetupForEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
This call initializes the entire SubEntityTraits and DrawableTraits from the entity.
entity: Entity object.

Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.AddLight(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Drawables that emit light can add one (or more) "lights" to the model.
lightId: Object ID of the added light.

Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.SetLayerFlags(Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.LayerFlags)


Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.{dtor}
