Autodesk.AutoCAD.DatabaseServices.LayerStateMasks
Defines the bits used to specify the layer attributes.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.LineWeight
Allows lineweight changes.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.CurrentViewport
Indicates the user preference regarding whether to restore the current viewport VPLAYER settings during a restore layer state operation.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.PlotStyle
Allow plotstyle changes.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.LineType
Allows linetype changes.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.NewViewport
Adds the layer to new viewports.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.Plot
Allows the layer to be plotted.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.Locked
Locks (no selection or editing) the layer.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.Frozen
Freezes (no regeneration, plotting, or rendering) the layer.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.On
Makes the layer visible.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.Color
Allows color changes.

Autodesk.AutoCAD.DatabaseServices.LayerStateMasks.None
No restrictions.