Autodesk.AutoCAD.DatabaseServices.BlockTableRecordEnumerator
Supports a simple iteration over a BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecordEnumerator.#ctor(System.IntPtr,System.Boolean,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.BlockTableRecordEnumerator.Current
Gets the current element in the BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecordEnumerator.MoveNext
Moves the enumerator to the next element in the BlockTableRecord.
Returns: true if the enumerator was successfully moved to the next element; false if the enumerator has passed the end of the BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecordEnumerator.Reset
Resets the enumerator to the first element in the BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecordEnumerator.{dtor}
