Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator
Provides the ability to iterate through a Dictionary.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.Entry
Gets the Entry property value.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.Current
Gets the entry at the iterator's current location.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.Value
Gets the the Value property value.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.Key
Gets the the Key property value.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.MoveNext
Increments the enumerator to the next entry.
Returns: true if the enumerator was successfully moved to the next entry; false if the enumerator has passed the end of the DbDictionary.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.Reset
Resets the enumerator to the first element.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.{dtor}
