Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes
Defines the different types of bounding areas used in hatching.

Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes.Default
The loop type hasn't been specified yet. It turns to a "real" value as soon as some real loops get created.

Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes.Derived
A loop that was derived by AutoCAD's boundary tracer from a picked point.

Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes.Polyline
The hatch loop consists of a polyline(Autodesk.AutoCAD.Geometry geometry, not Autodesk.AutoCAD.DatabaseServices geometry).

Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes.External
A loop that consists of external entities (derived from Entity and owned by a Database). The hatch might be associative to these entities.

Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes.Duplicate


Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes.TextIsland
Text loops that are surrounded by even number of outer loops. Text island loops are avoided when performing solid fill.

Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes.SelfIntersecting
A loop that intersects with itself.

Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes.NotClosed
A loop that is not closed.

Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes.Outermost
The outermost loop of this hatch.

Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes.Textbox
A loop that consists of a box around an existing text object (DBText).