Autodesk.AutoCAD.GraphicsInterface.Viewport
This class is used to pass back information to the user about the viewing characteristics of the current viewport. These characteristics are useful for generating an optimal graphics representation of the user's object, given the specific viewing configuration of the viewport.

Autodesk.AutoCAD.GraphicsInterface.Viewport.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.Viewport.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.Viewport.ViewDirection
Gets the current view direction of the viewport.

Autodesk.AutoCAD.GraphicsInterface.Viewport.LinetypeScaleMultiplier
Gets a value supplied by the viewport itself. It is an additional multiplier that is used affecting all linetypes displayed in this viewport.

Autodesk.AutoCAD.GraphicsInterface.Viewport.FrontAndBackClipping
Gets information about the existence and location of front and back display clipping planes.

Autodesk.AutoCAD.GraphicsInterface.Viewport.DeviceContextViewportCorners
Gets lower left and upper right corner point of viewport in Display Coordinates.

Autodesk.AutoCAD.GraphicsInterface.Viewport.AcadWindowId
Gets the Viewport index number of the viewport being drawn to.

Autodesk.AutoCAD.GraphicsInterface.Viewport.ViewportId
Gets the Autodesk.AutoCAD.GraphicsInterface viewport ID. This is an Autodesk.AutoCAD.GraphicsInterface-specific ID that has no relation to the AutoCAD CVPORT system variable.

Autodesk.AutoCAD.GraphicsInterface.Viewport.CameraUpVector
Gets the camera "up" direction vector.

Autodesk.AutoCAD.GraphicsInterface.Viewport.CameraTarget
Gets the viewport camera's world coordinate target. This is a point where the viewport's "eye" is aimed in world space.

Autodesk.AutoCAD.GraphicsInterface.Viewport.CameraLocation
Gets the viewport camera's world coordinate location. This is where the viewport's "eye" would be in world space.

Autodesk.AutoCAD.GraphicsInterface.Viewport.IsPerspective
Gets true if perspective mode is in effect.

Autodesk.AutoCAD.GraphicsInterface.Viewport.EyeToWorldTransform
Gets the current eye coordinate to World Coordinate transformation matrix.

Autodesk.AutoCAD.GraphicsInterface.Viewport.WorldToEyeTransform
Gets the current World Coordinate to eye coordinate transformation matrix.

Autodesk.AutoCAD.GraphicsInterface.Viewport.EyeToModelTransform
Gets the current eye coordinate to Model Coordinate transformation matrix.

Autodesk.AutoCAD.GraphicsInterface.Viewport.ModelToEyeTransform
Gets the current Model Coordinate to eye coordinate transformation matrix.

Autodesk.AutoCAD.GraphicsInterface.Viewport.DoPerspective(Autodesk.AutoCAD.Geometry.Point3d)
Transforms value from eye coordinates to display coordinates.
value: Point to be transformed.
Returns: Transformed point.

Autodesk.AutoCAD.GraphicsInterface.Viewport.DoInversePerspective(Autodesk.AutoCAD.Geometry.Point3d)
Transforms value from display coordinates to eye coordinates.
value: Point to be transformed.
Returns: Transformed point.

Autodesk.AutoCAD.GraphicsInterface.Viewport.GetNumPixelsInUnitSquare(Autodesk.AutoCAD.Geometry.Point3d)
Returns a 2D point describing the number of pixels in a unit square for the height and width.This method is typically used to determine when geometry will end up displaying close to the size of a pixel.
givenWorldPoint: WCS point for the center point of the display coordinate unit square.
Returns: a 2D point describing the number of pixels in a unit square for the height and width.

Autodesk.AutoCAD.GraphicsInterface.Viewport.LayerVisible(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the layer is not frozen in this viewport and not globally frozen. Indicating that geometry on this layer should be regenerated.
idLayer: Layer to be investigated.
Returns: true if the layer is not frozen in this viewport and not globally frozen.

Autodesk.AutoCAD.GraphicsInterface.Viewport.{dtor}
