Autodesk.AutoCAD.DatabaseServices.FrameSetting
Image settings for Frame drawn.

Autodesk.AutoCAD.DatabaseServices.FrameSetting.ImageFrameOnNoPlot


Autodesk.AutoCAD.DatabaseServices.FrameSetting.ImageFrameBelow
Frame drawn below/behind image.

Autodesk.AutoCAD.DatabaseServices.FrameSetting.ImageFrameAbove
Frame drawn above image.

Autodesk.AutoCAD.DatabaseServices.FrameSetting.ImageFrameOff
No frame drawn around image.

Autodesk.AutoCAD.DatabaseServices.FrameSetting.ImageFrameInvalid
Frame drawn on an invalid image.