Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits
Represents a distant light source, whose light is emitted in parallel rays, with an infinite distance between the light source and the model.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.IsSunlight
Gets or sets true if this light represents sunlight.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.LightDirection
Gets or sets the direction of the light as a vector. The positive direction of this vector is from light to object.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.{dtor}
