Autodesk.AutoCAD.GraphicsInterface.MaterialTexture
Base class for all material textures. This class is abstract.

Autodesk.AutoCAD.GraphicsInterface.MaterialTexture.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.MaterialTexture.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.MaterialTexture.{dtor}
