Autodesk.AutoCAD.DatabaseServices.RegAppTable
This class is the symbol table for RegAppTableRecords, which represent registered application names for Extended Entity Data within objects that reside in the drawing database.

Autodesk.AutoCAD.DatabaseServices.RegAppTable.{dtor}
