Autodesk.AutoCAD.Geometry.Tolerance
This is an instantiable class that is by default initialized to the default tolerances. Subsequently, the tolerances within it can be customized to suit a specific need. For example, an instance of this class may be specialized for use during surface intersection.

Autodesk.AutoCAD.Geometry.Tolerance.#ctor(System.Double,System.Double)
Constructor.
equalVector: EqualVector tolerance.
equalPoint: EqualPoint tolerance.

Autodesk.AutoCAD.Geometry.Tolerance.Global


Autodesk.AutoCAD.Geometry.Tolerance.EqualVector
Gets or sets EqualVector tolerance.

Autodesk.AutoCAD.Geometry.Tolerance.EqualPoint
Gets or sets EqualPoint tolerance.