Autodesk.AutoCAD.Runtime.ProgressMeter
Provides data for the PromptedForSelection event of the Editor class.

Autodesk.AutoCAD.Runtime.ProgressMeter.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Runtime.ProgressMeter.Start


Autodesk.AutoCAD.Runtime.ProgressMeter.Start(System.String)


Autodesk.AutoCAD.Runtime.ProgressMeter.Stop


Autodesk.AutoCAD.Runtime.ProgressMeter.MeterProgress


Autodesk.AutoCAD.Runtime.ProgressMeter.SetLimit(System.Int32)


Autodesk.AutoCAD.Runtime.ProgressMeter.DeleteUnmanagedObject


Autodesk.AutoCAD.Runtime.ProgressMeter.{dtor}
