Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent


Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.#ctor(System.Double,Autodesk.AutoCAD.GraphicsInterface.MaterialMap)


Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.Percentage


Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.Map


Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.ToString


Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.ToString(System.IFormatProvider)


Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent)


Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent)
