Autodesk.AutoCAD.DatabaseServices.DiametricDimension
Represents the diameter dimension type in AutoCAD.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor uses the parameters passed in to initialize the dimension. In addition, the rest of the Dimension, Entity, and other default constructor initializations are performed.
chordPoint: Point (in WCS coordinates) on the curve being dimensioned.
farChordPoint: Point (in WCS coordinates) on curve being dimensioned and diametrically opposite the chordPoint.
leaderLength: Leader length.
dimensionText: Text string to use as the dimension annotation.
dimensionStyle: Object ID of DimStyleTableRecord to use.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DiametricDimension.FarChordPoint
Gets or sets the far chord point (in WCS coordinates) of the curve being dimensioned. This is the point on the curve that is diametrically opposite the point where the dimension line extends outside the curve, if the text is outside the curve.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.ChordPoint
Gets or sets the point (in WCS coordinates) where the dimension line intersects the curve being dimensioned and extends outside the curve, if the text is outside the curve.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.LeaderLength
This property is obsolete and always gets or sets 0 unless the length has been set at time of the dimension's creation.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.{dtor}
