Autodesk.AutoCAD.GraphicsSystem.ErrorStatus


Autodesk.AutoCAD.GraphicsSystem.ErrorStatus.OutOfRange


Autodesk.AutoCAD.GraphicsSystem.ErrorStatus.InvalidInput


Autodesk.AutoCAD.GraphicsSystem.ErrorStatus.Success
