Autodesk.AutoCAD.DatabaseServices.FullDwgVersion
Encapsulates major and minor DWG versions.

Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.#ctor(Autodesk.AutoCAD.DatabaseServices.DwgVersion,Autodesk.AutoCAD.DatabaseServices.MaintenanceReleaseVersion)


Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.MinorVersion


Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.MajorVersion


Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.ToString


Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.GetHashCode


Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.op_Equality(Autodesk.AutoCAD.DatabaseServices.FullDwgVersion,Autodesk.AutoCAD.DatabaseServices.FullDwgVersion)


Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.op_Inequality(Autodesk.AutoCAD.DatabaseServices.FullDwgVersion,Autodesk.AutoCAD.DatabaseServices.FullDwgVersion)
