Autodesk.AutoCAD.DatabaseServices.SystemVariableChangedEventArgs
Provides data for the SystemVariableChanged event of the database.

Autodesk.AutoCAD.DatabaseServices.SystemVariableChangedEventArgs.Changed
Gets true if the value was changed successfully.

Autodesk.AutoCAD.DatabaseServices.SystemVariableChangedEventArgs.Name
Gets the name of the system variable that is changed.