Autodesk.AutoCAD.GraphicsInterface.DeviationType


Autodesk.AutoCAD.GraphicsInterface.DeviationType.MaxDevForFacet


Autodesk.AutoCAD.GraphicsInterface.DeviationType.MaxDevForIsoline


Autodesk.AutoCAD.GraphicsInterface.DeviationType.MaxDevForBoundary


Autodesk.AutoCAD.GraphicsInterface.DeviationType.MaxDevForCurve


Autodesk.AutoCAD.GraphicsInterface.DeviationType.MaxDevForCircle
