Autodesk.AutoCAD.DatabaseServices.UnderlayHost
This interface is implemented by host applications that wish to support underlays. UnderlayDefinition and UnderlayReference objects use this interface to accomplish their mission.

Autodesk.AutoCAD.DatabaseServices.UnderlayHost.DwfHost
Gets the current DWF underlay host.

Autodesk.AutoCAD.DatabaseServices.UnderlayHost.GetFile(System.String,System.String)
Gets an underlay file. If password is set to null but is required by the drawing, this method will prompt the user for a password.
path: Fully qualified path to the file to open.
password: Optional password.
Returns: The object that receives the file upon successful return.