Autodesk.AutoCAD.DatabaseServices.DimArrowFlag
Sets the arrowhead for the first or second dimension line.

Autodesk.AutoCAD.DatabaseServices.DimArrowFlag.SecondArrow
Sets the arrowhead for the first dimension line.

Autodesk.AutoCAD.DatabaseServices.DimArrowFlag.FirstArrow
Sets the arrowhead for the second dimension line.