Autodesk.AutoCAD.DatabaseServices.XrefOperation
Enumerates the XREF subcommands.

Autodesk.AutoCAD.DatabaseServices.XrefOperation.XrefXBindOperation


Autodesk.AutoCAD.DatabaseServices.XrefOperation.XrefUnloadOperation


Autodesk.AutoCAD.DatabaseServices.XrefOperation.XrefResolveOperation


Autodesk.AutoCAD.DatabaseServices.XrefOperation.XrefReloadOperation


Autodesk.AutoCAD.DatabaseServices.XrefOperation.XrefPathOperation


Autodesk.AutoCAD.DatabaseServices.XrefOperation.XrefOverlayOperation


Autodesk.AutoCAD.DatabaseServices.XrefOperation.XrefDetachOperation


Autodesk.AutoCAD.DatabaseServices.XrefOperation.XrefBindOperation


Autodesk.AutoCAD.DatabaseServices.XrefOperation.XrefAttachOperation
