Autodesk.AutoCAD.Geometry.IntegerCollectionEnumerator
Supports a simple iteration over a IntegerCollection.

Autodesk.AutoCAD.Geometry.IntegerCollectionEnumerator.#ctor(Autodesk.AutoCAD.Geometry.IntegerCollection)


Autodesk.AutoCAD.Geometry.IntegerCollectionEnumerator.Current
Gets the current element in the collection.

Autodesk.AutoCAD.Geometry.IntegerCollectionEnumerator.MoveNext
Moves the enumerator to the next entry in the collection.
Returns: true if the enumerator was successfully moved to the next entry; false if the enumerator has passed the end of the collection.

Autodesk.AutoCAD.Geometry.IntegerCollectionEnumerator.Reset
Resets the enumerator to the first entry in the collection.