Autodesk.AutoCAD.LayerManager.LayerFilterTree.#ctor(Autodesk.AutoCAD.LayerManager.LayerFilter,Autodesk.AutoCAD.LayerManager.LayerFilter)


Autodesk.AutoCAD.LayerManager.LayerFilterTree.Current


Autodesk.AutoCAD.LayerManager.LayerFilterTree.Root
