Autodesk.AutoCAD.GraphicsInterface.OrientationType


Autodesk.AutoCAD.GraphicsInterface.OrientationType.Clockwise


Autodesk.AutoCAD.GraphicsInterface.OrientationType.NoOrientation


Autodesk.AutoCAD.GraphicsInterface.OrientationType.CounterClockwise
