Autodesk.AutoCAD.DatabaseServices.MlineJustification
Specifies the justification of the MLine.

Autodesk.AutoCAD.DatabaseServices.MlineJustification.Bottom
Draws the multiline above the cursor.

Autodesk.AutoCAD.DatabaseServices.MlineJustification.Zero
Draws the multiline with its origin centered at the cursor.

Autodesk.AutoCAD.DatabaseServices.MlineJustification.Top
Draws the multiline below the cursor.