Autodesk.AutoCAD.DatabaseServices.Background
Base class of all background objects that describe a viewport background. There are three types of concrete background types: SolidBackground, GradientBackground and ImageBackground. Each object should reside in the ACAD_BACKGROUND dictionary. If a tilemode viewport or a paperspace viewport has a background, it has to refer to one of these classes.

Autodesk.AutoCAD.DatabaseServices.Background.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Background.GetBackgroundDictionaryId(Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Given the database database, this method opens the background dictionary for given mode mode. If the dictionary does not exist, it will be created if createIfNotPresent is true.
database: The database from which to retrieve the background dictionary.
createIfNotPresent: Boolean indicating whether the method should create the background dictionary if it does not currently exists in the specified database.
Returns: Object Id of the result background dictionary.

Autodesk.AutoCAD.DatabaseServices.Background.{dtor}
