Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor
Encapsulates a PlotStyleNameType value, and the object ID of the associated plot style name dictionary entry.

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PlotStyleNameType)


Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.Type


Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.Id


Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.GetHashCode


Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.ToString


Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.ToString(System.IFormatProvider)


Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.op_Equality(Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor,Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor)


Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.op_Inequality(Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor,Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor)
