Autodesk.AutoCAD.GraphicsSystem.Configuration
Used to configure the GS. This class is a singleton; there is exactly one instance of this class at all times.

Autodesk.AutoCAD.GraphicsSystem.Configuration.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsSystem.Configuration.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsSystem.Configuration.Transparency
Gets or sets the Graphics System's transparency level. Transparency quality can be adjusted to improve image quality.Materials must be enabled for transparency effects to be visible.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DiscardBackFaces
Gets or sets true if back faces are discarded.

Autodesk.AutoCAD.GraphicsSystem.Configuration.Handedness
Gets or sets the currently configured handedness of the data passed in to the GS.

Autodesk.AutoCAD.GraphicsSystem.Configuration.RedrawOnWindowExpose
Gets or sets true if geometry is re-rasterized before the screen is updated.

Autodesk.AutoCAD.GraphicsSystem.Configuration.UseDisplayLists
Gets or sets true if the Graphics System is configured to take advantage of hardware display lists.

Autodesk.AutoCAD.GraphicsSystem.Configuration.CacheViewportDrawGeometry
Gets or sets true if viewport geometry is cached.

Autodesk.AutoCAD.GraphicsSystem.Configuration.AdaptiveDegradation
Gets or sets true if adaptive degradation is enabled.

Autodesk.AutoCAD.GraphicsSystem.Configuration.FrameRate
Gets or sets an integer between 1 and 60, representing the display speed in frames per second that must be maintained during view manipulations for adaptive degradation mode.

Autodesk.AutoCAD.GraphicsSystem.Configuration.UseHalfPixelDeviation
For internal use only.

Autodesk.AutoCAD.GraphicsSystem.Configuration.CurveTessellationTolerance
Gets or sets the amount of detail (tessellation lines or triangles) displayed for curves.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SurfaceTessellationTolerance
Gets or sets the amount of detail (tessellation lines or triangles) displayed for surfaces.

Autodesk.AutoCAD.GraphicsSystem.Configuration.MaxLODs
Gets or sets an integer between 1 and 10, representing the number of tessellations that the Graphics System will cache for dynamic tessellation.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DynamicTessellation
Gets or sets true if dynamic tessellation is enabled.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DefaultHardwareAcceleratedDriver
Gets or sets the name and path of the default hardware accelerated driver.

Autodesk.AutoCAD.GraphicsSystem.Configuration.HardwareAcceleratedDriver
Gets or sets the name and path of the current hardware accelerated driver.

Autodesk.AutoCAD.GraphicsSystem.Configuration.CurrentDisplayDriver
Gets or sets the configuration settings for the current display driver. It reports the path name of the current display driver, the name of the current display driver, and whether the driver is capable of hardware acceleration.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DriverSearchPath
Gets or sets the driver search path.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DriverRevision
Gets or sets the revision number of this version of the driver.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DriverVersion
Gets or sets the major version number of the driver.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DriverName
Gets or sets the driver name.

Autodesk.AutoCAD.GraphicsSystem.Configuration.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsSystem.Configuration.Configure(System.String,System.Boolean)
Force the GS to deal with configuration information.
configInfo: Configuration information.
showDialog: Boolean indicating whether the GS should display its custom configuration dialog.
Returns: Always true.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SaveSettings
Forces the Graphics System's current configuration settings to be persistent.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetHardwareAcceleratedDrivers
Returns the path where the hardware accelerated drivers are found, and an array containing the names of the available drivers.
Returns: The path where the hardware accelerated drivers are found.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DegradationChainPosition(Autodesk.AutoCAD.GraphicsSystem.DegradationChannel)
Returns the position of the degradation channel in the degradation chain.
channel: DegradationChannel for which degradation position will be returned.
Returns: The position of the degradation channel in the degradation chain.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DegradationChannelAt(System.Int32)
Returns the degradation channel at the specified position in the degradation chain.
order: Integer for which degradation channel will be returned.
Returns: The degradation channel at the specified position in the degradation chain.

Autodesk.AutoCAD.GraphicsSystem.Configuration.ShiftDegradationChainPosition(Autodesk.AutoCAD.GraphicsSystem.DegradationChannel,System.Boolean)
Shifts the specified degradation channel down or up in the degradation chain.
channel: DegradationChannel to be shifted.
shiftDown: true to shift channel down in the chain; false to shift channel up.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetCanDegradeChannel(Autodesk.AutoCAD.GraphicsSystem.DegradationChannel)
Returns true if degradation channel is enabled for degradation.
channel: DegradationChannel to query.
Returns: true if degradation channel is enabled for degradation.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SetCanDegradeChannel(Autodesk.AutoCAD.GraphicsSystem.DegradationChannel,System.Boolean)
Enables or disables the status of the given degradation channel.
channel: Degradation channel whose status is to be changed.
degrade: Degradation channel status.

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureEnabled(Autodesk.AutoCAD.GraphicsSystem.HardwareFeature)
Returns Boolean indicating whether a hardware feature is enabled.
feature: Feature.
Returns: Boolean indicating whether a hardware feature is enabled.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SetFeatureEnabled(Autodesk.AutoCAD.GraphicsSystem.HardwareFeature,System.Boolean)
Enable or disable a particular hardware feature.
feature: Feature to be enabled.
enable: Boolean to enable or disable the feature.

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureAvailable(Autodesk.AutoCAD.GraphicsSystem.HardwareFeature)
Returns Boolean indicating whether a feature is available.
feature: Feature.
Returns: Boolean indicating whether a feature is available.

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureRecommended(Autodesk.AutoCAD.GraphicsSystem.HardwareFeature)
Returns the hardware feature recommended status.
feature: Hardware feature to query .
Returns: The hardware feature recommended status.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DeleteUnmanagedObject


Autodesk.AutoCAD.GraphicsSystem.Configuration.{dtor}
