Autodesk.AutoCAD.Geometry.LineSegment2d
Represents a bounded line segment in 2D space.

Autodesk.AutoCAD.Geometry.LineSegment2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs a line segment whose start point is point and whose endpoint is point+vector. vector must not be a zero-length vector.
point: Start point of line segment.
vector: Vector between endpoint and start point of line segment.

Autodesk.AutoCAD.Geometry.LineSegment2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs a line segment between point1 and point2. point1 and point2 must not be the same point.
point1: Start point of line segment.
point2: Endpoint of line segment.

Autodesk.AutoCAD.Geometry.LineSegment2d.Length
Gets the length of the line segment (the distance between the start point and endpoint).

Autodesk.AutoCAD.Geometry.LineSegment2d.EndPoint
Gets the endpoint of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment2d.MidPoint
Gets the midpoint of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment2d.StartPoint
Gets the start point of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.LineSegment2d.GetBisector
Sets the input line to the unbounded line that is perpendicular to the line segment and passes through its midpoint.
Returns: Bisecting line.

Autodesk.AutoCAD.Geometry.LineSegment2d.BaryComb(System.Double)
Returns the point that is the weighted average of the start point and endpoint of the line segment.
blendCoefficient: Any real number.
Returns: The point that is the weighted average of the start point and endpoint of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment2d.GetSegmentLength(System.Double,System.Double)
Returns the length of the line segment between the two parameter values.
fromParameter: First parameter value.
toParameter: Second parameter value.
Returns: The length of the line segment between the two parameter values.

Autodesk.AutoCAD.Geometry.LineSegment2d.GetSegmentLength(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the length of the line segment between the two parameter values.
fromParameter: First parameter value.
toParameter: Second parameter value.
tolerance: Tolerance.
Returns: The length of the line segment between the two parameter values.

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Changes the definition of the line segment so that the line segment passes through the input point and is tangent to the input curve. On input, parameter is assumed to contain an initial guess value to the parameter of the tangent point.
curve: Any 2D curve.
point: Any 2D point.
parameter: Point on curve where line segment is tangent to curve.

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,System.Double,System.Double)
Changes the definition of the line segment so that the line segment is tangent to the two input curves. On input, parameter1 and parameter2 are assumed to contain initial guess values to the parameters of the two tangent points.
curve1: Any 2D curve.
curve2: Any 2D curve.
parameter1: Point on curve1 where line segment is tangent to curve.
parameter2: Point on curve2 where line segment is tangent to curve.

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Changes the definition of the line segment so that the start point is point1 and the endpoint is point2. point1 and point2 must not be the same point.
point1: Start point of line segment.
point2: Endpoint of line segment.

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Changes the definition of the line segment so that the start point is point and the endpoint is point+vector. vector must not be a zero-length vector.
point: Start point of line segment.
vector: Vector between endpoint and start point of line segment.

Autodesk.AutoCAD.Geometry.LineSegment2d.{dtor}
