Autodesk.AutoCAD.DatabaseServices.Surface
Surface entity with methods to create and manipulate ASM surfaces.

Autodesk.AutoCAD.DatabaseServices.Surface.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Surface.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Surface.VIsoLineDensity
Gets or sets the number of isolines in the V direction of the surface, displayed in wireframe mode for visualization.

Autodesk.AutoCAD.DatabaseServices.Surface.UIsoLineDensity
Gets or sets the number of isolines in the U direction of the surface, displayed in wireframe mode for visualization.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateFrom(Autodesk.AutoCAD.DatabaseServices.Entity)
Creates an ExtrudedSurface when given a planar entity with thickness, or creates a PlaneSurface when given a a simple, closed planar entity.
fromEntity: Either a planar entity with thickness, a simple, closed planar entity, or a Solid entity.
Returns: Either a ExtrudedSurface or a PlaneSurface created from the given entity fromEntity, or null if the operation fails.

Autodesk.AutoCAD.DatabaseServices.Surface.ConvertToRegion
Creates non-database-resident Region entities for each face of a planar surface.
Returns: Array filled with non-database-resident Region entities created from the faces of the planar surface.

Autodesk.AutoCAD.DatabaseServices.Surface.Thicken(System.Double,System.Boolean)
Creates a 3D solid by thickening the surface by a specified amount.
thickness: Amount to thicken the surface.
bothSides: Flag indicates whether the thickening should be applied to both sides such that half of the thickness is on each side.
Returns: A non-database-resident Solid3d created by the thicken operation, or null if the operation fails.

Autodesk.AutoCAD.DatabaseServices.Surface.GetArea
Calculates the total surface area of a single side of the surface.
Returns: Area of surface.

Autodesk.AutoCAD.DatabaseServices.Surface.{dtor}
