Autodesk.AutoCAD.DatabaseServices.RotatedDimension
Represents the dimension type that dimensions the distance between two points in space when they are projected onto a line at a specific angle (the rotation angle) within the dimension's plane.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor uses the parameters passed in to initialize the dimension. In addition, the extension line obliquing angle is set to 0.0 and the rest of the Dimension,Entity, etc. default constructor initializations are performed.
rotation: Rotation angle (in radians) for the dimension.
line1Point: Start point (in WCS coordinates) of first extension line.
line2Point: Start point (in WCS coordinates) of second extension line.
dimensionLinePoint: Point (in WCS coordinates) on dimension line itself.
dimensionText: Text string to use as the dimension annotation.
dimensionStyle: Object ID of DimStyleTableRecord to use.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.#ctor
Default constructor. Initializes the dimension line definition point and extension line 1 and 2 start points all to (0,0,0), and the rotation and obliquing angles to 0.0. In addition, all the initializations of the default constructor for Dimension,Entity, etc. are performed.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RotatedDimension.Rotation
Gets or sets the dimension's rotation angle in radians.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.Oblique
Gets or sets the extension line obliquing angle (in radians) for the dimension.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.DimLinePoint
Gets or sets the definition point (in WCS coordinates) that specifies where the dimension line will be (that is, this point will be somewhere on the dimension line).

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.XLine2Point
Gets or sets the definition point (in WCS coordinates) that's used as the start point for the second extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.XLine1Point
Gets or sets the definition point (in WCS coordinates) that's used as the start point for the first extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.{dtor}
