Autodesk.AutoCAD.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter
This class is a container for the procedure and destination parameters used by the RenderGlobal.ProcedureAndDestination property.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.#ctor(Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Procedure,Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Destination)
Constructor.
p: The type of view content to render (the procedure).
d: Render target.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.Destination
Gets the desired output target for rendering.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.Procedure
Gets the type of view content to render (the procedure).