Autodesk.AutoCAD.Geometry.Curve3d
Abstract base class for all 3D curves. Any class that is derived from this class represents a 3D curve.

Autodesk.AutoCAD.Geometry.Curve3d.EndPoint
Gets end point of curve.

Autodesk.AutoCAD.Geometry.Curve3d.StartPoint
Gets start point of curve.

Autodesk.AutoCAD.Geometry.Curve3d.HasEndPoint
Gets true if curve has an endpoint.

Autodesk.AutoCAD.Geometry.Curve3d.HasStartPoint
Gets true if curve has an startpoint.

Autodesk.AutoCAD.Geometry.Curve3d.OrthoBoundBlock
Gets the bounding box of the curve. The sides of the returned box are parallel to the coordinate axes.

Autodesk.AutoCAD.Geometry.Curve3d.BoundBlock
Gets the bounding box of the specified sub-interval of the curve. The sides of the returned box are parallel to the coordinate axes.

Autodesk.AutoCAD.Geometry.Curve3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Curve3d.GetInterval
Returns the parametric range of the curve.
Returns: Parametric interval on which this curve is defined.

Autodesk.AutoCAD.Geometry.Curve3d.SetInterval(Autodesk.AutoCAD.Geometry.Interval)
Sets the domain of the curve to the input interval.
value: Interval.

Autodesk.AutoCAD.Geometry.Curve3d.GetReverseParameterCurve
Reverses the parametric direction of the curve. The point set of the curve is unchanged, but the direction of the curve is reversed.
Returns: The reversed curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Curve3d)
Returns the distance between the closest points between this curve and the input curve.This method calls Curve3d.GetDistanceTo(Curve3d curve, Tolerance tolerance) with tolerance set to Global.
curve: Any 3D curve.
Returns: The distance between the closest points between this curve and the input curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the distance between the closest points between this curve and the input curve.
curve: Any 3D curve.
tolerance: Tolerance.
Returns: The distance between the closest points between this curve and the input curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Point3d)
Returns the distance between the input point and the closest point on this curve.This method calls Curve3d.GetDistanceTo(Point3d point, Tolerance tolerance) with tolerance set to Global.
point: Any 3D point.
Returns: The distance between the input point and the closest point on this curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the distance between the input point and the closest point on this curve.
point: Any 3D point.
tolerance: Tolerance.
Returns: The distance between the input point and the closest point on this curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Curve3d)
Finds the closest points between this curve and the input curve.This method calls Curve3d.GetClosestPointTo(Curve3d curve, Tolerance tolerance) with tolerance set to Global.
curve: Any 3D curve.
Returns: The closest points between this curve and the input curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the closest points between this curve and the input curve.
curve: Any 3D curve.
tolerance: Tolerance.
Returns: The closest points between this curve and the input curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d)
Finds the closest point on this curve to the input point.This method calls Curve3d.GetClosestPointTo(Point3d point, Tolerance tolerance) with tolerance set to Global.
point: Any 3D point.
Returns: The closest point on this curve to the input point.

Autodesk.AutoCAD.Geometry.Curve3d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the closest point on this curve to the input point.
point: Any 3D point.
tolerance: Tolerance.
Returns: The closest point on this curve to the input point.

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedClosestPointTo(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d)
Finds the points on the two curves which when projected onto a plane whose normal is projectDirection are the closest points on the projected curves.This method calls Curve3d.GetProjectedClosestPointTo(Curve3d curve, Vector3d projectDirection, Tolerance tolerance) with tolerance set to Global.
curve3d: Any 3D curve.
projectDirection: Projection direction.
Returns: The closest point on this curve to the input point.

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedClosestPointTo(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the points on the two curves which when projected onto a plane whose normal is projectDirection are the closest points on the projected curves.
curve3d: Any 3D curve.
projectDirection: Projection direction.
tolerance: Tolerance.
Returns: The closest point on this curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Finds the point on the curve which when projected onto a plane whose normal is projectDirection is the closest point on the projected curve to the input point.This method calls Curve3d.GetProjectedClosestPointTo(Curve3d curve, Vector3d projectDirection, Tolerance tolerance) with tolerance set to Global.
point: Any 3D point.
projectDirection: Direction of projection.
Returns: The closest point on curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the point on the curve which when projected onto a plane whose normal is projectDirection is the closest point on the projected curve to the input point.
point: Any 3D point.
projectDirection: Direction of projection.
tolerance: Tolerance.
Returns: The closest point on curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetNormalPoint(Autodesk.AutoCAD.Geometry.Point3d)
Finds the point on the input curve whose normal passes through the input point.This method calls Curve3d.GetNormalPoint(Point3d point, Tolerance tolerance) with tolerance set to Global.
point: Any 3D point.
Returns: The point on the input curve whose normal passes through the input point.

Autodesk.AutoCAD.Geometry.Curve3d.GetNormalPoint(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the point on the input curve whose normal passes through the input point.
point: Any 3D point.
tolerance: Tolerance.
Returns: The point on the input curve whose normal passes through the input point.

Autodesk.AutoCAD.Geometry.Curve3d.GetBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve. The sides of the returned box are parallel to the coordinate axes.
range: Sub-interval of curve.
Returns: The bounding box of the specified sub-interval of the curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetOrthoBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve. The sides of the returned box are parallel to the coordinate axes.
range: Sub-interval of curve.
Returns: The bounding box of the specified sub-interval of the curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedEntity(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the entity that is the projection of the curve onto the projection plane in the specified direction.This method calls Curve3d.GetProjectedEntity(Plane projectionPlane, Vector3d projectDirection, Tolerance tolerance) with tolerance set to Global.
projectionPlane: Plane on which curve is to be projected.
projectDirection: Direction in which curve is to be projected.
Returns: The entity that is the projection of the curve onto the projection plane in the specified direction.

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedEntity(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the entity that is the projection of the curve onto the projection plane in the specified direction.
projectionPlane: Plane on which curve is to be projected.
projectDirection: Direction in which curve is to be projected.
tolerance: Tolerance.
Returns: The entity that is the projection of the curve onto the projection plane in the specified direction.

Autodesk.AutoCAD.Geometry.Curve3d.GetOrthoProjectEntity(Autodesk.AutoCAD.Geometry.Plane)
Returns the entity that is the orthogonal projection of the curve onto the projection plane.This method calls Curve3d.GetOrthoProjectEntity(Plane projectionPlane, Vector3d projectDirection, Tolerance tolerance) with tolerance set to Global.
projectionPlane: Plane on which curve is to be projected.
Returns: The entity that is the orthogonal projection of the curve onto the projection plane.

Autodesk.AutoCAD.Geometry.Curve3d.GetOrthoProjectEntity(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the entity that is the orthogonal projection of the curve onto the projection plane.
projectionPlane: Plane on which curve is to be projected.
tolerance: Tolerance.
Returns: The entity that is the orthogonal projection of the curve onto the projection plane.

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(System.Double)
Determines if input parameter value is within valid parametric range of curve.This method calls Curve3d.IsOn(Double parameter, Tolerance tolerance) with tolerance set to Global.
value: Parameter value.
Returns: true if input parameter value is within valid parametric range of curve.

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if input parameter value is within valid parametric range of curve.
value: Parameter value.
tolerance: Tolerance.
Returns: true if input parameter value is within valid parametric range of curve.

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,System.Double@)
Determines if point lies on curve.This method calls Curve3d.IsOn(Point3d point, Double value, Tolerance tolerance) with tolerance set to Global.
point: Any 3D point.
value: Parameter value of point if pnt lies on curve.
Returns: true if point lies on curve.

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,System.Double@,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if point lies on curve.
point: Any 3D point.
value: Parameter value of point if pnt lies on curve.
tolerance: Tolerance.
Returns: true if point lies on curve.

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d)
Determines if point lies on curve.This method calls Curve3d.IsOn(Point3d point,Tolerance tolerance) with tolerance set to Global.
point: Any 3D point.
Returns: true if point lies on curve.

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if point lies on curve.
point: Any 3D point.
tolerance: Tolerance.
Returns: true if point lies on curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetParameterOf(Autodesk.AutoCAD.Geometry.Point3d)
Returns the parameter value of point. This function assumes that point lies on the curve and does not verify this. If point does not lie on the curve, this method returns unpredictable results.This method calls Curve3d.GetParameterOf(Point3d point, Tolerance tolerance) with tolerance set to Global.
point: Point on the curve.
Returns: The parameter value of point.

Autodesk.AutoCAD.Geometry.Curve3d.GetParameterOf(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the parameter value of point. This function assumes that point lies on the curve and does not verify this. If point does not lie on the curve, this method returns unpredictable results.
point: Point on the curve.
tolerance: Tolerance.
Returns: The parameter value of point.

Autodesk.AutoCAD.Geometry.Curve3d.GetTrimmedOffset(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType)
Returns one or more offset curves that represent the trimmed offset of the curve.This method calls Curve3d.GetTrimmedOffset(Double distance, Vector3d planeNormal, OffsetCurveExtensionType extensionType, Tolerance tolerance) with tolerance set to Global.
distance: Offset distance.
planeNormal: Normal vector to plane of curve.
extensionType: Determines how offset curve will be extended at points of C1 discontinuity.
Returns: List of offset curves.

Autodesk.AutoCAD.Geometry.Curve3d.GetTrimmedOffset(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType,Autodesk.AutoCAD.Geometry.Tolerance)
Returns one or more offset curves that represent the trimmed offset of the curve.
distance: Offset distance.
planeNormal: Normal vector to plane of curve.
extensionType: Determines how offset curve will be extended at points of C1 discontinuity.
tolerance: Tolerance.
Returns: List of offset curves.

Autodesk.AutoCAD.Geometry.Curve3d.IsClosed
Determines if start point and endpoint of curve are the same.This method calls Curve3d.IsClosed(Tolerance tolerance) with tolerance set to Global.
Returns: true if start point and endpoint of curve are the same.

Autodesk.AutoCAD.Geometry.Curve3d.IsClosed(Autodesk.AutoCAD.Geometry.Tolerance)
Determines if start point and endpoint of curve are the same.
tolerance: Tolerance.
Returns: true if start point and endpoint of curve are the same.

Autodesk.AutoCAD.Geometry.Curve3d.IsPlanar(Autodesk.AutoCAD.Geometry.Plane@)
Determines if curve is planar. If the curve is a line, then this method returns an arbitrary plane that contains the line.This method calls Curve3d.IsPlanar(Plane plane, Tolerance tolerance) with tolerance set to Global.
plane: Plane on which this curve lies if it is planar.
Returns: true if curve is planar.

Autodesk.AutoCAD.Geometry.Curve3d.IsPlanar(Autodesk.AutoCAD.Geometry.Plane@,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is planar. If the curve is a line, then this method returns an arbitrary plane that contains the line.
line: Plane on which this curve lies if it is planar.
tolerance: Tolerance.
Returns: true if curve is planar.

Autodesk.AutoCAD.Geometry.Curve3d.IsLinear(Autodesk.AutoCAD.Geometry.Line3d@)
Determines if curve is linear.This method calls Curve3d.IsLinear(Line3d line, Tolerance tolerance) with tolerance set to Global.
line: Line on which this curve lies if it is linear.
Returns: true if curve is linear.

Autodesk.AutoCAD.Geometry.Curve3d.IsLinear(Autodesk.AutoCAD.Geometry.Line3d@,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is linear.
line: Line on which this curve lies if it is linear.
tolerance: Tolerance.
Returns: true if curve is linear.

Autodesk.AutoCAD.Geometry.Curve3d.IsCoplanarWith(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Plane@)
Returns true if both curve are planar and lie in the same plane.This method calls Curve3d.IsCoplanarWith(Curve3d curve3d, Plane plane, Tolerance tolerance) with tolerance set to Global.
curve3d: Any 3D curve.
plane: Plane in which this curve and input curve lie.
Returns: true if both curve are planar and lie in the same plane.

Autodesk.AutoCAD.Geometry.Curve3d.IsCoplanarWith(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Plane@,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if both curve are planar and lie in the same plane.
curve3d: Any 3D curve.
plane: Plane in which this curve and input curve lie.
tolerance: Tolerance.
Returns: true if both curve are planar and lie in the same plane.

Autodesk.AutoCAD.Geometry.Curve3d.IsPeriodic(System.Double@)
Determines if the curve is periodic. The curve is periodic if and only if it is closed and the two points EvaluatePoint(t) and EvaluatePoint(t+period) are always the same point for all values of t.
period: Period of curve parameter.
Returns: true if the curve is periodic.

Autodesk.AutoCAD.Geometry.Curve3d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity3d@)
Determines if the curve is degenerate and if so returns the entity that the curve degenerates into.This method calls Curve3d.IsDegenerate(Entity3d result, Tolerance tolerance) with tolerance set to Global.
result: Output entity that curve degenerates into.
Returns: true if the curve is degenerate.

Autodesk.AutoCAD.Geometry.Curve3d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity3d@,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the curve is degenerate and if so returns the entity that the curve degenerates into.
result: Output entity that curve degenerates into.
tolerance: Tolerance.
Returns: true if the curve is degenerate.

Autodesk.AutoCAD.Geometry.Curve3d.GetLength(System.Double,System.Double,System.Double)
Returns the arc length of the curve between the two parameter values.
fromParameter: First parameter value.
toParameter: Second parameter value.
tolerance: Tolerance.
Returns: The arc length of the curve between the two parameter values.

Autodesk.AutoCAD.Geometry.Curve3d.GetParameterAtLength(System.Double,System.Double,System.Boolean,System.Double)
Returns the parameter value of the point whose arc length distance (from the point with parameter value datumParameter) is the input length.
datumParameter: Parameter value.
length: Arc length.
direction: Parameter direction.
Returns: The parameter value of the point.

Autodesk.AutoCAD.Geometry.Curve3d.GetArea(System.Double,System.Double)
Returns the area of the interval of the curve defined by startingParameter and endingParameter.This method calls Curve3d.GetArea(Double startingParameter, Double endingParameter, Tolerance tolerance) with tolerance set to Global.
startingParameter: Parameter value of interval start.
endingParameter: Parameter value of interval end (must be larger than startParameter).
Returns: Area of curve between startParameter and endParameter.

Autodesk.AutoCAD.Geometry.Curve3d.GetArea(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the area of the interval of the curve defined by startingParameter and endingParameter.
startingParameter: Parameter value of interval start.
endingParameter: Parameter value of interval end (must be larger than startParameter).
tolerance: Tolerance.
Returns: Area of curve between startParameter and endParameter.

Autodesk.AutoCAD.Geometry.Curve3d.GetSplitCurves(System.Double)
Returns two segments that are obtained by splitting the curve at the input parameter value. If the specified parameter value does not lie within the parametric interval of the curve or if it corresponds to the start or endpoint of the curve, then returns null.
value: Parameter value at which curve is to be split.
Returns: Curve segments that are obtained by splitting the curve at the input parameter value.

Autodesk.AutoCAD.Geometry.Curve3d.Explode(Autodesk.AutoCAD.Geometry.Interval)
Explodes the curve into its individual components.If the curve is a composite curve, then returns the list of component curves of the composite. If the curve is a spline, then it is exploded at the points of C1 discontinuity and returns a copy of each continuous sub-curve.
interval: Interval of curve that is to be exploded.
Returns: List of curves into which this curve was exploded.

Autodesk.AutoCAD.Geometry.Curve3d.EvaluatePoint(System.Double)
Returns the point on the curve that corresponds to the input parameter value.
value: Parameter value at which curve is to be evaluated.
Returns: The point on the curve that corresponds to the input parameter value.

Autodesk.AutoCAD.Geometry.Curve3d.GetSamplePoints(System.Int32)
Returns the specified number of points on the curve. The points are equally spaced by parameter value.
numSample: Number of points that are to be returned.
Returns: Array of sampled points.

Autodesk.AutoCAD.Geometry.Curve3d.GetSamplePoints(System.Double,System.Double,System.Double)
Returns a list of points on the curve between fromParameter and toParameter.
fromParameter: Starting parameter.
toParameter: Ending parameter.
chordHeight: Chord-height tolerance.
Returns: Array of points on curve between fromParameter and toParameter.

Autodesk.AutoCAD.Geometry.Curve3d.{dtor}
