Autodesk.AutoCAD.DatabaseServices.ObjectSnapInfo
This class represents the output parameters of the DatabaseServices.Entity.GetObjectSnapPoints() ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapInfo.SnapCurves
Gets object snap curves appended.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapInfo.SnapPoints
Gets object snap points appended.