Autodesk.AutoCAD.DatabaseServices.PatternDefinition
Encapsulates the data returned by the Hatch.GetPatternDefinitionAt() ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.PatternDefinition.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.DoubleCollection)
Constructor.
patternAngle: Pattern angle.
basePoint: Bbase Point.
offsetVector: Offset Vector.
dashOffsets: Dash Offsets.

Autodesk.AutoCAD.DatabaseServices.PatternDefinition.OffsetY


Autodesk.AutoCAD.DatabaseServices.PatternDefinition.OffsetX


Autodesk.AutoCAD.DatabaseServices.PatternDefinition.BaseY


Autodesk.AutoCAD.DatabaseServices.PatternDefinition.BaseX


Autodesk.AutoCAD.DatabaseServices.PatternDefinition.Angle


Autodesk.AutoCAD.DatabaseServices.PatternDefinition.GetDashes
