Autodesk.AutoCAD.GraphicsSystem.Projection
Specifies the type of projection used in the view.

Autodesk.AutoCAD.GraphicsSystem.Projection.Perspective
Projection with perspective correction.

Autodesk.AutoCAD.GraphicsSystem.Projection.Parallel
Parallel projection.