Autodesk.AutoCAD.DatabaseServices.FitData
Encapsulates the data returned by the Spline.FitData property.

Autodesk.AutoCAD.DatabaseServices.FitData.EndTangent
Gets end tangent of spline.

Autodesk.AutoCAD.DatabaseServices.FitData.StartTangent
Gets start tangent of spline.

Autodesk.AutoCAD.DatabaseServices.FitData.TangentsExist
Gets Boolean indicating whether or not specific tangents exist at the endpoints.

Autodesk.AutoCAD.DatabaseServices.FitData.FitTolerance
Gets fit tolerance of spline.

Autodesk.AutoCAD.DatabaseServices.FitData.Degree
Gets degree of spline.

Autodesk.AutoCAD.DatabaseServices.FitData.GetFitPoints
Returns the fit points of the spline,in WCS coordinates.
Returns: The fit points of the spline.

Autodesk.AutoCAD.DatabaseServices.FitData.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.FitData)
Compares this object to other and returns true if they are equal.
obj: An object.
Returns: True if this object is equal to the argument object.

Autodesk.AutoCAD.DatabaseServices.FitData.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.FitData,Autodesk.AutoCAD.Geometry.Tolerance)
This method tests other against this object for equivalency within the tolerance range specified by tolerance.
other: An object.
tolerance: The tolerance range.
Returns: True if this object is equal to the argument object.

Autodesk.AutoCAD.DatabaseServices.FitData.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj: An object.
Returns: True if this object is identical to the argument object.

Autodesk.AutoCAD.DatabaseServices.FitData.GetHashCode
Returns the hash code for this object.
Returns: The hash code for this object.

Autodesk.AutoCAD.DatabaseServices.FitData.op_Inequality(Autodesk.AutoCAD.DatabaseServices.FitData,Autodesk.AutoCAD.DatabaseServices.FitData)


Autodesk.AutoCAD.DatabaseServices.FitData.op_Equality(Autodesk.AutoCAD.DatabaseServices.FitData,Autodesk.AutoCAD.DatabaseServices.FitData)
