Autodesk.AutoCAD.GraphicsInterface.DisplaySettings
Describes the combinations of display settings that can be enabled.

Autodesk.AutoCAD.GraphicsInterface.DisplaySettings.Textures
Textures are enabled.

Autodesk.AutoCAD.GraphicsInterface.DisplaySettings.Materials
Materials are enabled.

Autodesk.AutoCAD.GraphicsInterface.DisplaySettings.Lighting
Lighting is enabled.

Autodesk.AutoCAD.GraphicsInterface.DisplaySettings.Backgrounds
Backgrounds are enabled.

Autodesk.AutoCAD.GraphicsInterface.DisplaySettings.None
No display settings are in effect.