Autodesk.AutoCAD.DatabaseServices.ApplicationLoadReasons
This enumerated type contains reasons to demand load an application.

Autodesk.AutoCAD.DatabaseServices.ApplicationLoadReasons.TransparentlyLoadable
Load the ObjectARX application transparently.

Autodesk.AutoCAD.DatabaseServices.ApplicationLoadReasons.LoadDisabled
Do not demand load the ObjectARX application for any reason.

Autodesk.AutoCAD.DatabaseServices.ApplicationLoadReasons.OnLoadRequest
Allow loading of the ObjectARX application via the DynamicLinker.LoadApp() method.

Autodesk.AutoCAD.DatabaseServices.ApplicationLoadReasons.OnCommandInvocation
Load the ObjectARX application whenever an unknown command is executed for which it has a registry entry.

Autodesk.AutoCAD.DatabaseServices.ApplicationLoadReasons.OnAutoCADStartup
Load the ObjectARX application when AutoCAD starts up.

Autodesk.AutoCAD.DatabaseServices.ApplicationLoadReasons.OnProxyDetection
Load the ObjectARX application when objects of custom classes it controls are loaded via drawing open, dxfin, insert, and so on.