Autodesk.AutoCAD.DatabaseServices.GradientPatternType
Values in this enum indicate the source of the gradient pattern.

Autodesk.AutoCAD.DatabaseServices.GradientPatternType.UserDefinedGradient
Indicates that the gradient name refers to one of the user-defined gradient patterns.

Autodesk.AutoCAD.DatabaseServices.GradientPatternType.PreDefinedGradient
Indicates that the gradient name refers to one of the predefined gradient patterns.