Autodesk.AutoCAD.DatabaseServices.ObjectTypeAttribute
This attribute reports the type of an object.

Autodesk.AutoCAD.DatabaseServices.ObjectTypeAttribute.#ctor(System.Type)


Autodesk.AutoCAD.DatabaseServices.ObjectTypeAttribute.ObjectType
