Autodesk.AutoCAD.GraphicsInterface.ViewportTraits
Gives viewports the opportunity to pass per-viewport properties to the display and rendering systems.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.RenderSettings
Gets or sets the Object ID of the RenderSettings object applied to this viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.RenderEnvironment
Gets or sets the Object ID of the RenderEnvironment object associated with this viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.Contrast
Gets or sets the overall light contrast for the viewport. Contrast affects the intensity ratio between user lights and ambient lights.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.Brightness
Gets or sets the overall light brightness for the viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.AmbientLightColor
Gets or sets the color and instensity for ambient light. Dark colors will result in little ambient light, while light colors result in bright ambient light.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.DefaultLightingType
Gets or sets the type of default lighting in the viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.DefaultLightingOn
Gets or sets the state of default lighting for this viewport. This toggle is an override to user lights. When ON, the default lights are used instead of user lights. When there are no user lights, default lights are used, and the value of this toggle is ignored.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.Background
Gets or sets Object ID of a background object. This background will be applied to the viewport and full renders of this viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.{dtor}
