Autodesk.AutoCAD.DatabaseServices.FaceRecord
The FaceRecord class is a special class of vertex that is used by the PolyFaceMesh class to group together mesh point vertices that represent faces in the mesh.

Autodesk.AutoCAD.DatabaseServices.FaceRecord.#ctor(System.Int16,System.Int16,System.Int16,System.Int16)
This constructor initializes the FaceRecord to use the mesh vertices specified by the indices vertex0 - vertex3 as the four corner points of the face. The vertex indices start with 1. Negative index numbers can be used to indicate that the edge that starts at that vertex is to be invisible.
vertex0: Index number of first vertex for the face.
vertex1: Index number of second vertex for the face.
vertex2: Index number of third vertex for the face.
vertex3: Index number of fourth vertex for the face.

Autodesk.AutoCAD.DatabaseServices.FaceRecord.#ctor
Default constructor. Initializes the corner vertex indices to 0.

Autodesk.AutoCAD.DatabaseServices.FaceRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.FaceRecord.GetVertexAt(System.Int16)
Returns the index number of the PolyFaceMesh vertex used as the faceIndex corner of the face. Face corner indices start with 0, so faceIndex must be 0, 1, 2, or 3. PolyFaceMesh vertex indices start with 1, and will be negative if the edge is invisible or positive if the edge is visible.
faceIndex: Face corner index number (must be 0 - 3).
Returns: Index of vertex in PolyFaceMesh vertex list.

Autodesk.AutoCAD.DatabaseServices.FaceRecord.SetVertexAt(System.Int16,System.Int16)
Sets the FaceRecord so that the PolyFaceMesh vertex list index number vertexIndex is used as the vertex index for the faceIdx corner of the face.
faceIndex: Face corner index number (must be 0 - 3).
vertexIndex: Index of vertex in PolyFaceMesh's vertex list that is to be used for this face corner.
Returns: Index of vertex in PolyFaceMesh vertex list.

Autodesk.AutoCAD.DatabaseServices.FaceRecord.IsEdgeVisibleAt(System.Int16)
Returns the visibility value for the edge that starts with the face corner specified by faceIndex.
faceIndex: Face corner index number (must be 0 - 3).
Returns: Boolean indicating if edge is visible or not.

Autodesk.AutoCAD.DatabaseServices.FaceRecord.MakeEdgeVisibleAt(System.Int16)
Sets the edge that starts at the corner specified by faceIndex to be visible. Face corner indices start with 0, so faceIndex must be 0, 1, 2, or 3.
faceIndex: Index number of starting corner for edge (must be 0 - 3).

Autodesk.AutoCAD.DatabaseServices.FaceRecord.MakeEdgeInvisibleAt(System.Int16)
Sets the edge that starts at the corner specified by faceIndex to be invisible. Face corner indices start with 0, so faceIndex must be 0, 1, 2, or 3.
faceIndex: Index number of starting corner for edge (must be 0 - 3).

Autodesk.AutoCAD.DatabaseServices.FaceRecord.{dtor}
