Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord
Represents the records that are found in the AcDbTextStyleTable (known as the "Style" table in DXF). Each of these records represents a specific set of text parameters such as font, default size, relative x scaling, vertical or horizontal, etc.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.#ctor
Default constructor. Initializes IsShapeFile and IsVertical to false; TextSize, XScale, ObliquingAngle, and PriorSize to 0.0; FlagBits to 0; and font file name and BigFontFileName string null.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.Font
Gets or sets the font definition data from the text style record. The data are the typeface, the bold and italics style attributes, the character set, and the pitch and family attributes.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.BigFontFileName
Gets or sets the name of the big font file for this text style.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.FileName
Gets or sets the name of the font file for this text style.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.PriorSize
Gets or sets the text height used for the last text created using this Text Style.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.FlagBits
Gets or sets the textStyle flagBits value. Only the second and third bits are used. If the second bit is set it indicates that the text is drawn backward (that is, mirrored in X). If the third bit is set it indicates that the text is drawn upside down (that is, mirrored in Y).

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.ObliquingAngle
Gets or sets the obliquing angle for the TextStyleTableRecord.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.XScale
Gets or sets the width factor (also referred to as the relative X-scale factor) for the TextStyleTableRecord.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.TextSize
Gets or sets the default text size for text drawn with this TextStyle.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.IsVertical
Gets or sets true if and only if text drawn with this text style is drawn vertically.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.IsShapeFile
Gets or sets true when the text font file is interpreted as a shape record.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.{dtor}
