Autodesk.AutoCAD.GraphicsInterface.AttenuationType
The type of attenuation, or decay, for this light. This only applies to point and spot lights. Distant lights always have no attenuation.

Autodesk.AutoCAD.GraphicsInterface.AttenuationType.InverseSquare
Sets the attenuation to be the inverse of the square of the distance from the light source.

Autodesk.AutoCAD.GraphicsInterface.AttenuationType.InverseLinear
Sets the attenuation to be the inverse of the linear distance from the lgiht source.

Autodesk.AutoCAD.GraphicsInterface.AttenuationType.None
No attenuation; emitted light has the same brightness (intensity) regardless of the distance to the source.