Autodesk.AutoCAD.DatabaseServices.Polyline
Polyline is often called a lightweight polyline because of its efficient use of memory. Polyline provides greater performance and reduced overhead compared to Polyline2d. Its database representation is more efficient because it is stored as a single object with a single name, handle, type, space, layer, and width.

Autodesk.AutoCAD.DatabaseServices.Polyline.#ctor(System.Int32)
Constructor.
vertices: Number of vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Polyline.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Polyline.HasWidth
Gets true if the polyline has any width values set for any of the segments.

Autodesk.AutoCAD.DatabaseServices.Polyline.HasBulges
Gets true if the polyline has any bulge factors set for any of the segments.

Autodesk.AutoCAD.DatabaseServices.Polyline.NumberOfVertices
Gets the number of vertices in the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.IsOnlyLines
Gets true if there are only lines in the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.Normal
Gets or sets the normal (in WCS coordinates) to the plane containing the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.ConstantWidth
Gets or sets the polyline's width value if the polyline has constant width.

Autodesk.AutoCAD.DatabaseServices.Polyline.Thickness
Gets or sets the thickness of the polyline; this value can be negative. Thickness is an extrusion relative to the normal of the polyline; if the thickness is negative, then the extrusion is in the opposite sense of the normal.

Autodesk.AutoCAD.DatabaseServices.Polyline.Elevation
Gets or sets the distance from the WCS origin to the plane of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.Plinegen
Gets or sets true if the polyline has PLINEGEN set.

Autodesk.AutoCAD.DatabaseServices.Polyline.Closed
Gets or sets a Boolean indicating whether the polyline is closed.

Autodesk.AutoCAD.DatabaseServices.Polyline.ConvertFrom(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
Fills the Polyline with data from the Polyline2d defined by entity. entity must be a Polyline2dType.SimplePoly or Polyline2dType.FitCurvePoly type of Polyline2d object in a database. This method should be called from a Polyline that is not yet database-resident.
entity: The Polyline2d to copy from.
transferId: Boolean indicates whether or not to do a HandOverTo between the Polyline2d and the Polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.ConvertTo(System.Boolean)
Creates a Polyline2d from the Polyline and returns the newly created Polyline2d.
transferId: Boolean indicates whether or not to do a HandOverTo between the Polyline2d and the Polyline.
Returns: The newly created Polyline2d.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetPoint3dAt(System.Int32)
Returns the 3D location of the vertex index in World Coordinates.
value: Index (0 based) of the vertex.
Returns: Copy of point data at vertex index.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetSegmentType(System.Int32)
Returns the type of segment that is headed by the vertex index.
index: Index (0 based) of the vertex.
Returns: The type of segment.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetLineSegment2dAt(System.Int32)
Returns a representative 2D copy of that segment in the polyline's own object coordinate system (OCS) if the segment at vertex index is a line.
index: Index (0 based) of the vertex for start of segment.
Returns: Copy of line segment starting at vertex index.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetArcSegment2dAt(System.Int32)
If the segment at vertex index is an arc, then this method will fill in arc with the 2D arc information (radius, center, and so on) from the polyline in the polyline's own OCS.
index: Index (0 based) of the vertex for start of arc.
Returns: Copy of arc.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetLineSegmentAt(System.Int32)
If the segment at vertex index is a line, then returns a representative 3D copy of that segment in World Coordinates.
index: Index (0 based) of the vertex for start of segment.
Returns: Copy of line segment starting at vertex index.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetArcSegmentAt(System.Int32)
If the segment at vertex index is an arc, then this method will fill in arc with the 3D arc information (radius, center, and so on) from the polyline in WCS.
index: Index (0 based) of the vertex for start of arc.
Returns: Copy of arc.

Autodesk.AutoCAD.DatabaseServices.Polyline.OnSegmentAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d,System.Double)
This method determines whether or not pt2d (specified in the polyline's Entity Coordinate System) is on the segment of the polyline starting at vertex index . If pt2d is on the polyline's segment, then value is set to the location of the point on the segment.value will be in the parametric form of the segment type (in other words, linear or arc).
index: Index (0 based) of the vertex.
pt2d: Point (in polyline OCS coords) to check at vertex index.
value: Output parameter of at vertex index.
Returns: true if the point is on the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.AddVertexAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Double,System.Double)
Adds a vertex to the polyline. If index is 0, the vertex will become the first vertex of the polyline. If index is the value returned by Polyline.NumberOfVertices, then the vertex will become the last vertex of the polyline. Otherwise the vertex will be added just before the index vertex.
index: Index (0 based) before which to insert the vertex.
pt: Vertex location point.
bulge: Bulge value for vertex.
startWidth: Start width for vertex.
endWidth: End width for vertex.

Autodesk.AutoCAD.DatabaseServices.Polyline.RemoveVertexAt(System.Int32)
Removes the vertex at index.
index: Index (0 based) of the vertex to remove.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetPoint2dAt(System.Int32)
Gets the 2D location of the vertex index in the polyline's own ojbect coordinate system (OCS).
index: Index (0 based) of the vertex.
Returns: Copy of point data at vertex index.

Autodesk.AutoCAD.DatabaseServices.Polyline.SetPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Sets pt (in polyline OCS coordinates) to be the location of the index vertex.
index: Index (0 based) of the vertex.
pt: Location for the vertex.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetBulgeAt(System.Int32)
Gets the bulge factor value at the index vertex. The bulge factor is used to indicate how much of an arc segment is present at this vertex. The bulge factor is the tangent of one fourth the included angle for an arc segment, made negative if the arc goes clockwise from the start point to the endpoint. A bulge of 0 indicates a straight segment, and a bulge of 1 is a semicircle.
index: Index (0 based) of the vertex for start of bulge.
Returns: Bulge value at vertex index.

Autodesk.AutoCAD.DatabaseServices.Polyline.SetBulgeAt(System.Int32,System.Double)
Sets bulge to be the bulge value for the index vertex. This will determine the bulge for the polyline segment which follows the index vertex.
index: Index (0 based) of the vertex.
bulge: Bulge value for the vertex.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetStartWidthAt(System.Int32)
Gets start width at the vertex index.
index: Index (0 based) of the vertex.
Returns: Start width at the vertex index.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetEndWidthAt(System.Int32)
Gets end width at the vertex index.
index: Index (0 based) of the vertex.
Returns: End width at the vertex index.

Autodesk.AutoCAD.DatabaseServices.Polyline.SetStartWidthAt(System.Int32,System.Double)
Sets startWidth to be the start width for vertex index.
index: Index (0 based) of the vertex.
startWidth: Start width value for vertex index.

Autodesk.AutoCAD.DatabaseServices.Polyline.SetEndWidthAt(System.Int32,System.Double)
Sets endWidth to be the end width for vertex index.
index: Index (0 based) of the vertex.
endWidth: End width value for vertex index.

Autodesk.AutoCAD.DatabaseServices.Polyline.MinimizeMemory
This method optimizes the memory usage of the polyline. This process takes time and should not be used until all modifications in a session are complete.

Autodesk.AutoCAD.DatabaseServices.Polyline.MaximizeMemory
This method "decompresses" any memory compression that may currently be used by the polyline. This enables faster access to the polyline for modification.

Autodesk.AutoCAD.DatabaseServices.Polyline.Reset(System.Boolean,System.Int32)
Resets the polyline's vertex data.
reuse: Boolean indicates whether or not to retain some vertices.
vertices: Number of vertices to retain.

Autodesk.AutoCAD.DatabaseServices.Polyline.{dtor}
