Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent


Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.#ctor(Autodesk.AutoCAD.GraphicsInterface.MaterialColor,Autodesk.AutoCAD.GraphicsInterface.MaterialMap,System.Double)


Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.Gloss


Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.Map


Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.Color


Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.ToString


Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.ToString(System.IFormatProvider)


Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent)


Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent)
