Autodesk.AutoCAD.DatabaseServices.PolyMeshType
PolyMeshType Enum.

Autodesk.AutoCAD.DatabaseServices.PolyMeshType.BezierSurfaceMesh
Bezier surface fit.

Autodesk.AutoCAD.DatabaseServices.PolyMeshType.CubicSurfaceMesh
Cubic B-spline surface fit.

Autodesk.AutoCAD.DatabaseServices.PolyMeshType.QuadSurfaceMesh
Quadratic B-spline surface fit.

Autodesk.AutoCAD.DatabaseServices.PolyMeshType.SimpleMesh
Plain mesh with no surface fitting or smoothing.