Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter
Defines an extruded volume based on a 2D boundary definition, local coordinate system, and the front and back clipping planes.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.HasPerspectiveCamera
Gets true if a perspective camera is currently defined for this SpatialFilter object.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.Definition
Gets or sets the definition of the SpatialFilter object.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.GetQueryBounds
Gets the boundary area of this SpatialFilter object.
Returns: The extents that define the query volume.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.GetQueryBounds(Autodesk.AutoCAD.DatabaseServices.BlockReference)
This method has been deprecated and will be removed in a future release.
blockReference: Deprecated.
Returns: Deprecated.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.GetVolume
Transforms the SpatialFilter object's clip boundary definition into the coordinate space of the associated block or xref,and sets the output to the resulting transformed value.
Returns: Output for the resulting transformed value.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.SetPerspectiveCamera(Autodesk.AutoCAD.Geometry.Point3d)
Sets the perspective camera position to the location specified by fromPoint.
fromPoint: New base point for the camera.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.ClipVolumeIntersectsExtents(Autodesk.AutoCAD.DatabaseServices.Extents3d)
This method is used to determine whether an object with extents ext intersects this SpatialFilter object's clipping volume.
ext: Extents.
Returns: True if ext intersects this filter's clipping volume.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.{dtor}
