Autodesk.AutoCAD.DatabaseServices.LayerTable
This class is the symbol table for layers.

Autodesk.AutoCAD.DatabaseServices.LayerTable.IncludingHidden


Autodesk.AutoCAD.DatabaseServices.LayerTable.GetEnumerator
Gets an enumerator that can be used to iterate through the contents of the LayerTable.
Returns: An enumerator that can be used to iterate through the contents of the LayerTable.

Autodesk.AutoCAD.DatabaseServices.LayerTable.{dtor}
