Autodesk.AutoCAD.DatabaseServices.Material
Used to define, store, and display material properties for shaded entities.

Autodesk.AutoCAD.DatabaseServices.Material.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Material.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Material.Mode
Gets or sets the mode of this material.

Autodesk.AutoCAD.DatabaseServices.Material.ChannelFlags
Gets or sets the channel flags for this material. The flags indicate which textures are in use by this material.

Autodesk.AutoCAD.DatabaseServices.Material.IlluminationModel
Gets or sets the illumination model set on this material. This model determines the type of shader used to render this material.

Autodesk.AutoCAD.DatabaseServices.Material.Reflectivity
Gets or sets the refelectivity of the material. A higher value indicates a highly reflective material.

Autodesk.AutoCAD.DatabaseServices.Material.SelfIllumination
Gets or sets the self-illumination property of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Translucence
Gets or sets the translucence value of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Refraction
Gets or sets the refraction component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Bump
Gets or sets the bump component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Opacity
Gets or sets the opacity component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Reflection
Gets or sets the reflection component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Specular
Gets or sets the specular component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Diffuse
Gets or sets the diffuse component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Ambient
Gets or sets the ambient component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Description
Gets or sets the material description string.

Autodesk.AutoCAD.DatabaseServices.Material.Name
Gets or sets the material name string.

Autodesk.AutoCAD.DatabaseServices.Material.{dtor}
