Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume
Encapsulates the data required to describe a spatial filter's volume.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume.ViewField


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume.UpDirection


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume.ToPoint


Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume.FromPoint
