Autodesk.AutoCAD.DatabaseServices.TextVerticalMode
Vertical orientation for the text.

Autodesk.AutoCAD.DatabaseServices.TextVerticalMode.TextTop
TV_TOP.

Autodesk.AutoCAD.DatabaseServices.TextVerticalMode.TextVerticalMid
TV_MID.

Autodesk.AutoCAD.DatabaseServices.TextVerticalMode.TextBottom
TV_BOT.

Autodesk.AutoCAD.DatabaseServices.TextVerticalMode.TextBase
TV_BASE.