Autodesk.AutoCAD.GraphicsInterface.FaceStyle
Defines a collection of visual style properties that can be applied to the faces of graphical entities.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.FaceStyle.MonoColor
Gets or sets the monochromatic color that will be applied to the faces.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.SpecularHighlight
Gets or sets the amount of specular highlight that will be applied to a material that is applied to the faces.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.Opacity
Gets or sets a double representing the opacity level.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.FaceModifiers
Gets or sets unsigned long representing the collection of face modifier flags that are in effect.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.FaceColorMode
Gets or sets the currently selected face color mode in the range of the FaceColorMode enumeration.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.LightingQuality
Gets or sets the currently selected face lighting quality in the range of the LightingQuality enumeration.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.LightingModel
Gets or sets the currently selected face lighting model in the range of the LightingModel enumeration.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.Clone
Returns a copy of this object.
Returns: A copy of this object.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.Set(Autodesk.AutoCAD.GraphicsInterface.FaceStyle)
Initializes this face style with the values of the given face style.
value: The face style that will be copied into this face style.

Autodesk.AutoCAD.GraphicsInterface.FaceStyle.{dtor}
