Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices
Contains various utilities for working with symbol names, symbol records, and symbol tables.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.ViewportActiveName


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.TextStyleStandardName


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.RegAppAcadName


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LinetypeContinuousName


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LinetypeByLayerName


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LinetypeByBlockName


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LayerZeroName


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LayerDefpointsName


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.BlockPaperSpaceName


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.BlockModelSpaceName


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLayerDefpointsId(Autodesk.AutoCAD.DatabaseServices.Database)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLayerZeroId(Autodesk.AutoCAD.DatabaseServices.Database)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsCompatibilityMode(Autodesk.AutoCAD.DatabaseServices.Database)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.ValidateCompatibleSymbolName(System.String,System.Boolean,System.Boolean,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsBlockLayoutName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsBlockModelSpaceName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsBlockPaperSpaceName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLayerDefpointsName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLayerZeroName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLinetypeByBlockName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLinetypeByLayerName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLinetypeContinuousName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsRegAppAcadName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsTextStyleStandardName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsViewportActiveName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetBlockModelSpaceId(Autodesk.AutoCAD.DatabaseServices.Database)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetBlockPaperSpaceId(Autodesk.AutoCAD.DatabaseServices.Database)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLinetypeByBlockId(Autodesk.AutoCAD.DatabaseServices.Database)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLinetypeByLayerId(Autodesk.AutoCAD.DatabaseServices.Database)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLinetypeContinuousId(Autodesk.AutoCAD.DatabaseServices.Database)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetRegAppAcadId(Autodesk.AutoCAD.DatabaseServices.Database)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetTextStyleStandardId(Autodesk.AutoCAD.DatabaseServices.Database)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.MakeDependentName(System.String,System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.RepairPreExtendedSymbolName(System.String,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.RepairSymbolName(System.String,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.ValidatePreExtendedSymbolName(System.String,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.ValidateSymbolName(System.String,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetBlockNameFromInsertPathName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetInsertPathNameFromBlockName(System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetMaxSymbolNameLength(System.Boolean,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetPathNameFromSymbolName(System.String,System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetSymbolNameFromPathName(System.String,System.String)


Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.PreValidateSymbolName(System.Boolean)
