Autodesk.AutoCAD.DatabaseServices.DBObjectCollection
Provides a container for DBObject objects.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Count
Gets the number of objects in the collection.
Returns: Returns a value representing the number of objects in the collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.RemoveAt(System.Int32)
Removes the element at position index.
index: Index of the desired element to remove.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Clear
Removes all the elements in the Collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.GetEnumerator
Returns an enumerator object for this collection.
Returns: An enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Add(Autodesk.AutoCAD.DatabaseServices.DBObject)
Adds the object represented by value to this collection.
value: DBObject object to be appended to this collection.
Returns: The zero-based index of the newly added collection item.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets the 0-based index of the collection item that matches value.
value: The object to search for in this collection.
Returns: The zero-based index of the collection item that matches value, or -1 if value does not exist in the collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.DBObject)
Inserts an element into the collection at the specified index.
index: The zero-based index at which value should be inserted.
value: Element to be inserted in the collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Remove(Autodesk.AutoCAD.DatabaseServices.DBObject)
Removes the object represented by value from this collection.
value: The item to remove from the collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Contains(Autodesk.AutoCAD.DatabaseServices.DBObject)
Determines if the collection contains value.
value: Value to search for in this collection.
Returns: A value indicating whether the collection contains an object that matches value.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.DBObject[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.{dtor}
