Autodesk.AutoCAD.DatabaseServices.LineSpacingStyle
The LineSpacingStyle values are used by the MText property LineSpacingStyle to select the type of spacing.

Autodesk.AutoCAD.DatabaseServices.LineSpacingStyle.Exactly
Line spacing is fixed and is never adjusted.

Autodesk.AutoCAD.DatabaseServices.LineSpacingStyle.AtLeast
Line spacing is a minimum that may be adjusted to accommodate larger font sizes or graphics that would not otherwise fit within the specified spacing.