Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits
Implements empty DrawableTraits and SubEntityTraits interfaces to allow non-entity drawables, such as materials, to elaborate their unique properties through DrawableTraits.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.SelectionOnlyGeometry
Not implemented.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.ShadowFlags
Not implemented.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.DrawFlags
Not implemented.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.EdgeStyleOverride


Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.VisualStyle


Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Sectionable
Not implemented.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Mapper
Not implemented.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Material
Not implemented.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.PlotStyleDescriptor
Not implemented.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Thickness
Overrides the base SubEntityTraits.Thickness property with an empty implementation.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.LineTypeScale
Overrides the base SubEntityTraits.LineTypeScale property with an empty implementation.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.LineWeight
Overrides the base SubEntityTraits.LineWeight property with an empty implementation.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.FillType
Overrides the base SubEntityTraits.FillType property with an empty implementation.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.LineType
Overrides the base SubEntityTraits.LineType property with an empty implementation.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Layer
Overrides the base SubEntityTraits.Layer property with an empty implementation.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.TrueColor
Overrides the base SubEntityTraits.TrueColor property with an empty implementation.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Color
Overrides the base SubEntityTraits.Color property with an empty implementation.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.SetSelectionMarker(System.Int32)
Overrides the base SubEntityTraits.SetSelectionMarker() method with an empty implementation.
markerId: Integer to be used as graphics system marker.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.SetupForEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
Overrides the base SubEntityTraits.SetupForEntity() method with an empty implementation.
entity: Entity.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.AddLight(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds a light.
lightId: Object ID of the added light.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.SetLayerFlags(Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.LayerFlags)


Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.{dtor}
