Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection
Provides a container for DynamicBlockReferenceProperty objects.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection.Count
Gets the number of objects in the collection.
Returns: Returns a value representing the number of objects in the collection.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection.GetEnumerator
Returns an enumerator object for this collection.
Returns: An enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection.{dtor}
