Autodesk.AutoCAD.DatabaseServices.DxfFiler
This abstract class provides the interface for derived classes that are used for I/O operations that work with the DXF information format.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DxfFiler.IsModifyingExistingObject
Gets true if there is an entmod operation active or false if not.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.Thickness
Gets the object's thickness value when filing in. The value returned is 0.0 if the object data being read does not contain a thickness data item.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.Elevation
Gets the elevation of the object. The returned value returned is 0.0 if the object data being read does not contain an elevation value.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtEmbeddedObjectStart
Gets true if the filer is currently pointing to an item with a DxfCode of DxfCode.EmbeddedObjectStart.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtEndOfObject
Gets true if there is no more of the object's information to read.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtExtendedData
Gets true if the filer is currently pointing to an item with a DxfCode of DxfCode.XDataStart or DxfCode.RegAppName.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtEndOfFile
Gets true if the filer is either at a subclass data marker in the object (that is, next item to read has a DxfCode of DxfCode.Subclass), or at the start of the object's xdata (that is, no more normal object data to read), or at the end of the object's data (that is, another object's data is next or the filer is at the end of the file being read).

Autodesk.AutoCAD.DatabaseServices.DxfFiler.IncludesDefaultValues
Gets true if the filer is being used for a purpose where default values (that is, color BYLAYER, normal = (0,0,1), etc.) are normally filed out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.Precision
Gets or sets the filer to the precision for any data that requires decimal precision such as doubles, points, and so forth.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.DwgVersion
Gets the drawing file version, such as Release 13 or Release 14.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.Database
Gets the working database being read or written by this filer.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.FilerType
Gets a FilerType value indicating the actual type of the filer.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.ErrorMessage
Gets the error string message the filer is currently set to display if an error occurs.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.RewindFiler
The implementation of this method should follow that of the ObjectARX internal filers. It should reset the filer to its default condition without changing the position that the filer is pointing to in the data it's reading or writing.
Returns: In the ObjectARX internal filers, this method always returns 1.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.FilerStatus


Autodesk.AutoCAD.DatabaseServices.DxfFiler.ResetFilerStatus
The implementation of this function should follow that of the ObjectARX internal filers. It should reset the filer's internal error status to ErrorStatus.Ok.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.SetError(System.String,System.String[])
Sets the filer's error message string to a copy of format and the filer's internal ErrorStatus to ErrorStatus.BadDxfSequence.
format: Error message string.
values: Arguments to replace any formatting codes in the error message text.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.SetError(Autodesk.AutoCAD.Runtime.ErrorStatus,System.String,System.String[])
Sets the filer's error message string to a copy of format and the filer's internal ErrorStatus to value.
value: ErrorStatus error code.
format: Error message string.
values: Arguments to replace any formatting codes in the error message text.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.ReadResultBuffer
This method is the only actual "read" input method provided to read data.
Returns: ResultBuffer structure to be read in.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteResultBuffer(Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
Call the appropriate filer WriteXxxx method to handle the data type contained in buffer.
buffer: ResultBuffer structure to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteObjectId(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out the long within value.
opCode: DXF group code to be written out.
value: ObjectId to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteString(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.String)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out the string value.
opCode: DXF group code to be written out.
value: String to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteBytes(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Byte[])
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out the chunk.
opCode: DXF group code to be written out.
chunk: Byte array containing the data to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteHandle(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.DatabaseServices.Handle)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out the handle value contained in value. The value is written out as a string of hexadecimal digits (16 characters maximum, excluding the null string terminator) that is the hexadecimal representation of the 64-bit integer handle value.
opCode: DXF group code to be written out.
value: Handle to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteInt32(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out value.
opCode: DXF group code to be written out.
value: 32-bit integer to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteInt16(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Int16)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out value.
opCode: DXF group code to be written out.
value: 16-bit integer to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteUInt32(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.UInt32)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out value.
opCode: DXF group code to be written out.
value: 32-bit unsigned integer to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteUInt16(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.UInt16)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out value.
opCode: DXF group code to be written out.
value: 16-bit unsigned integer to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteByte(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Byte)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out value.
opCode: DXF group code to be written out.
value: 8-bit unsigned integer to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteBoolean(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Boolean)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out value(an int).The value should be either 0 or 1. If it is other than 0, 1 should be written out instead of its actual value.
opCode: DXF group code to be written out.
value: Boolean to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteBool(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Boolean)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out the value (a short).The value should be either 0 or 1. If it is other than 0, 1 should be written out instead of its actual value.
opCode: DXF group code to be written out.
value: Boolean to be written out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteDouble(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Double,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out value to precision decimal places.
opCode: DXF group code to be written out.
value: Double to be written out.
precision: Decimal places to use when writing out the double value.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WritePoint2d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Point2d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out the X and Y point coordinate doubles in value to precision decimal places.
opCode: DXF group code to be written out.
value: 2D point to be written out.
precision: Decimal places to use when writing out the 2D point.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WritePoint3d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Point3d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out the X, and Y point coordinate doubles in value. If filing to a DXF file, file the X value out, then file out the DxfCode code+10, then file out the Y coordinate, then file out the DxfCode code+20, and last file out the Z coordinate.
opCode: DXF group code to be written out.
value: 3D point to be written out.
precision: Decimal places to use when writing out the 3D point.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteVector2d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Vector2d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out the X, and Y vector doubles in value to precision decimal places.
opCode: DXF group code to be written out.
value: 2D vector to be written out.
precision: Decimal places to use when writing out the 2D vector.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteVector3d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Vector3d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out the X, and Y doubles in value. If filing to a DXF file, file the X value out, then file out the DxfCode code+10, then file out the Y value, then file out the DxfCode code+20, and last file out the Z value.
opCode: DXF group code to be written out.
value: 3D vector to be written out.
precision: Decimal places to use when writing out the 3D vector.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteScale3d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Scale3d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers. It should write out the DxfCode in opCode and write out the X, and Y doubles in value. If filing to a DXF file, file the X value out, then file out the DxfCode code+10, then file out the Y value, then file out the DxfCode code+20, and last file out the Z value.
opCode: DXF group code to be written out.
value: Scale3d object to be written out.
precision: Decimal places to use when writing out the Scale3d object.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteXDataStart
If the filer is filing to AutoLISP or ADSRX, then this method writes out the DxfCode DxfCode.XDataStart (value of -3) to indicate the start of xdata. If the filer is filing to a DXF file, then this method does nothing.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.PushBackItem
Resets the filer to position to where it was before the last item was read.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtSubclassData(System.String)
Returns true if the filer is currently pointing to an item with a DxfCode of DxfCode.Subclass and a data value string that exactly matches the value string.
value: SubClassName that should be compared.
Returns: true if the filer is currently pointing to an item with a DxfCode of DxfCode.Subclass and a data value string that exactly matches the value string.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.HaltAtClassBoundaries(System.Boolean)
If value == true (the default for all ObjectARX internal filers), then set the filer to set its ErrorStatus to ErrorStatus.EndOfFile whenever a DxfCode value of DxfCode.Start (value 0), DxfCode.Subclass (value 100), DxfCode.RegAppName (value 1001), or DxfCode.XDataStart is encountered;If halt == false, then set the filer to read all input without resetting its ErrorStatus unless an I/O error occurs.
value: Boolean indicating whether or not to halt at certain key markers in the file.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteEmbeddedObjectStart
Writes out the DxfCode of DxfCode.EmbeddedObjectStart,then suppresses the writing out of the DxfCode of DxfCode.Start for the embedded object that follows,and writes out a string data value of "Embedded Object" for the DxfCode.EmbeddedObjectStart group code.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.{dtor}
