Autodesk.AutoCAD.DatabaseServices.ViewTableRecordRenderMode
The RenderMode enumerated type contains the values specifying how to render shading in a viewport.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecordRenderMode.GouraudShadedWithWireframe


Autodesk.AutoCAD.DatabaseServices.ViewTableRecordRenderMode.FlatShadedWithWireframe


Autodesk.AutoCAD.DatabaseServices.ViewTableRecordRenderMode.GouraudShaded


Autodesk.AutoCAD.DatabaseServices.ViewTableRecordRenderMode.FlatShaded


Autodesk.AutoCAD.DatabaseServices.ViewTableRecordRenderMode.HiddenLine


Autodesk.AutoCAD.DatabaseServices.ViewTableRecordRenderMode.Wireframe


Autodesk.AutoCAD.DatabaseServices.ViewTableRecordRenderMode.Optimized2D
