Autodesk.AutoCAD.DatabaseServices.RasterVariables
The RasterVariables object carries all drawing-scope persistent variables associated with AutoCAD raster image management and display. A single object of this type is stored in each drawing file that contains image entities.

Autodesk.AutoCAD.DatabaseServices.RasterVariables.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RasterVariables.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RasterVariables.UserScale
Gets or sets the real-world unit representing one AutoCAD drawing unit.

Autodesk.AutoCAD.DatabaseServices.RasterVariables.ImageQuality
Gets or sets the current image display quality setting. The Image Quality setting allows users to trade display speed for displayed image quality. In draft mode, fast low-quality image resampling and processing algorithms are used. In high quality mode, more computationally intensive algorithms are used, which usually generate more accurate and visually pleasing output.

Autodesk.AutoCAD.DatabaseServices.RasterVariables.ImageFrame
Gets or sets the current image frame visibility setting.

Autodesk.AutoCAD.DatabaseServices.RasterVariables.{dtor}
