Autodesk.AutoCAD.Geometry.Surface
Surface class is an abstract base class for all other parametric surfaces.

Autodesk.AutoCAD.Geometry.Surface.ReverseNormal
The normal to the surface is evaluated either by formula + partialU.CrossProduct(partialV).Normalize() or by formula - partialU.CrossProduct(partialV).Normalize().When a surface is created, the normal evaluation formula is set to the one with "+".This property switches evaluator from one formula to the other.

Autodesk.AutoCAD.Geometry.Surface.IsNormalReversed
Gets true if the normal to the surface is evaluated as partialU.CrossProduct(partialV).Normalize();false if the normal to the surface is evaluated as + partialU.CrossProduct(partialV).Normalize().

Autodesk.AutoCAD.Geometry.Surface.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Surface.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d)
Returns the point on this surface that is closest to the point point.
point: Point on surface.
tolerance: Tolerance.
Returns: The point on this surface that is closest to the point point.

Autodesk.AutoCAD.Geometry.Surface.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the point on this surface that is closest to the point point.
point: Point on surface.
tolerance: Tolerance.
Returns: The point on this surface that is closest to the point point.

Autodesk.AutoCAD.Geometry.Surface.GetEnvelope
Returns the minimal pair of intervals such that the corresponding rectangle in parameter space contains the parameter domain of this surface.
Returns: The minimal pair of intervals such that the corresponding rectangle in parameter space contains the parameter domain of this surface.

Autodesk.AutoCAD.Geometry.Surface.ParameterOf(Autodesk.AutoCAD.Geometry.Point3d)
Returns the 2D point of parameter values of the point on the surface.
point: Point on surface.
Returns: The 2D point of parameter values of the point on the surface.

Autodesk.AutoCAD.Geometry.Surface.ParameterOf(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the 2D point of parameter values of the point on the surface.
point: Point on surface.
tolerance: Tolerance.
Returns: The 2D point of parameter values of the point on the surface.

Autodesk.AutoCAD.Geometry.Surface.IsOn(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point2d)
Returns true if the point point is on the surface. In this case returns the parameters of the point point on surface in the output argument parameterPoint.
point: Point on surface.
parameterPoint: Output parameter point.
Returns: true if the point point is on the surface.

Autodesk.AutoCAD.Geometry.Surface.IsOn(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the point point is on the surface. In this case returns the parameters of the point point on surface in the output argument parameterPoint.
point: Point on surface.
parameterPoint: Output parameter point.
tolerance: Tolerance.
Returns: true if the point point is on the surface.

Autodesk.AutoCAD.Geometry.Surface.ClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d)
Returns the point on this surface that is closest to the point point.
point: Point on surface.
Returns: The point on this surface that is closest to the point point.

Autodesk.AutoCAD.Geometry.Surface.ClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the point on this surface that is closest to the point point.
point: Point on surface.
tolerance: Tolerance.
Returns: The point on this surface that is closest to the point point.

Autodesk.AutoCAD.Geometry.Surface.DistanceTo(Autodesk.AutoCAD.Geometry.Point3d)
Returns the minimal distance between this surface and the point point.
point: Point on surface.
Returns: The minimal distance between this surface and the point point.

Autodesk.AutoCAD.Geometry.Surface.DistanceTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the minimal distance between this surface and the point point.
point: Point on surface.
tolerance: Tolerance.
Returns: The minimal distance between this surface and the point point.

Autodesk.AutoCAD.Geometry.Surface.IsClosedInU
Indicates whether the surface is closed in the u direction or not.
Returns: true if the surface is closed in the u direction.

Autodesk.AutoCAD.Geometry.Surface.IsClosedInU(Autodesk.AutoCAD.Geometry.Tolerance)
Indicates whether the surface is closed in the u direction or not.
tolerance: Tolerance.
Returns: true if the surface is closed in the u direction.

Autodesk.AutoCAD.Geometry.Surface.IsClosedInV
Indicates whether the surface is closed in the v direction or not.
Returns: true if the surface is closed in the v direction.

Autodesk.AutoCAD.Geometry.Surface.IsClosedInV(Autodesk.AutoCAD.Geometry.Tolerance)
Indicates whether the surface is closed in the v direction or not.
tolerance: Tolerance.
Returns: true if the surface is closed in the v direction.

Autodesk.AutoCAD.Geometry.Surface.EvaluatePoint(Autodesk.AutoCAD.Geometry.Point2d)
Evaluator.Returns the point corresponding to the parameter point parameter.
parameter: Parameter point.
Returns: The point corresponding to the parameter point parameter.

Autodesk.AutoCAD.Geometry.Surface.{dtor}
