Autodesk.AutoCAD.DatabaseServices.Layout
Stores characteristics of each paperspace layout. Layout objects are stored in a DBDictionary object with an ACAD_LAYOUT key, allowing easy iteration and indexing.

Autodesk.AutoCAD.DatabaseServices.Layout.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Layout.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Layout.TabSelected
Gets a boolean indicating whether the layout tab is included in the selection set for operations that affect multiple tabs. The user can perform multiple selection via the user interface using shift-click.

Autodesk.AutoCAD.DatabaseServices.Layout.TabOrder
Gets or sets the tab order field, which controls the order in which the layouts are displayed in the tab control that is docked to the bottom of the viewport. The tab order should be unique and sequential for each layout in the database.

Autodesk.AutoCAD.DatabaseServices.Layout.LayoutName
Gets or sets the user-friendly layout name that is displayed in the tab control. Currently there is no restriction on the name except that the length of the name is limited to 256 characters.

Autodesk.AutoCAD.DatabaseServices.Layout.BlockTableRecordId
Gets or sets a back pointer to the Layout's associated BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.Layout.AddToLayoutDictionary(Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds the layout to the specified database's layout dictionary, and specifies the block table record to use.
toWhichDatabase: Database to which to add the layout.
blockTableRecordId: Block table record to use.

Autodesk.AutoCAD.DatabaseServices.Layout.GetViewports
Returns an array of ObjectIds of all the Viewports that exist in the Layout's paperspace. The first ID in the list will be the paperspace viewport.
Returns: An array of ObjectIds of all the Viewports that exist in the Layout's paperspace.

Autodesk.AutoCAD.DatabaseServices.Layout.{dtor}
