Autodesk.AutoCAD.Geometry.Matrix2dInfo
Encapsulates the data returned by the Matrix2d.IsConformal() ObjectARX method.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.Reflex
Gets reflection direction of the matrix.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.IsMirror
Gets a boolean indicating whether there is a mirror component to matrix.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.Angle
Gets angle of rotation of the matrix.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.Scale
Gets scale factor of the matrix.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.ToString(System.IFormatProvider)


Autodesk.AutoCAD.Geometry.Matrix2dInfo.ToString


Autodesk.AutoCAD.Geometry.Matrix2dInfo.Equals(System.Object)


Autodesk.AutoCAD.Geometry.Matrix2dInfo.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix2dInfo)


Autodesk.AutoCAD.Geometry.Matrix2dInfo.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix2dInfo,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.Geometry.Matrix2dInfo.GetHashCode


Autodesk.AutoCAD.Geometry.Matrix2dInfo.op_Inequality(Autodesk.AutoCAD.Geometry.Matrix2dInfo,Autodesk.AutoCAD.Geometry.Matrix2dInfo)


Autodesk.AutoCAD.Geometry.Matrix2dInfo.op_Equality(Autodesk.AutoCAD.Geometry.Matrix2dInfo,Autodesk.AutoCAD.Geometry.Matrix2dInfo)
