Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfiguration
Surface/surface intersection configuration.These values categorize the neighborhood of a surface just to the left or right of the surface/surface intersection curve with respect to the other surface. Inside (outside) means that the neighborhood is inside (outside) the other surface with respect to the surface normal orientation of the other surface. The surface neighborhoods left and right of a curve on a surface are with respect to its surface normal orientation and the direction of the curve parameterization.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfiguration.Unknown


Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfiguration.Coincident
Non-zero area intersection.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfiguration.In
Neighborhood is inside the surface.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfiguration.Out
Neighborhood is outside the surface.