Autodesk.AutoCAD.Runtime.Exception
Provides a container for an ObjectARX ErrorStatus enumerator value.

Autodesk.AutoCAD.Runtime.Exception.#ctor(Autodesk.AutoCAD.Runtime.ErrorStatus,System.String,System.Exception)


Autodesk.AutoCAD.Runtime.Exception.#ctor(Autodesk.AutoCAD.Runtime.ErrorStatus,System.String)


Autodesk.AutoCAD.Runtime.Exception.#ctor(Autodesk.AutoCAD.Runtime.ErrorStatus)


Autodesk.AutoCAD.Runtime.Exception.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Runtime.Exception.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)


Autodesk.AutoCAD.Runtime.Exception.ErrorStatus


Autodesk.AutoCAD.Runtime.Exception.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
