Autodesk.AutoCAD.DatabaseServices.SymbolTable
SymbolTable is the base class for all of the classes used to export AutoCAD's built-in symbol tables.

Autodesk.AutoCAD.DatabaseServices.SymbolTable.IncludingErased


Autodesk.AutoCAD.DatabaseServices.SymbolTable.Item(System.String)
Gets ObjectId of record with name key.
key: Name of record to search for.
Returns: ObjectId of record with name key.

Autodesk.AutoCAD.DatabaseServices.SymbolTable.Has(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the table contains a record with an ObjectId that matches id.
id: Object ID of record to search for.
Returns: true if the table contains a record with an ObjectId that matches id.

Autodesk.AutoCAD.DatabaseServices.SymbolTable.Has(System.String)
Returns true if the table contains a record with a name that matches key.
key: Name of record to search for.
Returns: true if the table contains a record with a name that matches key.

Autodesk.AutoCAD.DatabaseServices.SymbolTable.Add(Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord)
Adds the record defined by value to both the database containing the table and the table itself. If the addition succeeds, the ObjectId of the value returned once it's been added to the database.
value: Record to add to the table.
Returns: The ObjectId of the value.

Autodesk.AutoCAD.DatabaseServices.SymbolTable.GetEnumerator
Gets an enumerator that can be used to iterate through the contents of the SymbolTable.
Returns: An enumerator that can be used to iterate through the contents of the SymbolTable.

Autodesk.AutoCAD.DatabaseServices.SymbolTable.{dtor}
