Autodesk.AutoCAD.GraphicsInterface.EdgeModel
Describes the overall model to use for display of the edges of drawables.

Autodesk.AutoCAD.GraphicsInterface.EdgeModel.FacetEdges
Display facet edges, the edges between adjoining facets.

Autodesk.AutoCAD.GraphicsInterface.EdgeModel.NoEdges
No edges will be displayed.

Autodesk.AutoCAD.GraphicsInterface.EdgeModel.Isolines
Display Isolines, imaginary lines (edges), which represent the curvature and shape of a drawable.