Autodesk.AutoCAD.DatabaseServices.SectionHeight
Height flags for section plane.

Autodesk.AutoCAD.DatabaseServices.SectionHeight.HeightBelowSectionLine
Height of the section plane below the section line - from the section plane elevation to the bottom line of the section plane.

Autodesk.AutoCAD.DatabaseServices.SectionHeight.HeightAboveSectionLine
Height of the section plane above section line - from the section plane elevation to the top line of the section plane.