Autodesk.AutoCAD.DatabaseServices.HyperLink
Contains the hyperlink name (for example, http://www.cnn.com), a sublocation within that link, and the hyperlink description or friendly name (for example, "Click here for CNN").

Autodesk.AutoCAD.DatabaseServices.HyperLink.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.HyperLink.NestedLevel
Gets the nesting level of the associated entity.

Autodesk.AutoCAD.DatabaseServices.HyperLink.IsOutermostContainer
Gets true if the hyperlink is associated with the outermost container.

Autodesk.AutoCAD.DatabaseServices.HyperLink.DisplayString
Gets the hyperlink display string.

Autodesk.AutoCAD.DatabaseServices.HyperLink.SubLocation
Gets or sets the hyperlink sublocation. A sublocation is a specific target name within the named hyperlink.

Autodesk.AutoCAD.DatabaseServices.HyperLink.Description
Gets or sets the hyperlink description (or friendly name).

Autodesk.AutoCAD.DatabaseServices.HyperLink.Name
Gets or sets the hyperlink name.

Autodesk.AutoCAD.DatabaseServices.HyperLink.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.HyperLink.GetHashCode


Autodesk.AutoCAD.DatabaseServices.HyperLink.{dtor}
