Autodesk.AutoCAD.DatabaseServices.MeasurementValue
The units of Measurement.

Autodesk.AutoCAD.DatabaseServices.MeasurementValue.Metric
The units of Measurement is metric.

Autodesk.AutoCAD.DatabaseServices.MeasurementValue.English
The units of Measurement is English.