Autodesk.AutoCAD.DatabaseServices.Database
Represents the AutoCAD drawing file. Each Database object contains the various symbol tables, table records, entities, and objects that make up the drawing.

Autodesk.AutoCAD.DatabaseServices.Database.#ctor(System.Boolean,System.Boolean)
Default constructor.
buildDefaultDrawing: Boolean specifying whether or not to build an empty object.
noDocument: Boolean specifying whether or not to associate this database to the current document.

Autodesk.AutoCAD.DatabaseServices.Database.#ctor
Default constructor.The same as calling Database(true,false).

Autodesk.AutoCAD.DatabaseServices.Database.StepSize
Gets or sets the current STEPSIZE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.StepsPerSec
Gets or sets the current STEPSPERSEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.CameraDisplay
Gets or sets true if camera should be displayed and false otherwise.

Autodesk.AutoCAD.DatabaseServices.Database.LensLength
Gets or sets the value of LENSLENGTH system variable.

Autodesk.AutoCAD.DatabaseServices.Database.CameraHeight
Gets or sets the value of CAMERAHEIGHT system variable.This value is used as the default when creating new cameras.

Autodesk.AutoCAD.DatabaseServices.Database.LayerFilters
Gets or sets the LayerFilterManager for the given database.

Autodesk.AutoCAD.DatabaseServices.Database.DrawOrderCtl
Gets or sets the value of the DRAWORDERCTL system variable, which enables users to revert to legacy draw order mode if required. This system variable is per drawing in order to be consistent with SORTENTS.

Autodesk.AutoCAD.DatabaseServices.Database.SummaryInfo
Gets or sets the Summary Info data in its persistent data format in the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimzin
Gets or sets the current DIMZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimupt
Gets or sets the current DIMUPT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtzin
Gets or sets the current DIMZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtxt
Gets or sets the current DIMTXT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtxsty
Gets or sets the object ID of the TextStyle specified by the current DIMTXSTY value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtvp
Gets or sets the current DIMTVP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtsz
Gets or sets the current DIMTSZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtp
Gets or sets the current DIMTP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtolj
Gets or sets the current DIMTOLJ value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtol
Gets or sets the current DIMTOL value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtoh
Gets or sets the current DIMTOH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtofl
Gets or sets the current DIMTOFL value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtmove
Gets or sets the current DIMTMOVE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtm
Gets or sets the current DIMTM value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtix
Gets or sets the current DIMTIX value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtih
Gets or sets the current DIMTIH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtfillclr
Gets or sets the current dimension background color (if dimtfill is set to 1).

Autodesk.AutoCAD.DatabaseServices.Database.Dimtfill
Gets or sets the dimension background color state.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtfac
Gets or sets the current DIMTFAC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtdec
Gets or sets the current DIMTDEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtad
Gets or sets the current DIMTAD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsoxd
Gets or sets the current DIMSOXD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimse2
Gets or sets the current DIMSE2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimse1
Gets or sets the current DIMSE1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsd2
Gets or sets the current DIMSD2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsd1
Gets or sets the current DIMSD1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimscale
Gets or sets the current DIMSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsah
Gets or sets the current DIMSAH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimrnd
Gets or sets the current DIMRND value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlwe
Gets or sets the current DIMLWE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlwd
Gets or sets the current DIMLWD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlunit
Gets or sets the current DIMLUNIT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimltype
Gets or sets the the dimension linetype.

Autodesk.AutoCAD.DatabaseServices.Database.Dimltex2
Gets or sets the object ID of the linetype of extension line 2.

Autodesk.AutoCAD.DatabaseServices.Database.Dimltex1
Gets or sets the object ID of the linetype of extension line 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlim
Gets or sets the current DIMLIM value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlfac
Gets or sets the current DIMLFAC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimldrblk
Gets or sets the object ID of the block reference specified by the current DIMLDRBLK value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimjust
Gets or sets the current DIMJUST value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimjogang
Gets or sets the current large radial angle.

Autodesk.AutoCAD.DatabaseServices.Database.Dimgap
Gets or sets the current DIMGAP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimfxlen
Gets or sets the fixed extension lines value.

Autodesk.AutoCAD.DatabaseServices.Database.DimfxlenOn
Gets or sets a value that indicates whether the fixed extension lines are on.

Autodesk.AutoCAD.DatabaseServices.Database.Dimfrac
Gets or sets the current DIMFRAC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimexo
Gets or sets the current DIMEXO value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimexe
Gets or sets the current DIMEXE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimdsep
Gets or sets the current DIMSEP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimdli
Gets or sets the current DIMDLI value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimdle
Gets or sets the current DIMDLE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimdec
Gets or sets the current DIMDEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimclrt
Gets or sets the current DIMCLRT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimclre
Gets or sets the current DIMCLRE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimclrd
Gets or sets the current DIMCLRD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimcen
Gets or sets the current DIMCEN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimazin
Gets or sets the current DIMAZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaunit
Gets or sets the current DIMAUNIT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimatfit
Gets or sets the current DIMATFIT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimasz
Gets or sets the current DIMASZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimarcsym
Gets or sets the arc length placement value.

Autodesk.AutoCAD.DatabaseServices.Database.Dimapost
Gets or sets the character string that is the current DIMAPOST value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaltz
Gets or sets the current DIMALTZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaltu
Gets or sets the current DIMALTU value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimalttz
Gets or sets the current DIMALTTZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimalttd
Gets or sets the current DIMALTTD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaltrnd
Gets or sets the current DIMALTRND value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaltf
Gets or sets the current DIMALTF value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaltd
Gets or sets the current DIMALTD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimalt
Gets or sets the current DIMALT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimadec
Gets or sets the current DIMADEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.AcadDatabase
Gets the database for the specified object.

Autodesk.AutoCAD.DatabaseServices.Database.dragvs
Gets or sets the the visual style set in the DRAGVS system variable.

Autodesk.AutoCAD.DatabaseServices.Database.LightGlyphDisplay
Gets or sets whether light objects are displayed in the viewport.

Autodesk.AutoCAD.DatabaseServices.Database.NorthDirection
Gets or sets An angle representing a direction towards North, based on the orientation of the drawing model in the WCS.

Autodesk.AutoCAD.DatabaseServices.Database.Longitude
Gets or sets the longitude for the location of the model, in decimal degrees. Allowable values are -180 to +180 degrees, where positive numbers represent East longitudes.

Autodesk.AutoCAD.DatabaseServices.Database.Latitude
Gets or sets the latitude for the location of the model, in decimal degrees. Allowable values are -90 to +90 degrees, where positive numbers represent North latitudes.

Autodesk.AutoCAD.DatabaseServices.Database.AllowExtendedNames
Gets or sets the bool value of the specified database's EXTNAMES system variable.

Autodesk.AutoCAD.DatabaseServices.Database.IntersectColor
Gets or sets the INTERSECTIONCOLOR header variable value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.IntersectDisplay
Gets or sets the INTERSECTIONDISPLAY header variable value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ObscuredLineType
Gets or sets the current OBSCUREDLINETYPE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ObscuredColor
Gets or sets the current OBSCUREDCOLOR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.HaloGap
Gets or sets the current HALOGAP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.HideText
Gets or sets the current HIDETEXT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.DimAssoc
Gets or sets the current DIMASSOC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.SortEnts
Gets or sets the current SORTENTS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.DwgFileWasSavedByAutodeskSoftware
Gets or sets true if it determines that the database was last saved by Autodesk software (such as AutoCAD or AutoCAD LT).

Autodesk.AutoCAD.DatabaseServices.Database.ViewportScaleDefault
Gets or sets the database's default value for viewport scale.

Autodesk.AutoCAD.DatabaseServices.Database.PlotStyleMode
Gets or sets true when this database is using color-dependent plot styles, and false for named plot styles.

Autodesk.AutoCAD.DatabaseServices.Database.Insunits
Gets or sets the current INSUNITS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.TstackSize
Gets or sets the database's TSTACKSIZE value.

Autodesk.AutoCAD.DatabaseServices.Database.TStackAlign
Gets or sets the database's TSTACKALIGN value.

Autodesk.AutoCAD.DatabaseServices.Database.VersionGuid
Gets or sets the database to use a copy of string as the Version GUID for the database.

Autodesk.AutoCAD.DatabaseServices.Database.FingerprintGuid
Gets or sets the database's fingerprintguid header variable to be a copy of the string.

Autodesk.AutoCAD.DatabaseServices.Database.IsPartiallyOpened
Gets or sets true if the database is in a partially opened state; false otherwise.

Autodesk.AutoCAD.DatabaseServices.Database.Filename
Gets the filename associated with this database, if any.

Autodesk.AutoCAD.DatabaseServices.Database.StyleSheet
Gets or sets the database to use a copy of the string as the plot style sheet for the database.

Autodesk.AutoCAD.DatabaseServices.Database.HyperlinkBase
Gets or sets the database to use a copy of path as the new value for the HYPERLINKBASE header variable.

Autodesk.AutoCAD.DatabaseServices.Database.ProjectName
Gets or sets the database to use a copy of the string as the new PROJECTNAME header variable value.

Autodesk.AutoCAD.DatabaseServices.Database.Dimblk2
Gets or sets the object ID of the block reference specified by the current DIMBLK2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimblk1
Gets or sets the object ID of the block reference specified by the current DIMBLK1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimblk
Gets or sets the object ID of the block reference specified by the current DIMBLK value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimpost
Gets or sets the character string that is the current DIMPOST value for the datatbase.

Autodesk.AutoCAD.DatabaseServices.Database.UcsOrthographic
Gets false if the database's model space UCS does not have an orthographic view whose reference UCS matches the database's UCSBASE system variable.

Autodesk.AutoCAD.DatabaseServices.Database.UcsBase
Gets or sets the object ID of the UcsTableRecord that defines the origin and orientation of orthographic UCS settings for the database's model space.

Autodesk.AutoCAD.DatabaseServices.Database.Ucsname
Gets the object ID of the UCS table entry that is currently in use in the Model Space of the database; that is, the Model Space value of UCSNAME.

Autodesk.AutoCAD.DatabaseServices.Database.Ucsydir
Gets a Vector3d, which is the current Model Space UCSYDIR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Ucsxdir
Gets a Vector3d, which is the current Model Space UCSXDIR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Ucsorg
Gets a Point3d, which is the current Model Space UCSORG value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Elevation
Gets or sets the current Model Space ELEVATION value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Limmax
Gets or sets a Point2d (in WCS coordinates), which is the current Model Space LIMMAX value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Limmin
Gets or sets a Point2d (in WCS coordinates), which is the current Model Space LIMIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Extmax
Gets or sets a Point3d, which is the current Model Space EXTMAX value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Extmin
Gets or sets a Point3d, which is the current Model Space EXTMIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Insbase
Gets or sets a Point3d, which is the current Model Space INSBASE value for the database. The point is in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Database.PucsOrthographic
Gets false if the database's paper space UCS does not have an orthographic view whose reference UCS matches the database's PUCSBASE system variable.

Autodesk.AutoCAD.DatabaseServices.Database.PucsBase
Gets or sets the object ID of the UcsTableRecord that defines the origin and orientation of orthographic UCS settings for the database's current paper space.

Autodesk.AutoCAD.DatabaseServices.Database.Pucsname
Gets the object ID of the UCS table entry that is currently in use in the Paper Space of the database (Paper Space value of UCSNAME).

Autodesk.AutoCAD.DatabaseServices.Database.Pucsydir
Gets a Vector3d, which is the current Paper Space UCSYDIR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pucsxdir
Gets a Vector3d, which is the current Paper Space UCSXDIR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pucsorg
Gets a Point3d, which is the current Paper Space UCSORG value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pelevation
Gets or sets the current Paper Space ELEVATION value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Plimmax
Gets or sets a Point2d (in WCS coordinates), which is the current Paper Space LIMMAX value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Plimmin
Gets or sets a Point2d (in WCS coordinates), which is the current Paper Space LIMMIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pextmax
Gets or sets a Point3d, which is the current Paper Space EXTMAX value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pextmin
Gets or sets a Point3d, which is the current Paper Space EXTMIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pinsbase
Gets or sets a Point3d, which is the current Paper Space INSBASE value for the database. The point is in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Database.Celtscale
Gets or sets the current CELTSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Cmlscale
Gets or sets the current CMLSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Cmljust
Gets or sets the current CMLJUST value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.CmlstyleID
Gets or sets the object ID of the MlineStyle specified by the current CMLSTYLEID value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Interferecolor
Gets or sets the color for interfernce objects as defined by the INTERFERECOLOR system variable.

Autodesk.AutoCAD.DatabaseServices.Database.Interferevpvs
Gets or sets the visual style for for the viewport while checking for interference objects as defined by the INTERFEREVPVS system variable.

Autodesk.AutoCAD.DatabaseServices.Database.Interfereobjvs
Gets or sets the visual style for interference objects as defined by the INTERFEREOBJVS system variable.

Autodesk.AutoCAD.DatabaseServices.Database.Tablestyle
Gets or sets the object ID of the table style specified by the current CTABLESTYLE value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimstyle
Gets or sets the object ID of the dimstyle specified by the current DIMSTYLE value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.DimstyleData
Gets or sets the DimstyleData property value.

Autodesk.AutoCAD.DatabaseServices.Database.Celtype
Gets or sets the object ID of the linetype specified by the current CELTYPE value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Textstyle
Gets or sets the object ID of the TextStyle specified by the current TEXTSTYLE value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.PlotStyleNameId
Gets or sets object ID of the entry in the PlotStyleName dictionary that is the current entity's plot style.

Autodesk.AutoCAD.DatabaseServices.Database.Handseed
Gets or sets the current HANDSEED value for the database. The HANDSEED is a counter which maintains the next available handle number. Handles are 64-bit integers represented in DXF and LISP/ADS in hexadecimal form as a string. In hexadecimal, a 64-bit integer can be up to 16 digits.

Autodesk.AutoCAD.DatabaseServices.Database.Cecolor
Gets or sets the current CECOLOR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tdusrtimer
Gets a System.TimeSpan object which contains the current TDUSRTIMER value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tdindwg
Gets a System.TimeSpan which contains the current TDINDWG value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tduupdate
Gets the database's TDUUPDATE value.

Autodesk.AutoCAD.DatabaseServices.Database.Tducreate
Gets the database's TDUCREATE value.

Autodesk.AutoCAD.DatabaseServices.Database.Tdupdate
Gets a System.DateTime object which contains the current TDUPDATE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tdcreate
Gets the database's TDUCREATE value.

Autodesk.AutoCAD.DatabaseServices.Database.Menu
Gets a copy of the character string that is the current MENUNAME value for the database. The application is responsible for deleting the string memory.

Autodesk.AutoCAD.DatabaseServices.Database.Facetres
Gets or sets the current FACETRES value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Chamferd
Gets or sets the current CHAMFERD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Chamferc
Gets or sets the current CHAMFERC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Chamferb
Gets or sets the current CHAMFERB value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Chamfera
Gets or sets the current CHAMFERA value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Userr5
Gets or sets the current USERR5 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Userr4
Gets or sets the current USERR4 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Userr3
Gets or sets the current USERR3 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Userr2
Gets or sets the current USERR2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Userr1
Gets or sets the current USERR1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Plinewid
Gets or sets the current PLINEWID value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pdsize
Gets or sets the current PDSIZE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Angbase
Gets or sets the current ANGBASE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.OleStartUp
Gets or sets the database's OLESTARTUP header variable value.

Autodesk.AutoCAD.DatabaseServices.Database.XrefEditEnabled
Gets or sets the database's XEDIT value.

Autodesk.AutoCAD.DatabaseServices.Database.LineWeightDisplay
Gets or sets true if line weight display is on or false if line weight display is off.

Autodesk.AutoCAD.DatabaseServices.Database.JoinStyle
Gets or sets Lineweight joint setting for new objects, which may be one of the following: JoinStyle.None, JoinStyle.Round, JoinStyle.Angle, JoinStyle.Flat.

Autodesk.AutoCAD.DatabaseServices.Database.EndCaps
Gets or sets Lineweight endcaps setting for new objects. Possible values are EndCap.None, EndCap.Round, EndCap.Angle, or EndCap.Square.

Autodesk.AutoCAD.DatabaseServices.Database.Celweight
Gets or sets a LineWeight value indicating what the current line weight is for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Thickness
Gets or sets the current THICKNESS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Filletrad
Gets or sets the current FILLETRAD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Sketchinc
Gets or sets the current SKETCHINC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tracewid
Gets or sets the current TRACEWID value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Textsize
Gets or sets the current TEXTSIZE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Ltscale
Gets or sets the current LTSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Isolines
Gets or sets the current ISOLINES value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Maxactvp
Gets or sets the current MAXACTVP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Unitmode
Gets or sets the current UNITMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Measurement
Gets or sets the current MEASUREMENT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Shadedif
Gets or sets the current SHADEDIF value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Shadedge
Gets or sets the current SHADEDGE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Splinetype
Gets or sets the current SPLINETYPE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Surftab2
Gets or sets the current SURFTAB2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Surftab1
Gets or sets the current SURFTAB1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Surftype
Gets or sets the current SURFTYPE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Surfv
Gets or sets the current SURFV value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Surfu
Gets or sets the current SURFU value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Splinesegs
Gets or sets the current SPLINESEGS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Useri5
Gets or sets the current USERI5 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Useri4
Gets or sets the current USERI4 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Useri3
Gets or sets the current USERI3 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Useri2
Gets or sets the current USERI2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Useri1
Gets or sets the current USERI1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pdmode
Gets or sets the current PDMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Attmode
Gets or sets the current ATTMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Auprec
Gets or sets the current AUPREC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Aunits
Gets or sets the current AUNITS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Luprec
Gets or sets the current LUPREC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Lunits
Gets or sets the current LUNITS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Treedepth
Gets or sets the current TREEDEPTH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Visretain
Gets or sets the current VISRETAIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Plimcheck
Gets or sets the current Paper Space LIMCHECK value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Worldview
Gets or sets the current WORLDVIEW value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Mirrtext
Gets or sets the current MIRRTEXT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Splframe
Gets or sets the current SPLFRAME value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Angdir
Gets or sets the current ANGDIR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Skpoly
Gets or sets the current SKPOLY value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Usrtimer
Gets or sets the current USRTIMER value for the database. A value of false is off. A value of true is on.

Autodesk.AutoCAD.DatabaseServices.Database.PlineEllipse
Gets or sets the current PELLIPSE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.DispSilh
Gets or sets the current DISPSILH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Saveproxygraphics
Gets or sets the current PROXYGRAPHICS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Limcheck
Gets or sets the current Model Space LIMCHECK value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Psltscale
Gets or sets the current PSLTSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Qtextmode
Gets or sets the current QTEXTMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Fillmode
Gets or sets the current FILLMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Regenmode
Gets or sets the current REGENMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Orthomode
Gets or sets the current ORTHOMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Plinegen
Gets or sets the current PLINEGEN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsho
Gets or sets the current DIMSHO value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaso
Gets or sets the current DIMASO value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.SecurityParameters
Gets or sets a SecurityParameters struct that lists the security settings in effect for the database. If no security-related operations have been set for the database, the return value is null.

Autodesk.AutoCAD.DatabaseServices.Database.IsEmr
Gets true if this drawing database was created by a version of AutoCAD meant for an educational institution instead of a standard AutoCAD version.

Autodesk.AutoCAD.DatabaseServices.Database.RetainOriginalThumbnailBitmap
Gets or sets the status of the thumbnail bitmap toggle flag.

Autodesk.AutoCAD.DatabaseServices.Database.ThumbnailBitmap
Gets or sets the thumbnail bitmap image.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBlockId
Gets the object ID of the BlockTableRecord which refers to this database as an xref.

Autodesk.AutoCAD.DatabaseServices.Database.MaintenanceReleaseVersion
Gets which point release of AutoCAD created this database.

Autodesk.AutoCAD.DatabaseServices.Database.FileDependencyManager
Gets the FileDependencyManager object for the database.

Autodesk.AutoCAD.DatabaseServices.Database.UndoRecording
Gets true if undo recording is enabled for the database.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileSavedByMaintenanceVersion
Gets the maintenance version value of the last AutoCAD product which saved the drawing file, not counting the current session.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileMaintenanceVersion
Gets the maintenance version value that the database file had when it was first opened.

Autodesk.AutoCAD.DatabaseServices.Database.LastSavedAsMaintenanceVersion
Gets the maintenance version that the current drawing was last saved as in the current session. If the current session has not yet done a save on this drawing, then it gets zero.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileSavedByVersion
Gets the version value of the last AutoCAD product which saved the drawing file, not counting the current session.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileVersion
Gets the version value that the database file had when it was first opened.

Autodesk.AutoCAD.DatabaseServices.Database.LastSavedAsVersion
Gets the version that the current drawing was last saved as in the current session. If the current session has not yet done a save on this drawing, then it gets zero.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileName
Gets the file name that the database was originally opened under. May return a null if the database was created from a DXF file or a pre-R13 drawing file.

Autodesk.AutoCAD.DatabaseServices.Database.NumberOfSaves
Gets number of times the database has been saved in the current session, or zero if it has not been saved in the current session.

Autodesk.AutoCAD.DatabaseServices.Database.ApproxNumObjects
Gets a value that is at least as large as the number of objects in the database.

Autodesk.AutoCAD.DatabaseServices.Database.SectionManagerId
Gets  the object ID of the section manager. The ID may be null if the database has never contained any section planes since it's creation.

Autodesk.AutoCAD.DatabaseServices.Database.TableStyleDictionaryId
Gets the object ID of the table style dictionary in named object dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.CurrentSpaceId
Gets the object ID of the BlockTableRecord of the current space (e.g., model space or paper space.).

Autodesk.AutoCAD.DatabaseServices.Database.PaperSpaceVportId
Gets the object ID of the paperspace Viewport for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ByBlockLinetype
Gets the object ID of the BYBLOCK LinetypeTableRecord for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ByLayerLinetype
Gets the object ID of the BYLAYER LinetypeTableRecord for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ContinuousLinetype
Gets the object ID of the continuous linetype LinetypeTableRecord for the database.

Autodesk.AutoCAD.DatabaseServices.Database.LayerZero
Gets the object ID of the layer 0 LayerTableRecord for the database.

Autodesk.AutoCAD.DatabaseServices.Database.PlotSettingsDictionaryId
Gets the object ID of the ACAD_PLOTSETTINGS dictionary, which contains objects of type PlotSettings. The Plot Settings dictionary holds the set of named plot settings that the user has created for this drawing.

Autodesk.AutoCAD.DatabaseServices.Database.NamedObjectsDictionaryId
Gets the object ID of the database's NamedObjects dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.ColorDictionaryId
Gets the object ID of the database's color dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.VisualStyleDictionaryId
Gets the object ID of the ACAD_VISUALSTYLE dictionary, which contains objects of type VisualStyle.

Autodesk.AutoCAD.DatabaseServices.Database.MaterialDictionaryId
Gets the object ID of the ACAD_MATERIAL dictionary, which contains objects of type Material.

Autodesk.AutoCAD.DatabaseServices.Database.PlotStyleNameDictionaryId
Gets the object ID of the database's plot style name dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.LayoutDictionaryId
Gets the object ID of the ACAD_LAYOUT dictionary, which contains objects of type Layout. The Layout dictionary stores characteristics of each Paper Space layout.

Autodesk.AutoCAD.DatabaseServices.Database.GroupDictionaryId
Gets the object ID of the database's Group dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.MLStyleDictionaryId
Gets the object ID of the database's MLStyle dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.DimStyleTableId
Gets the object ID of the database's DimStyleTable.

Autodesk.AutoCAD.DatabaseServices.Database.RegAppTableId
Gets the object ID of the database's RegAppTable.

Autodesk.AutoCAD.DatabaseServices.Database.ViewportTableId
Gets the object ID of the database's ViewportTable.

Autodesk.AutoCAD.DatabaseServices.Database.UcsTableId
Gets the object ID of the database's UCSTable.

Autodesk.AutoCAD.DatabaseServices.Database.ViewTableId
Gets the object ID of the database's ViewTable.

Autodesk.AutoCAD.DatabaseServices.Database.TextStyleTableId
Gets the object ID of the database's TextStyleTable.

Autodesk.AutoCAD.DatabaseServices.Database.BlockTableId
Gets the object ID of the database's BlockTable.

Autodesk.AutoCAD.DatabaseServices.Database.Clayer
Gets or sets the object ID of the LAYER specified by the current CLAYER value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.TileMode
Gets or sets the current TILEMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.LayerStateManager
Gets the current LayerStateManager object.

Autodesk.AutoCAD.DatabaseServices.Database.TransactionManager
Gets the TransactionManager for the database.

Autodesk.AutoCAD.DatabaseServices.Database.LinetypeTableId
Gets the object ID of the database's LinetypeTable.

Autodesk.AutoCAD.DatabaseServices.Database.LayerTableId
Gets the object ID of the database's LayerTable.

Autodesk.AutoCAD.DatabaseServices.Database.GetVisualStyleList
Returns a list containing the localized names of the visual styles defined in the visual style dictionary. Anonymous visual styles and visual styles marked for internal use only are excluded from this list.
Returns: Array of visual style names.

Autodesk.AutoCAD.DatabaseServices.Database.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
Copies the dimension variable information in style into the database on which this method is called, making those dimension variable values current for the database.
style: DimStyleTableRecord from which to copy dimension variable information.

Autodesk.AutoCAD.DatabaseServices.Database.GetDimstyleData
Copies the database dimension variable values into the return DimStyleTableRecord.
Returns: DbDimStyleTableRecord to which the dimension variable data will be copied.

Autodesk.AutoCAD.DatabaseServices.Database.GetDimensionStyleChildData(Autodesk.AutoCAD.Runtime.RXClass)
Given a dimension class descriptor, this method returns the child dimension style data and dimension style ID, if available, for the given dimension type.
classDescriptor: dimension class descriptor.
Returns: A DimStyleTableRecord to be filled with child data.

Autodesk.AutoCAD.DatabaseServices.Database.GetDimensionStyleChildId(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Given a parent dimension style ID and a dimension class descriptor, this method returns the child dimension style ID, if available, for the given dimension type.
classDescriptor: Dimension class descriptor.
parentStyle: Parent dimension style ID.
Returns: The child dimension style ID.

Autodesk.AutoCAD.DatabaseServices.Database.GetDimensionStyleParentId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Given a child dimension style ID, this method returns the parent dimension style ID. If the parent is unavailable, the given child dimension style ID is returned.
childStyle: Child dimension style ID.
Returns: The parent dimension style ID.

Autodesk.AutoCAD.DatabaseServices.Database.WorldPaperspaceUcsBaseOrigin(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Returns the database's paperspace "default" UCS origin point (in WCS coordinates) for the view specified by orthoView.
orthoView: Desired view.
Returns: The database's paperspace "default" UCS origin point (in WCS coordinates) .

Autodesk.AutoCAD.DatabaseServices.Database.SetWorldPaperspaceUcsBaseOrigin(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets origin to be the new paperspace "default" UCS origin point for the view specified by orthoView.
origin: New origin point in WCS coordinat.
orthoView: View for which base point is desired.

Autodesk.AutoCAD.DatabaseServices.Database.UpdateExt(System.Boolean)
Iterates through all the entities in the database's Model Space and updates the database's Model Space extents variables EXTMAX and EXTMIN to the values determined during the iteration.
doBestFit: Determines whether to generate the tightest bounding box.

Autodesk.AutoCAD.DatabaseServices.Database.WorldUcsBaseOrigin(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Returns the database's model space "default" UCS origin point (in WCS coordinates) for the view specified by orthoView.
orthoView: View for which base point is desired.
Returns: The database's model space "default" UCS origin point (in WCS coordinates).

Autodesk.AutoCAD.DatabaseServices.Database.SetWorldUcsBaseOrigin(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets origin to be the new model space "default" UCS origin point for the view specified by orthoView..
origin: New origin point in WCS coordinates .
orthoView: View for which base point is desired.

Autodesk.AutoCAD.DatabaseServices.Database.GetDimRecentStyleList
Allows the application to get the object ID entities of the most recently used dimstyles (up to 6) for dimension context menu dimstyle MRU list support. Most recently used dimstyle objects are tracked by monitoring the past six dimstyle objects that were current in the database.
Returns: Array of up to six object ID entities of the most recently used dimstyle of DimStyleTableRecord objects.

Autodesk.AutoCAD.DatabaseServices.Database.LoadLineTypeFile(System.String,System.String)
Loads the linetype specified by ltn from the file specified by filename and stores it in the database on which this method is called.
lineTypeName: Linetype name string (wild cards may be used).
filename: Path/filename or URL of linetype file to load from (path is optional).

Autodesk.AutoCAD.DatabaseServices.Database.ApplyPartialOpenFilters(Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter,Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter)
Can be called on a database to filter its model space entities to only bring part of the drawing into memory.
spatialFilter: Specifies the model space volume to be used for spatial filtering.
layerFilter: Specifies the layers to be used for filtering.

Autodesk.AutoCAD.DatabaseServices.Database.DisablePartialOpen
When called during partial open notification, this method vetoes the partial open operation and causes the entire drawing database to be loaded.

Autodesk.AutoCAD.DatabaseServices.Database.GetViewports(System.Boolean)
Enumerates the Viewports in a drawing. These are the viewports in layouts, in other words, tilemode 0.
bGetPaperspaceVports: Flag indicating whether to return paperspace viewports associated with layouts.
Returns: Array of object IDs for the viewports in the database.

Autodesk.AutoCAD.DatabaseServices.Database.FromAcadDatabase(System.Object)
Gets the .NET database object from the COM database object.
acadDatabase: The COM database object.
Returns: The .NET database object.

Autodesk.AutoCAD.DatabaseServices.Database.AddDBObject(Autodesk.AutoCAD.DatabaseServices.DBObject)
Adds the object appendIt to the database, giving it a handle and an object ID.
appendIt: Object to be added to the database.
Returns: New object ID obtained by this method.

Autodesk.AutoCAD.DatabaseServices.Database.MarkObjectNonPersistent(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Marks an object non-persistent or persistent.
id: ID of the object to be modified.
value: True to make the object non-persistent, or false to make it persistent.

Autodesk.AutoCAD.DatabaseServices.Database.IsObjectNonPersistent(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the object denoted by id is non-persistent. Otherwise, returns false.
id: ID of the object to be interrogated.
Returns: true if the object denoted by id is non-persistent.

Autodesk.AutoCAD.DatabaseServices.Database.Purge(Autodesk.AutoCAD.DatabaseServices.ObjectIdGraph)
Looks for references between the objects passed in so that it does not need to be called multiple times. In other words, if a Layer and a Linetype are passed in, and the only reference to the Linetype is from the Layer, then the graph returned will indicate that both the Layer and the Linetype can be purged.
idGraph: Graph of objects in the database. The graph will be returned containing only those objects that may safely be removed from the database.

Autodesk.AutoCAD.DatabaseServices.Database.Purge(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Searches through the database to see if there are any hard references to objects with object ID entities in the ids array. If any such objects are found, their object ID entities are removed from the ids array.
ids: Array of object ID entities of objects.

Autodesk.AutoCAD.DatabaseServices.Database.CountHardReferences(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32[])
Traverses the database looking for objects with a hard reference to any of the objects whose objectId entities are in the ids array. Each time such a hard reference is found, the count will be incremented by 1 within the element of count that corresponds to the ids element of the objectId that is being hard referenced.
ids: Array of objectId enitities of objects to find the count of hard references to those objects.
count: Array of the same size as ids that will be filled in with the counts for each corresponding element in ids.

Autodesk.AutoCAD.DatabaseServices.Database.GetObjectId(System.Boolean,Autodesk.AutoCAD.DatabaseServices.Handle,System.Int32)
Fills in return value with the objectId of the object that has the handle value contained in objHandle.
createIfNotFound: Boolean indicating to create a objectId stub if input handle is not found.
objHandle: Handle object containing the handle being passed in.
identifier: Reserved for future use.
Returns: ObjectId value obtained by this method.

Autodesk.AutoCAD.DatabaseServices.Database.ClassDxfName(Autodesk.AutoCAD.Runtime.RXClass)
For AutoCAD internal use only.
getMyDxfName: .
Returns: Internal use only.

Autodesk.AutoCAD.DatabaseServices.Database.ReadDwgFile(System.IntPtr,System.Boolean,System.String)
For internal use only.
drawingFile: For internal use only.
allowCPConversion: For internal use only.
password: For internal use only.

Autodesk.AutoCAD.DatabaseServices.Database.ReadDwgFile(System.String,System.IO.FileShare,System.Boolean,System.String)
Reads the drawing file specified by fileName into the database object.
fileName: Name or URL of file to read.
fileSharing: Share mode.
allowCPConversion: Boolean indicating whether to allow codepage conversion.
password: A string containing a DWG password.

Autodesk.AutoCAD.DatabaseServices.Database.SaveAs(System.String,Autodesk.AutoCAD.DatabaseServices.DwgVersion)
Saves the Database object to a DWG file whose name is fileName. The file is saved in version format.
fileName: Name of file to which the database is saved.
version: The version of the file.

Autodesk.AutoCAD.DatabaseServices.Database.SaveAs(System.String,Autodesk.AutoCAD.DatabaseServices.SecurityParameters)
Saves the Database object to a DWG file whose name is fileName.
fileName: Name of file to which the database is saved.
security: Security operations requested during reading DWG file.

Autodesk.AutoCAD.DatabaseServices.Database.DxfIn(System.String,System.String)
Reads the DXF file specified into the database object.
fileName: Full path of the DXF file to be read into database.
logFilename: Log file to record all warning/error messages from reading the DXF file.

Autodesk.AutoCAD.DatabaseServices.Database.DxfOut(System.String,System.Int32,Autodesk.AutoCAD.DatabaseServices.DwgVersion)
Creates an DXF file.
fileName: Name or URL of the new DXF file to create (the .dxf extension is not added automatically).
precision: Number of bits of accuracy, from 0 to 16.
saveThumbnailImage: Boolean indicating whether to save thumbnail.

Autodesk.AutoCAD.DatabaseServices.Database.DxfOut(System.String,System.Int32,System.Boolean)
Creates an DXF file.
fileName: Name or URL of the new DXF file to create (the .dxf extension is not added automatically).
precision: Number of bits of accuracy, from 0 to 16.
version: Version of the DXF file.

Autodesk.AutoCAD.DatabaseServices.Database.CloseInput(System.Boolean)
If a drawing file is associated with this database, then this method forces an immediate read of all necessary information from the file into the database object.
closeFile: Boolean indicating whether to close the drawing file.

Autodesk.AutoCAD.DatabaseServices.Database.ResolveXrefs(System.Boolean,System.Boolean)
Resolves existing xrefs in the host database.
useThreadEngine: Boolean indicating whether to use the thread engine for xref resolution.
doNewOnly: Boolean indicating whether to process only newly added xrefs.

Autodesk.AutoCAD.DatabaseServices.Database.AttachXref(System.String,System.String)
Attaches the Xref file specified by filename to the database, thus creating a new Xref BlockTableRecord.
fileName: Xref file path name.
blockName: Xref block name symbol to use.
Returns: Object ID of the attached Xref block.

Autodesk.AutoCAD.DatabaseServices.Database.OverlayXref(System.String,System.String)
Overlays the Xref file specified by filename to the database, thus creating a new Xref BlockTableRecord.
fileName: Xref file path name.
blockName: Xref block name symbol to use.
Returns: Object ID of the attached Xref block.

Autodesk.AutoCAD.DatabaseServices.Database.DetachXref(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Detaches the Xref in Database whose BlockTableRecord is specified by xrefId.
xrefId: Oject ID of the xref block to detach.

Autodesk.AutoCAD.DatabaseServices.Database.GetHostDwgXrefGraph(System.Boolean)
Returns with a completed graph of xrefs in the database.
includeGhosts: Boolean indicating whether to include ghosts in the graph.
Returns: A completed graph of xrefs.

Autodesk.AutoCAD.DatabaseServices.Database.LoadMlineStyleFile(System.String,System.String)
Loads the MlineStyle specified by mlineStyleName from the file specified by fileName.
mlineStyleName: MlineStyle name string (no wild cards).
fileName: Path/filename or URL of file to load from (path is optional).

Autodesk.AutoCAD.DatabaseServices.Database.GetSupportedSaveVersions
Returns an array of DwgVersion values indicating what file versions are supported for SaveAs operations.
Returns: An array of DwgVersion values.

Autodesk.AutoCAD.DatabaseServices.Database.GetSupportedDxfOutVersions
Returns an array of DwgVersion values indicating what file versions are supported for DxfOut operations.
Returns: An array of DwgVersion values.

Autodesk.AutoCAD.DatabaseServices.Database.Wblock
Creates a new Database object,and then uses the WblockClone mechanism to write the entire contents of the database on which this method is being called out to the new database.
Returns: The database that was written to.

Autodesk.AutoCAD.DatabaseServices.Database.Wblock(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Creates a new Database object. The new object then uses the WblockClone mechanism to write the contents of the BlockTableRecord, specified by blockId, out to the Model Space of the database.
blockId: Object ID of BlockTableRecord to write out.
Returns: The database that was written to.

Autodesk.AutoCAD.DatabaseServices.Database.Wblock(Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.DuplicateRecordCloning)
Uses the WblockClone() mechanism to write the array of objects specified by outObjIds to the model space block table record of the database pointed to by outputDataBase, using basePoint as the base point value for outputDataBase.
outputDataBase: An existing Database.
outObjIds: Array of object IDs of all objects to be wblocked out.
basePoint: Base point (in WCS coordinates for pOutputDb) to be used in outputDataBase.
cloning: .

Autodesk.AutoCAD.DatabaseServices.Database.Wblock(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.Geometry.Point3d)
Creates a new Database object,and then uses the WblockClone mechanism to write the array of objects specified by outObjIds entities out to the Model Space block table record of the database, using basePoint as the base point value for the database.
outObjIds: Array of objectId entities of all objects to be wblocked out.
basePoint: Base point (in WCS coordinates for pOutputDb) to be used in the return database.
Returns: The database that was written to.

Autodesk.AutoCAD.DatabaseServices.Database.ForceWblockDatabaseCopy
Causes the next (and only the next) Database.Wblock() call on this database to result in a copy of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Insert(System.String,System.String,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Creates a new block table record in the database.
sourceBlockName: Name of the blockTableRecord.
destinationBlockName: Name to be used by the new block table record created by this method.
dataBase: Database from which to insert entities.
preserveSourceDatabase: Bool to determine whether the source database dataBase is left intact.
Returns: Object ID for the new block table record created by this method.

Autodesk.AutoCAD.DatabaseServices.Database.Insert(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Inserts the Model Space of the database dataBase into the Model Space of the database invoking the Insert() method. All objects being inserted have the transform matrix passed into their TransformBy() method during the insertion process.
transform: Transformation matrix applied to all objects being inserted.
dataBase: Database to insert from.
preserveSourceDatabase: Determine whether the source database dataBase will be left intact.

Autodesk.AutoCAD.DatabaseServices.Database.Insert(System.String,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Mimics the AutoCAD INSERT command. First a new block table record is created in the database executing this method. This new block table record is given the name blockName and the return value is filled in with its object ID. Then, all the Model Space entities in the database dataBase are copied into the new block table record.
blockName: Name to be used by the new block table record created by this method.
dataBase: database to insert entities from.
preserveSourceDatabase: Determine whether the source database dataBase will be left intact.
Returns: Object ID for the new block table record created by this method.

Autodesk.AutoCAD.DatabaseServices.Database.DeepCloneObjects(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.IdMapping,System.Boolean)
Clones all objects in the objectId array and appends them to the container object specified by id.
identifiers: Array of objects to be deep cloned.
id: Object ID of object to be the owner of the clones.
mapping: Array of IdMapping objects to be used for translating object ID relationships.
deferTranslation: Boolean indicating whether or not ID translation should be done.

Autodesk.AutoCAD.DatabaseServices.Database.WblockCloneObjects(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.IdMapping,Autodesk.AutoCAD.DatabaseServices.DuplicateRecordCloning,System.Boolean)
Clones all objects in the objectIds array and appends them to the container object specified by id. The objects can be from multiple source databases, and must match the type of owner supplied, but must be from a different database than the id object.
identifiers: Array of objects to be deep cloned.
id: Object ID of object to be the owner of the clones.
mapping: Array of IdMapping objects to be used for translating object ID relationships.
cloning: Action for duplicate records.
deferTranslation: Boolean indicating whether or not ID translation should be done.

Autodesk.AutoCAD.DatabaseServices.Database.AbortDeepClone(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Triggers an event that the DeepClone operation identified by idMap has been aborted.
idMap: Used in the DeepClone operation being aborted.

Autodesk.AutoCAD.DatabaseServices.Database.Audit(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
Currently not implemented.
info: Not implemented.

Autodesk.AutoCAD.DatabaseServices.Database.AuditXData(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
Currently not implemented.
info: Not implemented.

Autodesk.AutoCAD.DatabaseServices.Database.DisableUndoRecording(System.Boolean)
Turns Undo recording on or off for operations performed on the database.
disable: Boolean indicating turn Undo on or off.

Autodesk.AutoCAD.DatabaseServices.Database.RestoreOriginalXrefSymbols
Undoes all the changes the database did during its resolve, so that the database is now in the same condition it was when it was first read in from its file.

Autodesk.AutoCAD.DatabaseServices.Database.RestoreForwardingXrefSymbols
Literally redoes all the changes back to a proper Xref resolve status.

Autodesk.AutoCAD.DatabaseServices.Database.IsValidLineWeight(System.Int32)
Returns true for lineweights that match one of the predefined lineweights, and false otherwise.
weight: Lineweight in hundredths of a millimeter.
Returns: True for lineweights that match one of the predefined lineweights.

Autodesk.AutoCAD.DatabaseServices.Database.GetNearestLineWeight(System.Int32)
Takes a lineweight and returns the nearest LineWeight enum value.
weight: Lineweight in hundredths of a millimeter.
Returns: Nearest LineWeight enum value.

Autodesk.AutoCAD.DatabaseServices.Database.XrefSubCommandAborted
This notification is sent if the Xref subcommand is aborted.

Autodesk.AutoCAD.DatabaseServices.Database.XrefPreXrefLockFile
Notification just before an Xref is locked.

Autodesk.AutoCAD.DatabaseServices.Database.XrefSubCommandStart
Sends notification on the start of an Xref subcommand.

Autodesk.AutoCAD.DatabaseServices.Database.Disposed
This notification occurs when the DWG database is about to be deleted.

Autodesk.AutoCAD.DatabaseServices.Database.ProxyResurrectionCompleted
Invoked when the loading of an ObjectARX or ObjectDBX module resurrects proxy objects in the DWG database.

Autodesk.AutoCAD.DatabaseServices.Database.SystemVariableChanged
Indicates that an attempt was made to change the system variable.

Autodesk.AutoCAD.DatabaseServices.Database.SystemVariableWillChange
Indicates that an attempt is being made to change the system variable.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectErased
Invoked when a DBObject object is being erased or unerased from a Database.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectModified
Invoked after a DBObject object has been modified.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectOpenedForModify
Invoked before a DBObject object has been modified.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectReappended
Occurs when a DBObject has had its addition to the Database dwg undone during an Undo operation and has now been reappended to the database due to an execution of the AutoCAD REDO command.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectUnappended
Occurs when a DBObject object has its addition to the Database dwg undone by an Undo operation.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectAppended
Invoked when a DBObject object is added to any Database.

Autodesk.AutoCAD.DatabaseServices.Database.XrefRestoreEnded
Indicates that the Xref was previously unloaded, and now has been reloaded, but its file has not changed.

Autodesk.AutoCAD.DatabaseServices.Database.XrefRestoreAborted
Indicates that a restore operation on the drawing database was terminated and did not complete.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBeginRestore
Indicates that the Xref was previously unloaded, and now is to be reloaded, but its file has not changed. Instead of loading another copy of the file into memory, the previous settings of the Xref are restored.

Autodesk.AutoCAD.DatabaseServices.Database.XrefComandeered
Indicates that an object is commandeered, meaning that the objectId of the object is appended to the host drawing's (the drawing being XREFd into) symbol table.

Autodesk.AutoCAD.DatabaseServices.Database.XrefRedirected
Indicates that an objectId is redirected, meaning that an objectId in the xref drawing is modified to point to the associated object in the host drawing (the drawing being XREFd into).

Autodesk.AutoCAD.DatabaseServices.Database.XrefAttachEnded
Indicates that an external reference attach operation has been performed to the drawing Database, and has completed successfully.

Autodesk.AutoCAD.DatabaseServices.Database.XrefAttachAborted
Indicates that an external reference attach operation was performed to the drawing Database, and terminated before successful completion. This can be caused by the user canceling the operation, or by an error such as an invalid file, or path specification.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBeginOtherAttached
Indicates that an external reference is added to the database.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBeginAttached
Indicates that the external reference database is to be attached to the database.

Autodesk.AutoCAD.DatabaseServices.Database.PartialOpenNotice
All loaded DBX applications that add an event will get a notification just before an attempt to partially open a Database.

Autodesk.AutoCAD.DatabaseServices.Database.DeepCloneEnded
Indicates that the deep clone operation concluded successfully.

Autodesk.AutoCAD.DatabaseServices.Database.DeepCloneAborted
Indicates that the deep clone operation terminated.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDeepCloneTranslation
A deep clone operation has two stages. First, each object and any owned objects are cloned. Second, any object ID references are translated to their cloned IDs. This event is fired between these two stages.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDeepClone
Indicates that a deep clone operation is starting on the drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockObjects
Indicates that a WblockObjects operation is starting on the drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.WblockEnded
Indicates that a wblock being performed to the drawing Database completed successfully.

Autodesk.AutoCAD.DatabaseServices.Database.WblockAborted
Indicates that a wblock being performed to the drawing Database was terminated and did not complete.

Autodesk.AutoCAD.DatabaseServices.Database.WblockMappingAvailable
Indicates that a wblock operation is being performed on the drawing database as the target.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockEntireDatabase
Indicates that a wblock operation is being performed. This is triggered by a WBLOCK* or when the equivalent of Database.Wblock() is called.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockBlock
Indicates that a wblock operation is being performed.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockSelectedObjects
Gives WblockCloneObjects() a way for applications to receive a call before each new database before any actual cloning began.

Autodesk.AutoCAD.DatabaseServices.Database.WblockNotice
Indicates that a wblock operation is about to start.

Autodesk.AutoCAD.DatabaseServices.Database.InsertEnded
Usually indicates that an insert operation on the drawing database is complete. However, in some cases, the transform has not yet happened, or the block that was created has not yet been appended. This means the objects copied are not yet graphical, which also means that you cannot use them in selection sets until the CommandEnded event is received.

Autodesk.AutoCAD.DatabaseServices.Database.InsertAborted
Indicates that an insert operation on the drawing database was terminated and did not complete.

Autodesk.AutoCAD.DatabaseServices.Database.InsertMappingAvailable
Indicates that the drawing database has been added and idMap contains a mapping of all the original objects in the drawing database to all the objects which have been copied.

Autodesk.AutoCAD.DatabaseServices.Database.BeginInsert
Indicates that the drawing database is being added and the transformation matrix is applied on the inserted data. It is triggered by the INSERT* command, or if the equivalent of Database.Insert() is called.

Autodesk.AutoCAD.DatabaseServices.Database.DxfOutComplete
Indicates that the DXF output operation taking place on the drawing database was successful.

Autodesk.AutoCAD.DatabaseServices.Database.AbortDxfOut
Indicates that the DXF output operation taking place on the drawing database was terminated and was not successful.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDxfOut
Indicates that the drawing database is about to be output in a DXF output operation.

Autodesk.AutoCAD.DatabaseServices.Database.DxfInComplete
Indicates that the drawing database was successfully modified by a DXF input operation.

Autodesk.AutoCAD.DatabaseServices.Database.AbortDxfIn
Indicates that the drawing database was being modified by a DXF input operation, but that the operation was terminated before completion.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDxfIn
Indicates that the drawing database is about to be altered by a DXF input operation.

Autodesk.AutoCAD.DatabaseServices.Database.AbortSave
Indicates that the drawing database was not saved, and the save operation failed.

Autodesk.AutoCAD.DatabaseServices.Database.SaveComplete
Indicates that the drawing database was saved.

Autodesk.AutoCAD.DatabaseServices.Database.BeginSave
Indicates that the drawing database is about to be saved.

Autodesk.AutoCAD.DatabaseServices.Database.DatabaseToBeDestroyed
Indicates that the drawing database is about to be destroyed (that is, it's being deleted from memory).

Autodesk.AutoCAD.DatabaseServices.Database.DatabaseConstructed
Indicates that the Database constructor has finished.

Autodesk.AutoCAD.DatabaseServices.Database.InitialDwgFileOpenComplete
Is sent at the completion of the initial load of a drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.DwgFileOpened
Indicates that the drawing file is being read and stored in the drawing database.

Autodesk.AutoCAD.DatabaseServices.Database.{dtor}
