Autodesk.AutoCAD.GraphicsInterface.FaceColorMode
Describes modifications that affect the color of a face before any lighting and shading (face style) calculations have been performed.

Autodesk.AutoCAD.GraphicsInterface.FaceColorMode.Desaturate
Apply a desaturation percentage to the diffuse color of a material.

Autodesk.AutoCAD.GraphicsInterface.FaceColorMode.Tint
All faces have the hue and saturation values of their color mapped to the hue and saturation values of a specific color, resulting in a "tinted" effect. The luminance value remains unchanged.

Autodesk.AutoCAD.GraphicsInterface.FaceColorMode.Mono
All faces are treated as having a specific color, resulting in a "monochromatic" effect.

Autodesk.AutoCAD.GraphicsInterface.FaceColorMode.BackgroundColor
Apply the display background color to the faces.

Autodesk.AutoCAD.GraphicsInterface.FaceColorMode.ObjectColor
Apply the color of the drawable object to the faces of the object.

Autodesk.AutoCAD.GraphicsInterface.FaceColorMode.None
No modifications are to be applied to the faces.