Autodesk.AutoCAD.Runtime.WrapperAttribute
Defines an attribute that identifies the corresponding wrapped ObjectARX class or member.

Autodesk.AutoCAD.Runtime.WrapperAttribute.#ctor(System.String)


Autodesk.AutoCAD.Runtime.WrapperAttribute.WrappedClass
