Autodesk.AutoCAD.DatabaseServices.Region
Represent region entities in AutoCAD.

Autodesk.AutoCAD.DatabaseServices.Region.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Region.NumChanges
Gets the number of changes that have occurred to this region since it was first created.

Autodesk.AutoCAD.DatabaseServices.Region.Normal
Gets the normal vector of the region.

Autodesk.AutoCAD.DatabaseServices.Region.IsNull
Gets true if the region has no ShapeManager object within itself.

Autodesk.AutoCAD.DatabaseServices.Region.Body
For internal use only.

Autodesk.AutoCAD.DatabaseServices.Region.Area
Gets the surface area of the region. The area is in square drawing units.

Autodesk.AutoCAD.DatabaseServices.Region.Perimeter
Gets the perimeter length (in drawing units) of the region.

Autodesk.AutoCAD.DatabaseServices.Region.CreateFromCurves(Autodesk.AutoCAD.DatabaseServices.DBObjectCollection)
Creates a set of Region objects from the closed loops represented by the curves contained in the curveSegments array.
curveSegments: Array of curve entities used to define the region's perimeter(s).
Returns: The newly created region objects.

Autodesk.AutoCAD.DatabaseServices.Region.BooleanOperation(Autodesk.AutoCAD.DatabaseServices.BooleanOperationType,Autodesk.AutoCAD.DatabaseServices.Region)
Performs Boolean operation between this region and otherRegion.
operation: Type of Boolean operation.
otherRegion: Another region to perform the Boolean operation.

Autodesk.AutoCAD.DatabaseServices.Region.{dtor}
