Autodesk.AutoCAD.Geometry.Position2d
Represents a point in 2D space.

Autodesk.AutoCAD.Geometry.Position2d.#ctor(System.Double,System.Double)
Constructs a 2D position object that has the specified coordinates.
x: X coordinate.
y: Y coordinate.

Autodesk.AutoCAD.Geometry.Position2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d)
Constructs a 2D position object with the same coordinates as the input point.
point: Any 2D point object.

Autodesk.AutoCAD.Geometry.Position2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Position2d.Set(System.Double,System.Double)
Changes the coordinates of the 2D position object to the input coordinates.
x: X coordinate.
y: Y coordinate.

Autodesk.AutoCAD.Geometry.Position2d.Set(Autodesk.AutoCAD.Geometry.Point2d)
Changes the coordinates of the 2D position object to have the same coordinates as the input point.
point: Any 2D point object.

Autodesk.AutoCAD.Geometry.Position2d.{dtor}
