Autodesk.AutoCAD.GraphicsInterface.DiagnosticBSPMode
The available types of BSP information to visualize with the BSP diagnostic mode.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticBSPMode.Depth
BSP depth: the depth of the BSP tree reached.

Autodesk.AutoCAD.GraphicsInterface.DiagnosticBSPMode.Size
BSP leaf size: the leaf size in the BSP tree reached.