Autodesk.AutoCAD.DatabaseServices.LayerStateManager
Used to access and manipulate individual layer states associated with a drawing database.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Database association constructor.
database: Database to be used by the new layer state manager object.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStatesDictionaryId(System.Boolean)
Returns ObjectId of the layer states extension dictionary (within the layer table extension dictionary) or ObjectId(null) if the database is null, or if the symbol table is null, or if the layer table extension dictionary or the layer states extension dictionary is null (and createIfNotPresent is false), or if the layer table extension dictionary or layer states extension dictionary cannot be created (and createIfNotPresent is true), or if the layer table extension dictionary cannot be opened for read.
createIfNotPresent: Flag controlling dictionary creation.
Returns: ObjectId of the layer states extension dictionary.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.HasLayerState(System.String)
Checks if the layer state name is present and returns true if so.
name: Layer state name.
Returns: True if the layer state name is present.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.SetLayerStateMask(System.String,Autodesk.AutoCAD.DatabaseServices.LayerStateMasks)
Updates the mask used when restoring a layer state.
name: Name of layer state to mask.
mask: Mask to apply to layer state.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.GetLayerStateMask(System.String)
Gets the mask for the named layer state.
name: Layer state name.
Returns: Layer state mask.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.DeleteLayerState(System.String)
Deletes the specified layer state.
name: Layer state name to delete.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.RenameLayerState(System.String,System.String)
Renames the layer state name to be newName.
name: Existing layer state name.
newName: New layer state name.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.ImportLayerState(System.String)
Reads the passed-in filename (saved by a previous export) and extracts layer states to import.
fileName: File to extract layer states from.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.ExportLayerState(System.String,System.String)
Reads the passed-in layer state name and exports the corresponding layer state to the export file.
nameToExport: Layer state name to export.
fileName: Filename to export layer state to.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.SaveLayerState(System.String,Autodesk.AutoCAD.DatabaseServices.LayerStateMasks,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Saves the current state of the layer table to the layer state specified by name.
name: Name of layer state to save.
mask: Mask to apply to layer state.
id: Object ID of the viewport whose VPLAYER setting is to be captured.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.RestoreLayerState(System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32,Autodesk.AutoCAD.DatabaseServices.LayerStateMasks)
Restores the layer state name and the VPLAYER settings for the viewport specified. Also restores attributes specified in clientMask.
name: Name of layer state to make current.
id: Object ID of the viewport whose VPLAYER setting is to be updated with the viewport data stored.
undefinedLayerStatePolicy: Value that indicates whether to handle undefined layers.
clientMask: Layer attribute mask.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.SetLayerStateDescription(System.String,System.String)
Sets an arbitrary description string on the layer state.
name: Layer state whose description is to be updated.
description: Description string up to 255 characters.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.GetLayerStateDescription(System.String)
Retrieves the description set by SetLayerStateDescription().
name: Layer state whose description is to be retrieved.
Returns: Description string upon successful return.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateHasViewportData(System.String)
Returns a Boolean indicating whether the given layer state has viewport data associated with it.
name: Layer state to be interrogated.
Returns: A Boolean indicating whether the given layer state has viewport data associated with it.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.{dtor}
