Autodesk.AutoCAD.Geometry.NurbSurface
Represents generic NURB parametric surface.

Autodesk.AutoCAD.Geometry.NurbSurface.#ctor(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.KnotCollection)
Constructs a NURB surface defined by input data.
degreeU: U degree.
degreeV: V degree.
propsInU: U properties.
propertiesInV: V properties.
numberControlPointsInU: Number of control points in U direction.
numberControlPointsInV: Number of control points in V direction.
controlPoints: Array of control points.
weights: Array of weights.
knotsInU: U array of knots.
knotsInV: V array of knots.

Autodesk.AutoCAD.Geometry.NurbSurface.#ctor(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs a NURB surface defined by input data.
degreeU: U degree.
degreeV: V degree.
propsInU: U properties.
propertiesInV: V properties.
numberControlPointsInU: Number of control points in U direction.
numberControlPointsInV: Number of control points in V direction.
controlPoints: Array of control points.
weights: Array of weights.
knotsInU: U array of knots.
knotsInV: V array of knots.
tolerance: Tolerance.

Autodesk.AutoCAD.Geometry.NurbSurface.VKnots
Gets array of the V knots.

Autodesk.AutoCAD.Geometry.NurbSurface.NumKnotsInV
Gets V dimension of knot array.

Autodesk.AutoCAD.Geometry.NurbSurface.UKnots
Gets array of the U knots.

Autodesk.AutoCAD.Geometry.NurbSurface.NumKnotsInU
Gets U dimension of knot array.

Autodesk.AutoCAD.Geometry.NurbSurface.PeriodicInV


Autodesk.AutoCAD.Geometry.NurbSurface.PeriodicInU


Autodesk.AutoCAD.Geometry.NurbSurface.IsPeriodicInV
Gets flag indicating if surface is a periodic surface in U direction.

Autodesk.AutoCAD.Geometry.NurbSurface.IsPeriodicInU
Gets flag indicating if surface is a periodic surface in U direction.

Autodesk.AutoCAD.Geometry.NurbSurface.Weights
Gets array of the weights.

Autodesk.AutoCAD.Geometry.NurbSurface.ControlPoints
Gets array of surface's control points.

Autodesk.AutoCAD.Geometry.NurbSurface.NumControlPointsInV
Gets V dimension of control array.

Autodesk.AutoCAD.Geometry.NurbSurface.DegreeInV
Gets V degree of surface.

Autodesk.AutoCAD.Geometry.NurbSurface.NumControlPointsInU
Gets U dimension of control array.

Autodesk.AutoCAD.Geometry.NurbSurface.DegreeInU
Gets U degree of surface.

Autodesk.AutoCAD.Geometry.NurbSurface.SingularityInV
Gets a characterization of V singularity.

Autodesk.AutoCAD.Geometry.NurbSurface.SingularityInU
Gets a characterization of U singularity.

Autodesk.AutoCAD.Geometry.NurbSurface.IsRationalInV
Gets flag indicating if surface is a non-polynomial surface in V direction.

Autodesk.AutoCAD.Geometry.NurbSurface.IsRationalInU
Gets flag indicating if surface is a non-polynomial surface in U direction.

Autodesk.AutoCAD.Geometry.NurbSurface.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.NurbSurface.GetDefinition
Computes the surface definition data.
Returns: The surface definition data.

Autodesk.AutoCAD.Geometry.NurbSurface.Set(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.KnotCollection)
Changes surface definition to one specified by input data.
degreeU: U degree.
degreeV: V degree.
propsInU: U properties.
propertiesInV: V properties.
numberControlPointsInU: Number of control points in U direction.
numberControlPointsInV: Number of control points in V direction.
controlPoints: Array of control points.
weights: Array of weights.
knotsInU: U array of knots.
knotsInV: V array of knots.

Autodesk.AutoCAD.Geometry.NurbSurface.Set(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Changes surface definition to one specified by input data.
degreeU: U degree.
degreeV: V degree.
propsInU: U properties.
propertiesInV: V properties.
numberControlPointsInU: Number of control points in U direction.
numberControlPointsInV: Number of control points in V direction.
controlPoints: Array of control points.
weights: Array of weights.
knotsInU: U array of knots.
knotsInV: V array of knots.
tolerance: Tolerance.

Autodesk.AutoCAD.Geometry.NurbSurface.{dtor}
