Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord
This is the base class for each type of record corresponding to the various symbol tables.

Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord.IsResolved
Gets true if the SymbolTableRecord is part of an xref which has been successfully "resolved" (loaded into the drawing).

Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord.IsDependent
Gets true when the SymbolTableRecord is a dependent (that is, part of) of an attached xref drawing.

Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord.Name
Gets or sets the name of the SymbolTable record.

Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord.{dtor}
