Autodesk.AutoCAD.DatabaseServices.LayoutEventArgs
Provides data for various events of the LayoutManager class.

Autodesk.AutoCAD.DatabaseServices.LayoutEventArgs.Name
Gets the name of the layout that is changing.

Autodesk.AutoCAD.DatabaseServices.LayoutEventArgs.Id
Gets the object ID of the layout that is changing.