Autodesk.AutoCAD.GraphicsInterface.DrawableType
Indicates the type of a drawable object.By default the type on all drawables is Geometry.

Autodesk.AutoCAD.GraphicsInterface.DrawableType.Viewport
A viewport drawable.

Autodesk.AutoCAD.GraphicsInterface.DrawableType.GroundPlaneBackground
Drawable is a ground plane background.

Autodesk.AutoCAD.GraphicsInterface.DrawableType.ImageBackground
Drawable is a background filled with an image.

Autodesk.AutoCAD.GraphicsInterface.DrawableType.GradientBackground
Drawable is a gradient background controlled by three colors.

Autodesk.AutoCAD.GraphicsInterface.DrawableType.SolidBackground
Drawable is a background filled with solid color.

Autodesk.AutoCAD.GraphicsInterface.DrawableType.AmbientLight
Ambient light. Ambient light comes from all directions.

Autodesk.AutoCAD.GraphicsInterface.DrawableType.SpotLight
A spotlight source. Spotlights emit light in a specific direction.

Autodesk.AutoCAD.GraphicsInterface.DrawableType.PointLight
A point light source. Point lights emit light in all directions.

Autodesk.AutoCAD.GraphicsInterface.DrawableType.DistantLight
A distant light. Distant lights emit parallel light rays, with no attenuation ( or decay) of light intensity.

Autodesk.AutoCAD.GraphicsInterface.DrawableType.Geometry
Default type for all drawables.