Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags
Field code flags Enum.

Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags.TextField
If this flag is set, the field code is treated as text with embedded fields. This flag is not applicable when getting the field code, and will be ignored in that context.

Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags.PreserveFields
For internal use only. This flag is not applicable when getting the field code, and will be ignored in that context.

Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags.StripOptions
If this flag is set, the standard options like evaluator ID, format, and hyperlink information are stripped from the field code.

Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags.EscapeBackslash
If this flag is set, all the backslashes are escaped using another backslash (in other words, single backslashes are converted to double backslashes) in the evaluated text.

Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags.AddMarkers


Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags.ObjectReference
Gets the embedded fields in the text as references to child field objects stored in pChildFields argument. This flag is valid only for text fields and is used for editing. This flag is not applicable when setting the field code, and will be ignored in that context.

Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags.EvaluatedChildren
Gets the field code with evaluated text for children. This flag is combined with kFieldCode. This flag is not applicable when setting the field code, and will be ignored in that context.

Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags.EvaluatedText
Gets the evaluated text. This flag is not applicable when setting the field code, and will be ignored in that context.

Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags.FieldCode
Gets the raw field code. This flag is not applicable when setting the field code, and will be ignored in that context.