Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs
Provides data for the EntityAlignment event.

Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.#ctor(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])


Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.Direction


Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.ClosestPoint


Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.Normal


Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.PickPoint


Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.Entity


Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.GetPickedEntities
Returns an array containing the full subentity paths of the picked entities.
Returns: An array containing the full subentity paths of the picked entities.