Autodesk.AutoCAD.DatabaseServices.DBObjectReference
Contains an object's ID and the DXF group code that represents the object's type.

Autodesk.AutoCAD.DatabaseServices.DBObjectReference.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Constructor.
id: Autodesk.AutoCAD.DatabaseServices.ObjectId object.
kind: System.Int32 object.

Autodesk.AutoCAD.DatabaseServices.DBObjectReference.Kind
Gets the Kind property value.

Autodesk.AutoCAD.DatabaseServices.DBObjectReference.ObjectId
Gets the ObjectId property value.