Autodesk.AutoCAD.DatabaseServices.Sun
Container for all properties relating to a sun object. A sun exists as a hard-owned child of a ViewportTableRecord or a Viewport object.

Autodesk.AutoCAD.DatabaseServices.Sun.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Sun.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Sun.SunDirection
Gets or sets the direction (vector) of the sunlight, from the sun to the model.

Autodesk.AutoCAD.DatabaseServices.Sun.Azimuth
Internal use only.

Autodesk.AutoCAD.DatabaseServices.Sun.IsDaylightSavingsOn
Gets or sets the Daylight Savings On/Off option for the Sun Angle Calculator.

Autodesk.AutoCAD.DatabaseServices.Sun.DateTime
Gets or sets the date and the time for the Sun Angle Calculator.

Autodesk.AutoCAD.DatabaseServices.Sun.ShadowParameters
Gets or sets the shadow parameters: shadow type, mapsize, softness, and on/off.

Autodesk.AutoCAD.DatabaseServices.Sun.SunColor
Gets or sets the Sun's color.

Autodesk.AutoCAD.DatabaseServices.Sun.Intensity
Gets or sets the intensity of the Sun object.

Autodesk.AutoCAD.DatabaseServices.Sun.IsOn
Gets or sets the Sun's on/off state.

Autodesk.AutoCAD.DatabaseServices.Sun.{dtor}
