Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord
Represent records in the LinetypeTable. Each of these records contains the information about a linetype in the drawing database.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.#ctor
Default constructor. Initializes AsciiDescription, shape, and dash information to null and NumDashes and PatternLength to 0.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.IsScaledToFit
Gets or sets true if the bLinetypeTableRecord's alignment is scaled to fit (equivalent to an 'S' in the alignment field of the linetype definition) or false if the alignment is not scaled to fit (equivalent to an 'A' in the alignment field of the linetype definition).

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.NumDashes
Gets or sets the number of dashes in the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.PatternLength
Gets or sets the length (in AutoCAD drawing units--the pattern will appear this length when the linetype scale is 1.0) of the pattern in the LinetypeTableRecord. The pattern length is the total length of all dashes (including pen up spaces). Embedded shapes or text strings do not add to the pattern length because they are overlaid and do not interrupt the actual dash pattern.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.AsciiDescription
Gets or sets copy of description string.This property is obsolete and will be eliminated in a future release of ObjectARX. Please use Comments instead.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.Comments
Gets or sets the copy of comment string.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.DashLengthAt(System.Int32)
Returns the length (in AutoCAD drawing units--the dash will appear this length when the linetype scale is 1.0) of the index'th dash in the LinetypeTableRecord.
index: Index (0-based) of dash to get length of.
Returns: The length (in AutoCAD drawing units--the dash will appear this length when the linetype scale is 1.0) of the index'th dash in the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetDashLengthAt(System.Int32,System.Double)
Sets value to be the length (in AutoCAD drawing units--the dash will appear this length when the linetype scale is 1.0) of the index'th dash in the LinetypeTableRecord.
index: Index (0-based) of dash to set.
value: Length value for the dash.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeStyleAt(System.Int32)
Returns the ObjectId of the TextStyleTableRecord of the shape (or textStyle if it's a text string instead of a shape) at position index in the LinetypeTableRecord. If there is no shape or text at index, then ObjectId.Null is returned.
index: Index (0-based) of shape (or text string) to get.
Returns: The ObjectId of the TextStyleTableRecord of the shape (or textStyle if it's a text string instead of a shape) at position index in the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeStyleAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the LinetypeTableRecord to use value as the ObjectId of the TextStyleTableRecord for the shape (or textStyle if it's a text string instead of a shape) at position index. If there is to be no shape or text at index, then value should be ObjectId.Null.
index: Index at which to set the shape (or text string) scale.
id: Scale factor to be applied to the shape (or text string).

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeNumberAt(System.Int32)
Returns the shape number of the shape at position index in the LinetypeTableRecord. If there is no shape at index, then 0 is returned.
index: Index (0-based) of shape (or text string) to get.
Returns: The shape number of the shape at position index in the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeNumberAt(System.Int32,System.Int32)
Sets the index'th dash to embed the shape identified by shapeNumber (the shape's shapeNumber from its shape file). If no shape is to be used at index, then shapeNumber should be 0.
index: Index at which to set the shape.
shapeNumber: Shape identification number of the shape to use.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeOffsetAt(System.Int32)
Returns a Vector2d object whose X and Y coordinates represent the X and Y offsets of the shape (or text string) at position index in the LinetypeTableRecord. If there is no shape at index, then the X and Y components of the returned vector will be 0.0.
index: Index (0-based) of shape (or text string) to get.
Returns: A Vector2d object whose X and Y coordinates represent the X and Y offsets of the shape (or text string) at position index in the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeOffsetAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector2d)
Sets the LinetypeTableRecord to use the X and Y coordinates of offset as the X and Y offsets for the shape (or text string) at position index. If there is to be no shape at index, then the X and Y components of offset should be 0.0.
index: Index at which to set the shape (or text string) offset.
offset: Vector whose X and Y values are the WCS X and Y offsets for the shape.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeScaleAt(System.Int32)
Returns the scale factor of the shape (or text string) at position index in the LinetypeTableRecord. If there is no shape at index, then 1.0 is returned.
index: Index (0-based) of shape (or text string) to get.
Returns: The scale factor of the shape (or text string) at position index in the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeScaleAt(System.Int32,System.Double)
Sets the LinetypeTableRecord to use scale as the scale of the shape at position index. If there is to be no shape at index, then scale should be 1.0.
index: Index at which to set the shape (or text string) scale.
scale: Scale factor to be applied to the shape.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeIsUcsOrientedAt(System.Int32)
Returns true if the shape (or text string) at position index in the LinetypeTableRecord has the UcsOriented bit (bit 1) set in its shape flags.
index: Index (0-based) of shape (or text string) to get.
Returns: True if the shape (or text string) at position index in the LinetypeTableRecord has the UcsOriented bit (bit 1) set in its shape flags.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeIsUcsOrientedAt(System.Int32,System.Boolean)
Sets the UcsOriented bit (bit 1) for the shape (or text string) at position index in the LinetypeTableRecord.
index: Index (0-based) of shape (or text string) to get.
isOriented: Boolean indicates whether or not the shape is to be oriented relative to the current UCS.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeRotationAt(System.Int32)
Returns of the rotation angle (in radians) of the shape (or text string) at position index in the LinetypeTableRecord.
index: Index (0-based) of shape (or text string) to get.
Returns: The rotation angle (in radians) of the shape (or text string) at position index in the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeRotationAt(System.Int32,System.Double)
Sets the rotation angle (in radians) of the shape (or text string) at position index in the LinetypeTableRecord.
index: Index (0-based) of shape (or text string) to get.
rotation: Rotation angle for the shape (or text string).

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.TextAt(System.Int32)
Returns with text pointing to the text string at position index in the LinetypeTableRecord.
index: Index (0-based) of shape (or text string) to get.
Returns: The rotation angle (in radians) of the shape (or text string) at position index in the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetTextAt(System.Int32,System.String)
Sets the LinetypeTableRecord to use a copy of the string pointed to by text as the text string at position index.
index: Index at which to set the text string.
value: The text to use at index.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.{dtor}
