Autodesk.AutoCAD.GraphicsInterface.ProceduralTexture
This is an abstract class, serving as the base for various procedural material textures.

Autodesk.AutoCAD.GraphicsInterface.ProceduralTexture.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.ProceduralTexture.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.ProceduralTexture.{dtor}
