Autodesk.AutoCAD.DatabaseServices.GridLineType
Describes the grid lines of a table.

Autodesk.AutoCAD.DatabaseServices.GridLineType.VerticalRight
The grid line at the far right of the table.

Autodesk.AutoCAD.DatabaseServices.GridLineType.VerticalInside
All vertical grid lines, excluding the ones on the far left and far right of the table.

Autodesk.AutoCAD.DatabaseServices.GridLineType.VerticalLeft
The grid line at the far left of the table.

Autodesk.AutoCAD.DatabaseServices.GridLineType.HorizontalBottom
The top or bottom horizontal grid line of the table, depending on flow direction.

Autodesk.AutoCAD.DatabaseServices.GridLineType.HorizontalInside
All horizontal grid lines, excluding the top and bottom lines.

Autodesk.AutoCAD.DatabaseServices.GridLineType.HorizontalTop
The top or bottom horizontal grid line of the table, depending on flow direction.

Autodesk.AutoCAD.DatabaseServices.GridLineType.InvalidGridLine
Invalid.