Autodesk.AutoCAD.DatabaseServices.Curve
Base class for all the entity classes that are variations of a curve such as Arc, Circle, Ellipse, Spline, and others. This base class provides the common functionality such as finding parameters for a point on the curve, finding offset curves, finding projections of the curve onto a plane, and so on.

Autodesk.AutoCAD.DatabaseServices.Curve.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Curve.Area
Gets with area set to the area inside the curve. For the AutoCAD built-in classes, the curve must lie on a plane. If the curve is not closed, its start and end points are considered as connected by a line segment that closes it.

Autodesk.AutoCAD.DatabaseServices.Curve.Spline
Creates a new Spline entity, sets it to be as close an approximation as possible to the curve, and then returns with spline pointing to the newly created spline entity.

Autodesk.AutoCAD.DatabaseServices.Curve.EndPoint
Gets with EndPoint set to the end point (in WCS coordinates) of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.StartPoint
Gets with StartPoint set to the start point (in WCS coordinates) of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.EndParam
Gets with EndParam set to the parameter of the endpoint of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.StartParam
Gets with StartParam set to the start parameter on the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.IsPeriodic
Gets true if, and only if, the curve has an infinite range in both directions and there is a period value T such that there is a point on curve at (u + T) = point on curve (u), for any parameter u. If the curve is not periodic, then gets false.

Autodesk.AutoCAD.DatabaseServices.Curve.Closed
Gets true if, and only if, the curve is closed; that is, its start point is identical to its end point. Otherwise, it gets false.

Autodesk.AutoCAD.DatabaseServices.Curve.GetPointAtParameter(System.Double)
Determines the point on the curve that corresponds to the param parameter, and returns the point.
value: Parameter on the curve at which the point is desired.
Returns: The point on the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.GetParameterAtPoint(Autodesk.AutoCAD.Geometry.Point3d)
Determines the parameter of the curve at point and returns the parameter.
point: Point (in WCS coordinates) on the curve at which the parameter is desired.
Returns: The parameter of the curve at point.

Autodesk.AutoCAD.DatabaseServices.Curve.GetDistanceAtParameter(System.Double)
Calculates the length of the curve's segment from the curve's start point to the point specified by value.
value: Parameter specifying a point on curve.
Returns: The length of the curve's segment from the curve's beginning to the point specified by value.

Autodesk.AutoCAD.DatabaseServices.Curve.GetParameterAtDistance(System.Double)
Determines the parameter of the curve at the location that is a distance of dist along the curve from the curve start, and returns the parameter.
dist: Distance along the curve from the beginning of the curve to the location for the desired parameter.
Returns: Parameter at the location specified by dist.

Autodesk.AutoCAD.DatabaseServices.Curve.GetDistAtPoint(Autodesk.AutoCAD.Geometry.Point3d)
Calculates the length of the curve's segment between the curve's start point and point and returns the length.
point: Point(in WCS coordinates) on the curve.
Returns: The length of the curve's segment between the curve's start point and point.

Autodesk.AutoCAD.DatabaseServices.Curve.GetPointAtDist(System.Double)
Determines the point on the curve that is a distance of dist along the curve from the curve start, and returns the point.
value: Distance along the curve from the beginning of the curve to the location of the desired point.
Returns: The point located at the location specified by value.

Autodesk.AutoCAD.DatabaseServices.Curve.GetFirstDerivative(Autodesk.AutoCAD.Geometry.Point3d)
Evaluates the first derivative of the curve at point and returns the result, in both this class and derived classes. Both point and the return value are in WCS coordinates in derived classes.
point: Point on curve at which to find the first derivative.
Returns: The first derivative of the curve at point.

Autodesk.AutoCAD.DatabaseServices.Curve.GetFirstDerivative(System.Double)
Evaluate the first derivative at the location on the curve specified by value, and returns the result (in WCS coordinates).
value: Parameter of location on curve at which to find the first derivative.
Returns: The first derivative of the curve at value.

Autodesk.AutoCAD.DatabaseServices.Curve.GetSecondDerivative(Autodesk.AutoCAD.Geometry.Point3d)
Evaluates the second derivative of the curve at point and returns the result.
point: Point on the curve at which to find the second derivative.
Returns: The second derivative of the curve at point.

Autodesk.AutoCAD.DatabaseServices.Curve.GetSecondDerivative(System.Double)
Evaluates the second derivative at the location on the curve specified by value and returns the result(in WCS coordinates).
value: Parameter of location on the curve at which to find the second derivative.
Returns: The second derivative of the curve at value.

Autodesk.AutoCAD.DatabaseServices.Curve.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean)
Projects the curve onto the plane defined by givenPoint and direction, finds the point on the projected curve that is nearest to givenPoint, then projects this nearest point back onto the original curve and returns the nearest point.
givenPoint: Point (in WCS coordinates) for which to find nearest point on curve.
direction: Normal vector (in WCS coordinates) for plane to project onto.
extend: Boolean indicating whether or not to extend curve in search for nearest point.
Returns: The point (in WCS coordinates) on the curve that is nearest to givenPoint.

Autodesk.AutoCAD.DatabaseServices.Curve.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,System.Boolean)
Finds the point on the curve that is nearest to givenPoint.
givenPoint: Point (in WCS coordinates) for which to find nearest point on curve.
extend: Boolean indicating whether or not to extend curve in search for nearest point.
Returns: The point (in WCS coordinates) on the curve that is nearest to givenPoint.

Autodesk.AutoCAD.DatabaseServices.Curve.GetOrthoProjectedCurve(Autodesk.AutoCAD.Geometry.Plane)
Creates a new curve entity that is the result of projecting the curve along the planeToProjectOn's normal onto the planeToProjectOn and returns the newly created curve.
planeToProjectOn: Plane onto which the curve is to be projected.
Returns: The newly created projected curve.

Autodesk.AutoCAD.DatabaseServices.Curve.GetProjectedCurve(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d)
Creates a new curve entity that is the result of projecting the curve parallel to projectionDirection onto the planeToProjectOn and returns the newly created curve.
planeToProjectOn: Plane onto which the curve is to be projected.
projectionDirection: Direction (in WCS coordinates) of the projection.
Returns: The newly created projected curve.

Autodesk.AutoCAD.DatabaseServices.Curve.GetOffsetCurves(System.Double)
Creates one or more entities that together make up the result of offsetting the curve by the distance offsetDist. For many curves, the result is a single new curve. (This single new curve may not be of the same class as the original curve.For example, offsetting an Ellipse results in a Spline, since the result of offsetting an ellipse does NOT fit the equation of an ellipse.).
offsetDist: Distance to offset the curve.
Returns: An array of the resulting curve(s).

Autodesk.AutoCAD.DatabaseServices.Curve.GetOffsetCurvesGivenPlaneNormal(Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Creates one or more entities that, together, make up the result of offsetting the curve by the distance offsetDist in the plane with normal vector normal.
normal: Normal vector for plane in which to offset.
offsetDist: Distance to offset the curve.
Returns: An array of the resulting curve(s).

Autodesk.AutoCAD.DatabaseServices.Curve.GetSplitCurves(Autodesk.AutoCAD.Geometry.Point3dCollection)
Creates one or more entities that are all subcurves of the original.
points: Array of points (in WCS coordinates) on the curve.
Returns: Newly created entities that are subcurves of the original.

Autodesk.AutoCAD.DatabaseServices.Curve.GetSplitCurves(Autodesk.AutoCAD.Geometry.DoubleCollection)
Creates one or more entities that are all subcurves of the original.
value: Array of parameters on the curve.
Returns: Newly created entities that are subcurves of the original.

Autodesk.AutoCAD.DatabaseServices.Curve.Extend(System.Boolean,Autodesk.AutoCAD.Geometry.Point3d)
Extends the curve to the point toPoint (in WCS coordinates). If extendStart==true, then the curve's beginning is extended. If extendStart==false, then the curve's end is extended.
extendStart: Boolean indicating whether to extend the curve's start or end.
toPoint: New start or end point of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.Extend(System.Double)
Extends the beginning or end of the curve to the new point determined by the newParameter value.
newParameter: New start or end parameter on the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.{dtor}
