Autodesk.AutoCAD.DatabaseServices.HatchPatternType
AutoCAD hatch pattern types: User-defined, Predefined, and Custom.

Autodesk.AutoCAD.DatabaseServices.HatchPatternType.CustomDefined
A custom-defined pattern type stores the pattern in its own PAT file, in which the name of the hatch pattern must match the name of the file.

Autodesk.AutoCAD.DatabaseServices.HatchPatternType.PreDefined
A predefined pattern type allows you to select a hatch pattern from the AutoCAD standard hatch pattern file acad.pat in the "support" directory. The file contains many predefined hatch patterns, including ANGLE, ANSI31, BRICK, CLAY, etc. When you use a predefined pattern, you can also specify a scale and angle in order to modify the hatch's appearance.

Autodesk.AutoCAD.DatabaseServices.HatchPatternType.UserDefined
A user-defined pattern provides a direct method to define a simple hatch pattern using a specified hatch entity linetype.