Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection


Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId[])


Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Count
Gets the number of objects in the collection.
Returns: Returns a value representing the number of objects in the collection.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.RemoveAt(System.Int32)
Removes the element at the specified index of the collection.
index: The zero-based index of the element to remove.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.GetEnumerator
Gets an enumerator for the collection.
Returns: An enumerator that can be used to iterate through the collection.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Add(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds an object to the end of the collection.
value: The object to be added to the end of the collection. The value can be null.
Returns: The collection index at which the value has been added.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Determines whether an element is in the collection.
value: The object to search for in this collection.
Returns: true if the collection contains an object that matches value; otherwise, false.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the 0-based index of the collection item that matches value.
value: The object to search for in this collection.
Returns: The zero-based index of the collection item that matches value, or -1 if value does not exist in the collection.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Inserts an element into the collection at the specified index.
index: The zero-based index at which value should be inserted.
value: Element to be inserted in the collection.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)


Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.ObjectId[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.{dtor}
