Autodesk.AutoCAD.DatabaseServices.BlockBegin
Represents the block header portion of a block definition within AutoCAD (that is, group codes 2, 3, 10, 20, 30, and 70). Objects of this class are created and handled automatically by AutoCAD for each BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockBegin.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.BlockBegin.{dtor}
