Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsTraceParameter
This class is a container for the MentalRayRenderSettingsTraits.RayTraceDepth property.

Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsTraceParameter.#ctor(System.Int32,System.Int32,System.Int32)


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsTraceParameter.Sum


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsTraceParameter.Refraction


Autodesk.AutoCAD.GraphicsInterface.MentalRayRenderSettingsTraitsTraceParameter.Reflection
