Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatus
Specifies the evaluation status of the field.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatus.OtherError
Evaluation has failed.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatus.InvalidCode
Invalid field code or expression.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatus.SyntaxError
Syntax error in the field expression.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatus.EvaluatorNotFound
Evaluator was not found.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatus.Success
Field is evaluated successfully.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatus.NotYetEvaluated
Field is not yet evaluated.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatus.InvalidContext
Current context is invalid for evaluating the field.