Autodesk.AutoCAD.DatabaseServices.PlaneSurface
Represents a plane surface entity. It provides methods to create and manipulate ASM surfaces.

Autodesk.AutoCAD.DatabaseServices.PlaneSurface.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.PlaneSurface.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.PlaneSurface.CreateFromRegion(Autodesk.AutoCAD.DatabaseServices.Region)
Creates a plane surface from region.
region: Any Region object.

Autodesk.AutoCAD.DatabaseServices.PlaneSurface.{dtor}
