Autodesk.AutoCAD.DatabaseServices.LineWeightConverter.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.LineWeightConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
If sourceType is System.String, this method returns true. Otherwise, it calls the superclass version of this method.
context: System.ComponentModel.ITypeDescriptorContext object.
sourceType: System.Type object.
Returns: True if sourceType is System.String.

Autodesk.AutoCAD.DatabaseServices.LineWeightConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
This method is used to convert a string to a LineWeight value. It attempts to interpret value as a System.String object. If successful, it attempts to find a matching string in the LineWeight enum. If a match is found, this method returns the matching LineWeight value. If no match is found, this method throws a FormatException exception. If value cannot be cast to a System.String object, this method calls the superclass version of this method.
context: System.ComponentModel.ITypeDescriptorContext object.
culture: System.Globalization.CultureInfo object.
value: System.Object object.
Returns: The matching LineWeight value.

Autodesk.AutoCAD.DatabaseServices.LineWeightConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
