Autodesk.AutoCAD.DatabaseServices.OpenMode
Provides the mode values used to specify how a database resident object is to be opened.

Autodesk.AutoCAD.DatabaseServices.OpenMode.ForNotify
An object can be opened for notification when the object is closed, open for read, or open for write, but not when it is already open for notify.

Autodesk.AutoCAD.DatabaseServices.OpenMode.ForWrite
An object can be opened for write if it is not already open. Otherwise, the open fails.

Autodesk.AutoCAD.DatabaseServices.OpenMode.ForRead
An object can be opened for read by up to 256 readers as long as the object is not already open for write or for notify.