Autodesk.AutoCAD.DatabaseServices.AuditInfo
Tracks the basic audit information during a database Audit operation.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.NumEntities
Gets the count maintained in the instance of AuditInfo of the number of entities that were processed.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.AuditPass
Two passes through each object's data are made during the AUDIT command. This property gets if it is PASS1 or PASS2.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.NumFixes
Gets the count maintained in the instance of AuditInfo of the number of errors fixed.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.NumErrors
Gets the count maintained in the instance of AuditInfo of the number of errors.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.FixErrors
Gets true if errors are to be fixed by the entity that is implementing its DBObject.Audit() method.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.ErrorsFound(System.Int32)
Increments the count of errors found that is maintained in the instance of AuditInfo.
count: Number of errors found.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.ErrorsFixed(System.Int32)
Increments the count of errors fixed that is maintained in the instance of AuditInfo by NumFixed.
count: Number of errors fixed.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.PrintError(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String,System.String,System.String)
Prints out log information about the errors detected or fixed using the object pointed to by value to construct a "name" string for the object type (using the name method of the RXClass object for the object type pointed to by value). For example, if value is a Handle object, then name will be "AcDbHandle." value describes the value of the bad handle. validation can be "nonexistent." defaultValue for a handle is set to 0.
value: Object from which the name string will be extracted.
value2: String describing the value of the bad data.
validation: String describing the reason the data is bad.
defaultValue: String describing the default value it is set to.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.PrintError(System.String,System.String,System.String,System.String)
Prints out log information about the errors detected or fixed. For example, name can be "Handle." value describes the value of the bad handle. validation can be "nonexistent." defaultValue for a handle is set to 0.
name: String describing the type of erroneous data found.
value: String describing the value of the bad data.
validation: String describing the reason the data is bad.
defaultValue: String describing the default value it is set to.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.ResetNumEntities
Resets to 0, the count of entities being maintained in the instance of AuditInfo.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.PrintNumEntities(System.String)
If the current count of entities being maintained in the instance of AuditInfo is a multiple of 100, and msg is not null, then this method will print the string msg followed by the current entity count out to the audit log file.
msg: String to be printed.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.{dtor}
