Autodesk.AutoCAD.GraphicsInterface.LightTraits
Parent class for interfaces passed to Light objects in the implementation of SetAttributes().

Autodesk.AutoCAD.GraphicsInterface.LightTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.LightTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.LightTraits.On
Gets or sets true of the light is on.

Autodesk.AutoCAD.GraphicsInterface.LightTraits.{dtor}
