Autodesk.AutoCAD.GraphicsInterface.EdgeStyle
Defines a collection of visual style properties that can be applied to the edges of graphical entities.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.EdgeStyleApply
Gets or sets the type of geometry to which the edge style will be applied.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.HidePrecision
Gets or sets Boolean indicating whether hide precision is enabled.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.Isolines
Gets or sets int from 0 to 2047 representing the number of isolines in effect.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.HaloGap
Gets or sets int from 0 to 100 representing the halo gap in effect.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.SilhouetteWidth
Gets or sets the silhouette edge width in pixels.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.SilhouetteColor
Gets or sets the current color of silhouette edges.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.Jitter
Gets or sets the jitter amount in effect.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.Overhang
Gets or sets int representing the edge overhang amount in pixels.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.EdgeWidth
Gets or sets int representing the edge width in pixels.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.Opacity
Gets or sets double representing the opacity level.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.EdgeColor
Gets or sets the current color of the edges.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.EdgeModifiers
Gets or sets unsigned long representing the collection of edge modifier flags that are in effect.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.CreaseAngle
Gets or sets the angle threshold, in degrees, above which a facet edge representing adjoining facets will be displayed.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.IntersectionLinetype
Gets or sets the linetype of intersection edges for this edge style.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.ObscuredLinetype
Gets or sets the current linetype of obscured edges.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.ObscuredColor
Gets or sets the current color of obscured edges.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.IntersectionColor
Gets or sets the current color of intersection edges.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.EdgeVisibility


Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.EdgeModel
Gets or sets the currently selected edge model in the range of the EdgeModel enumeration.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.Clone
Returns a copy of this object.
Returns: A copy of this object.

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.Set(Autodesk.AutoCAD.GraphicsInterface.EdgeStyle)
Initializes this edge style with the values of the given edge style.
style: A constant reference to the edge style that will be copied into this edge style .

Autodesk.AutoCAD.GraphicsInterface.EdgeStyle.{dtor}
