Autodesk.AutoCAD.Geometry.Point2d
Represents a point in 2D space.

Autodesk.AutoCAD.Geometry.Point2d.#ctor(System.Double[])
Constructor.
xy: X,Y coordinates.

Autodesk.AutoCAD.Geometry.Point2d.#ctor(System.Double,System.Double)
Constructor.Constructs 2D point with coordinates x, y correspondingly.
x: X coordinate.
y: Y coordinate.

Autodesk.AutoCAD.Geometry.Point2d.Origin
Gets The origin (0, 0).

Autodesk.AutoCAD.Geometry.Point2d.Coordinate(System.Int32)


Autodesk.AutoCAD.Geometry.Point2d.Y
Gets Y coordinate of this point.

Autodesk.AutoCAD.Geometry.Point2d.X
Gets X coordinate of this point.

Autodesk.AutoCAD.Geometry.Point2d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Transform this pre-multiplying it the matrix leftSide.
leftSide: Transform matrix.
Returns: The transformed point.

Autodesk.AutoCAD.Geometry.Point2d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Returns 2D point which is the result of rotation of this point around the 2D point origin. Rotation angle is given by the argument angle, where positive direction of rotation is considered from X axis to Y axis.
angle: Rotation angle.
origin: Center of rotation.
Returns: 2D point that is the result of rotation.

Autodesk.AutoCAD.Geometry.Point2d.Mirror(Autodesk.AutoCAD.Geometry.Line2d)
Returns the 2D point which is the result of mirroring of this point with respect to 2D line line in the same plane.
line: Line of symmetry.
Returns: 2D point which is the result of mirroring of this point with respect to 2D line line in the same plane.

Autodesk.AutoCAD.Geometry.Point2d.ScaleBy(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Returns 2d point that is the result of scaling this point with respect to the input point by the scale factor.
scaleFactor: Scale factor.
origin: Center of scaling.
Returns: 2D point that is the result of scaling.

Autodesk.AutoCAD.Geometry.Point2d.MultiplyBy(System.Double)


Autodesk.AutoCAD.Geometry.Point2d.DivideBy(System.Double)


Autodesk.AutoCAD.Geometry.Point2d.Add(Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Point2d.Subtract(Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Point2d.GetAsVector
Converts 2D point into 2D vector with the same set of coordinates.
Returns: 2D vector with the same set of coordinates.

Autodesk.AutoCAD.Geometry.Point2d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Point2d)
Evaluates and returns distance from this point to the input point.
point: Input point.
Returns: Distance from this point to the input point.

Autodesk.AutoCAD.Geometry.Point2d.GetVectorTo(Autodesk.AutoCAD.Geometry.Point2d)


Autodesk.AutoCAD.Geometry.Point2d.Equals(System.Object)


Autodesk.AutoCAD.Geometry.Point2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Point2d)
Checks if this point is within the distance tolerance.EqualPoint() from the input point.
a: Input point.
Returns: true if this condition is met.

Autodesk.AutoCAD.Geometry.Point2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this point is within the distance tolerance.EqualPoint() from the input point.
a: Input point.
tolerance: Tolerance.
Returns: true if this condition is met.

Autodesk.AutoCAD.Geometry.Point2d.GetHashCode


Autodesk.AutoCAD.Geometry.Point2d.ToString(System.IFormatProvider)


Autodesk.AutoCAD.Geometry.Point2d.ToString


Autodesk.AutoCAD.Geometry.Point2d.ToArray
Returns an array containing the X and Y coordinate values for this point.
Returns: An array containing the X and Y coordinate values for this point.

Autodesk.AutoCAD.Geometry.Point2d.op_Inequality(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)


Autodesk.AutoCAD.Geometry.Point2d.op_Equality(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)


Autodesk.AutoCAD.Geometry.Point2d.op_Subtraction(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Point2d.op_Subtraction(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)


Autodesk.AutoCAD.Geometry.Point2d.op_Addition(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)


Autodesk.AutoCAD.Geometry.Point2d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Point2d)


Autodesk.AutoCAD.Geometry.Point2d.op_Multiply(System.Double,Autodesk.AutoCAD.Geometry.Point2d)


Autodesk.AutoCAD.Geometry.Point2d.op_Multiply(Autodesk.AutoCAD.Geometry.Point2d,System.Double)


Autodesk.AutoCAD.Geometry.Point2d.op_Division(Autodesk.AutoCAD.Geometry.Point2d,System.Double)
