Autodesk.AutoCAD.DatabaseServices.UnitsConverter
Implements the System.ComponentModel.TypeConverter interface.

Autodesk.AutoCAD.DatabaseServices.UnitsConverter.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.UnitsConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)


Autodesk.AutoCAD.DatabaseServices.UnitsConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)


Autodesk.AutoCAD.DatabaseServices.UnitsConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)


Autodesk.AutoCAD.DatabaseServices.UnitsConverter.GetConversionFactor(Autodesk.AutoCAD.DatabaseServices.UnitsValue,Autodesk.AutoCAD.DatabaseServices.UnitsValue)
