Autodesk.AutoCAD.DatabaseServices.AnnotationType
Specifies the annotation type for a leader.

Autodesk.AutoCAD.DatabaseServices.AnnotationType.FeatureControlFrame
Leader annotation is a FeatureControlFrame.

Autodesk.AutoCAD.DatabaseServices.AnnotationType.NoAnnotation
Leader has no annotation.

Autodesk.AutoCAD.DatabaseServices.AnnotationType.BlockRef
Leader annotation is a block reference.

Autodesk.AutoCAD.DatabaseServices.AnnotationType.MText
Leader annotation is a multiline text.