Autodesk.AutoCAD.DatabaseServices.ModelerFlavor
Enumerates the possible levels of geometric modeler support available from the Autodesk RealDWG host application.

Autodesk.AutoCAD.DatabaseServices.ModelerFlavor.ObjectsOnly
Read/view only for all (the host application must install modlrobj17.dll).

Autodesk.AutoCAD.DatabaseServices.ModelerFlavor.RegionsOnly
For internal use only.

Autodesk.AutoCAD.DatabaseServices.ModelerFlavor.Full
Full modeler support (the host application must install modlr17.dll).