Autodesk.AutoCAD.DatabaseServices.DBDictionary
Is a database-resident object dictionary, which maintains a map between text strings and database objects.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.#ctor
Default constructor. Initializes the dictionary to be a soft owner of its contents.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DBDictionary.IncludingErased
.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Item(System.String)
Gets the object ID of the entry found.
key: String representing the search key name to look for.
Returns: Object ID of the entry found.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Count
Gets the number of non-deleted entries in the dictionary.
Returns: Returns the number of non-deleted entries in the dictionary.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.MergeStyle
Gets or sets the merge style for INSERT operations.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.TreatElementsAsHard
Gets or sets true if the dictionary is a HardOwner of its elements, false if it is not.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.SkipDeleted


Autodesk.AutoCAD.DatabaseServices.DBDictionary.GetAt(System.String)
Searches the dictionary for the key entryName and, if found, returns the associated object's object ID in entryObj. The search is not case-sensitive.
entryName: String representing the search key name to look for.
Returns: The object ID of the entry found.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.NameAt(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Searches the dictionary for an entry with object ID objId and returns the search key name of the dictionary entry.
objId: Object ID to search for.
Returns: The entry's search key name.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the table contains an entry with an ObjectId that matches objId; otherwise, it returns false.
objId: Object ID of record to search for.
Returns: true if the table contains an entry with an ObjectId that matches objId.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Contains(System.String)
Reports whether the entry specified by entryName is contained in the dictionary. The search for entryName is not case sensitive.
entryName: String representing the search key name to look for.
Returns: True if the entry is found, false if it is not found.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes an entry specified by its object ID in objId from the dictionary.
objId: Object ID of the object to remove.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Remove(System.String)
Removes and entry specified by its key from the dictionary.
key: String representing the entry's key (or name).

Autodesk.AutoCAD.DatabaseServices.DBDictionary.SetName(System.String,System.String)
Renames the entry specified by oldName to the new name specified by newName.
oldName: String representing the entry's old key string name.
newName: String representing the entry's new key string name.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.SetAt(System.String,Autodesk.AutoCAD.DatabaseServices.DBObject)
Adds a new entry specified by newValue into the dictionary, if searchKey does not already exist in the dictionary.
searchKey: String representing the object's search key name.
newValue: The new object to add to the dictionary.
Returns: The object ID of the newly added object.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.GetEnumerator
Gets an iterator for the dictionary.
Returns: An iterator for the dictionary.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.CopyTo(Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Copy
Copies objects in array to this collection.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.{dtor}
