Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks
Enums specify the cell edge of a table cell.

Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks.LeftMask
Indicates the left-edge index of the cell.

Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks.BottomMask
Indicates the bottom-edge index of the cell.

Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks.RightMask
Indicates the right-edge index of the cell.

Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks.TopMask
Indicates the top-edge index of the cell.