Autodesk.AutoCAD.DatabaseServices.FullSubentityPath
This class is used for uniquely identifying a subentity within a particular entity. An object of this class consists of array of object IDs and a SubentityId object.

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId[],Autodesk.AutoCAD.DatabaseServices.SubentityId)
Constructor.
ids: Object ID array.
index: Subentity ID object.

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.SubentId
Gets the embedded SubentityId.

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.Null


Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.GetObjectIds
Returns an array of object IDs for all objects in this subentity path.
Returns: An array of object IDs for all objects in this subentity path.

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.GetHashCode


Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.op_Inequality(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)


Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.op_Equality(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
