Autodesk.AutoCAD.DatabaseServices.UcsTableRecord
Represents records in the UCSTable. Each of these records contains the information about a user coordinate system (UCS) that has been saved in the drawing database.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.#ctor
Default constructor. Initializes the UCS origin to (0,0,0), the UCS X axis to (1,0,0), and the UCS Y axis to (0,1,0) in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.YAxis
Gets or sets the Y axis vector (in WCS coordinates) of the UCS that the UCSTableRecord represents.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.XAxis
Gets or sets the X axis vector (in WCS coordinates) of the UCS that the UCSTableRecord represents.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.Origin
Gets or sets a Point3d, which contains WCS coordinates of the origin of the UCS that the UCSTableRecord represents.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.GetUcsBaseOrigin(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Returns the origin point of the input orthographic view when UCSBASE is set to this UCS.
view: Orthographic view.
Returns: The origin point of the input orthographic view.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.SetUcsBaseOrigin(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets the origin point of the input orthographic view when UCSBASE is set to this UCS.
origin: Origin point.
view: Orthographic view.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.{dtor}
