Autodesk.AutoCAD.DatabaseServices.Vertex3dType
Vertex3dType of Vertex3d.

Autodesk.AutoCAD.DatabaseServices.Vertex3dType.FitVertex
A vertex that was automatically generated as the result of a spline or curve-fit operation. This type of vertex can go away or change automatically during subsequent editing operations on the mesh.

Autodesk.AutoCAD.DatabaseServices.Vertex3dType.ControlVertex
A control point for a spline or curve-fit mesh.

Autodesk.AutoCAD.DatabaseServices.Vertex3dType.SimpleVertex
A standard vertex within the polyface mesh.