Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits
Represents an image background to the underlying display system.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.YScale
Gets or sets the scale of the Y axis.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.XScale
Gets or sets the scale of the X axis.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.YOffset
Gets or sets the Y axis offset value. The value can range from -1 to 1.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.XOffset
Gets or sets the X axis offset value. The value can range from -1 to 1.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.UseTiling
Gets or sets the value of the image tiling property.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.MaintainAspectRatio
Gets or sets true if the image files aspect ratio will be maintained when the background is drawn.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.FitToScreen
Gets or sets a value indicating if the image background needs to be fit to the screen or not.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.ImageFilename
Gets or sets the full path to the image file name associated with this background.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.{dtor}
