Autodesk.AutoCAD.GraphicsInterface.LightAttenuation
Container class for light attenuation properties.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.EndLimit
Gets the distance from the light source beyond which the light has no effect.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.StartLimit
Gets the distance from the light source where light begins to affect the model; objects closer than this are not affected by the light.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.UseLimits
Gets or sets true if start and end limit are being used.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.AttenuationType
Gets or sets the attenuation type for the light.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.SetLimits(System.Double,System.Double)
Sets the distance (a range) from the light source where emitted light affects the model.
startLimit: Distance from the light source where light begins to affect to model; objects closer than this are not affected by the light.
endLimit: Distance from the light source beyond which the light has no effect.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.{dtor}
