Autodesk.AutoCAD.DatabaseServices.Xline
Represents the XLINE entity type within AutoCAD. An xline entity is a line that extends to infinity in both directions.

Autodesk.AutoCAD.DatabaseServices.Xline.#ctor
The default constructor. An Xline object is constructed with a basepoint of (0,0,0) and a direction of (0,0,1).

Autodesk.AutoCAD.DatabaseServices.Xline.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Xline.UnitDir
Gets or sets the unit direction vector of the xline.

Autodesk.AutoCAD.DatabaseServices.Xline.BasePoint
Gets or sets the base point of the xline.

Autodesk.AutoCAD.DatabaseServices.Xline.{dtor}
