Autodesk.AutoCAD.GraphicsInterface.MarbleTexture
Represents a "marble" procedural texture.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.VeinWidth
Gets or sets the width of veins of the marble.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.VeinSpacing
Gets or sets the spacing between veins of the marble.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.VeinColor
Gets or sets the vein color of the marble.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.StoneColor
Gets or sets the color of the marble stone.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.Clone


Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.Set(Autodesk.AutoCAD.GraphicsInterface.MarbleTexture)


Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.Equals(System.Object)


Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.GetHashCode


Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MarbleTexture,Autodesk.AutoCAD.GraphicsInterface.MarbleTexture)


Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MarbleTexture,Autodesk.AutoCAD.GraphicsInterface.MarbleTexture)


Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.{dtor}
