Autodesk.AutoCAD.Geometry.Ray3d
Represents a half-bounded line in 3D space. A Ray3 object either has a start point but no endpoint, or has an endpoint but no start point.

Autodesk.AutoCAD.Geometry.Ray3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs a ray whose start point is point1 and passes through point2. point1 must be different from point2.
point1: Start point of ray.
point2: Any 3D point different from point1.

Autodesk.AutoCAD.Geometry.Ray3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a ray whose start point is point and whose direction is vector. vector must not be a zero-length vector.
point: Start point of ray.
vector: Direction vector of ray.

Autodesk.AutoCAD.Geometry.Ray3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.Ray3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes the definition of the ray so that the start point is point1 and passes through point2. point1 must be different from point2.
point1: Start point of ray.
point2: Any 3D point different from point1.

Autodesk.AutoCAD.Geometry.Ray3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes the definition of the ray so the start point is point and whose direction is vector. vector must not be a zero-length vector.
point: Start point of ray.
vector: Direction vector of ray.

Autodesk.AutoCAD.Geometry.Ray3d.{dtor}
