Autodesk.AutoCAD.Geometry.Point3d
Represents a point in 3D space.

Autodesk.AutoCAD.Geometry.Point3d.#ctor(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Point2d)
Constructor: Constructs 3D point by the formula: p + uAxis * pnt2d.x + vAxis * pnt2d.y,where 3D point p and 3D vectors uAxis and vAxis form the coordinate system in planar entity plane.
plane: Plane.
point: 2D point.

Autodesk.AutoCAD.Geometry.Point3d.#ctor(System.Double[])
Returns the matrix of the rotation by angle angle around the point center.
xyz: Rotation angle.

Autodesk.AutoCAD.Geometry.Point3d.#ctor(System.Double,System.Double,System.Double)
Constructor.Constructs 3D point with coordinates x, y, and z correspondingly.
x: X coordinate.
y: Y coordinate.
z: Z coordinate.

Autodesk.AutoCAD.Geometry.Point3d.Coordinate(System.Int32)


Autodesk.AutoCAD.Geometry.Point3d.Origin
Gets The origin (0, 0, 0).

Autodesk.AutoCAD.Geometry.Point3d.Z
Gets Z coordinate of this point.

Autodesk.AutoCAD.Geometry.Point3d.Y
Gets Y coordinate of this point.

Autodesk.AutoCAD.Geometry.Point3d.X
Gets X coordinate of this point.

Autodesk.AutoCAD.Geometry.Point3d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transform this pre-multiplying it the matrix leftSide.
leftSide: Transform matrix.
Returns: The transformed point.

Autodesk.AutoCAD.Geometry.Point3d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d)
Returns 3D point that is the result of rotation of this point around the line with direction vector passing through the point centerPoint. Rotation angle is given by the argument angle, where positive direction of rotation is defined by the right-hand rule.
angle: Rotation angle.
vector: Axis of rotation.
centerPoint: Center of rotation.
Returns: 3D point that is the result of rotation.

Autodesk.AutoCAD.Geometry.Point3d.ScaleBy(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Returns 3D point that is the result of scaling of this point with respect to the 3D point centerPoint by scale factor scaleFactor.
scaleFactor: Scale factor.
centerPoint: Center of scaling.
Returns: 3D point that is the result of scaling.

Autodesk.AutoCAD.Geometry.Point3d.MultiplyBy(System.Double)


Autodesk.AutoCAD.Geometry.Point3d.DivideBy(System.Double)


Autodesk.AutoCAD.Geometry.Point3d.Add(Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Point3d.Subtract(Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Point3d.GetAsVector
Converts 3D point into 3D vector with the same set of coordinates.
Returns: 3D vector with the same set of coordinates.

Autodesk.AutoCAD.Geometry.Point3d.DistanceTo(Autodesk.AutoCAD.Geometry.Point3d)
Evaluates and returns distance from this point to the input point.
point: Input point.
Returns: Distance from this point to the input point.

Autodesk.AutoCAD.Geometry.Point3d.GetVectorTo(Autodesk.AutoCAD.Geometry.Point3d)


Autodesk.AutoCAD.Geometry.Point3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Point3d)
Checks if this point is within the distance tolerance.EqualPoint() from the input point.
point: Input point.
Returns: true if this condition is met.

Autodesk.AutoCAD.Geometry.Point3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this point is within the distance tolerance.EqualPoint() from the input point.
point: Input point.
tolerance: Tolerance.
Returns: true if this condition is met.

Autodesk.AutoCAD.Geometry.Point3d.Convert2d(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns 2D point with the coordinates corresponding to the decomposition of the vector *this - p in the basis uAxis, vAxis in the planar entity.
plane: Input plane.
Returns: 2D point with the coordinates corresponding to the decomposition of the vector *this - p in the basis uAxis, vAxis in the planar entity.

Autodesk.AutoCAD.Geometry.Point3d.OrthoProject(Autodesk.AutoCAD.Geometry.Plane)
Returns 3D point that is the result of the orthogonal projection of this point into the input plane.
plane: Input plane.
Returns: 3D point that is the result of the orthogonal projection of this point into the input plane.

Autodesk.AutoCAD.Geometry.Point3d.Project(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d)
Returns 3D point that is the result of the parallel projection of this point into the input plane. The direction of projection is defined by input vector.
plane: Input plane.
vector: Input vector.
Returns: 3D point that is the result of the parallel projection of this point into the input plane.

Autodesk.AutoCAD.Geometry.Point3d.Mirror(Autodesk.AutoCAD.Geometry.Plane)
Returns the 3D point that is the result of mirroring of this point with respect to the input plane.
plane: Input plane.
Returns: 3D point that is the result of mirroring of this point with respect to the input plane.

Autodesk.AutoCAD.Geometry.Point3d.Equals(System.Object)


Autodesk.AutoCAD.Geometry.Point3d.GetHashCode


Autodesk.AutoCAD.Geometry.Point3d.ToString(System.IFormatProvider)


Autodesk.AutoCAD.Geometry.Point3d.ToString


Autodesk.AutoCAD.Geometry.Point3d.ToArray
Returns an array containing the X, Y, and Z coordinate values for this point.
Returns: An array containing the X, Y, and Z coordinate values for this point.

Autodesk.AutoCAD.Geometry.Point3d.op_Inequality(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)


Autodesk.AutoCAD.Geometry.Point3d.op_Equality(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)


Autodesk.AutoCAD.Geometry.Point3d.op_Subtraction(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)


Autodesk.AutoCAD.Geometry.Point3d.op_Subtraction(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Point3d.op_Addition(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.Geometry.Point3d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Point3d)


Autodesk.AutoCAD.Geometry.Point3d.op_Multiply(System.Double,Autodesk.AutoCAD.Geometry.Point3d)


Autodesk.AutoCAD.Geometry.Point3d.op_Multiply(Autodesk.AutoCAD.Geometry.Point3d,System.Double)


Autodesk.AutoCAD.Geometry.Point3d.op_Division(Autodesk.AutoCAD.Geometry.Point3d,System.Double)
