Autodesk.AutoCAD.GraphicsInterface.EdgeModifiers
Describes modifiers that can be applied to edges to give them various types of effects.

Autodesk.AutoCAD.GraphicsInterface.EdgeModifiers.AlwaysOnTop
Force edges to be on top. Edges will not participate in the Z-ordering of the displayed drawables.

Autodesk.AutoCAD.GraphicsInterface.EdgeModifiers.Jitter
Apply a jitter effect to the edges. The jitter effect is produced by drawing extra lines adjacent to the original line, with a specific amount of perturbation away from the original line.

Autodesk.AutoCAD.GraphicsInterface.EdgeModifiers.Overhang
Allow an edge to overhang its start and end points by a specified amount.

Autodesk.AutoCAD.GraphicsInterface.EdgeModifiers.Opacity
Apply an opacity value to the edges. If unset, edges are displayed with full opacity. If set, edges are displayed with a specified degree of opacity from completely opaque to completely transparent.

Autodesk.AutoCAD.GraphicsInterface.EdgeModifiers.HaloGap
Apply a halo gap percentage to the edges of an object that is hidden by another object, such that the specified gap is displayed between the edges of the hidden object and the edges of the object which hides it.

Autodesk.AutoCAD.GraphicsInterface.EdgeModifiers.Color
Apply a color other than the drawable object color to the edges.

Autodesk.AutoCAD.GraphicsInterface.EdgeModifiers.Width
Apply a width greater than 1 to the edges.

Autodesk.AutoCAD.GraphicsInterface.EdgeModifiers.None
Apply no modifiers to the edges.