Autodesk.AutoCAD.GraphicsInterface.Geometry
Abstracts out the commonality between ViewportGeometry and WorldGeometry.

Autodesk.AutoCAD.GraphicsInterface.Geometry.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.Geometry.ModelToWorldTransform
Gets the net block insert transform; that is, the model-to-world coordinate transform. The main purpose of the BLOCK entity is to transform an entity--whether to stretch, rotate, or move it.

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushModelTransform(Autodesk.AutoCAD.Geometry.Matrix3d)
Pushes a new transform onto the transform stack. The transform is the result of multiplying matrix by the existing transform. This allows you to easily handle an entity coordinate system. When you have finished with the transform, you must call PopModelTransform() to leave the pipe in the same state as before.
matrix: Matrix.
Returns: true if successful.

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushModelTransform(Autodesk.AutoCAD.Geometry.Vector3d)
Pushes a new transform onto the transform stack. It generates the input matrix using the arbitrary axis algorithm and the supplied vector. When you have finished with the transform, you must call PopModelTransform() to leave the pipe in the same state as before.
normal: Vector.
Returns: true if successful.

Autodesk.AutoCAD.GraphicsInterface.Geometry.PopModelTransform
The method must be called to restore the model transform after a call to PushModelTransform().
Returns: true if successful.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Circle(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Displays a circle primitive that is defined by the three points--firstPoint, secondPoint, and thirdPoint--which all lie on the circle.
firstPoint: First point on circle.
secondPoint: Second point on circle.
thirdPoint: Third point on circle.
Returns: Object ID of the Sun object.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Circle(Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Displays a circle primitive with center at center and a radius of radius. The circle is on the plane defined by the normal vector normal and the point center.
center: Center point for the circle.
radius: Radius for the circle.
normal: Normal vector for plane to contain the circle.
Returns: false indicates that the primitive has been successfully stored in the graphics database.true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.CircularArc(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.GraphicsInterface.ArcType)
Displays an arc primitive defined by the three points: start, point, and endingPoint.
start: Start point of arc.
point: Point on arc.
endingPoint: Endpoint of arc.
arcType: Type of arc to display.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.CircularArc(Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,Autodesk.AutoCAD.GraphicsInterface.ArcType)
Displays an arc primitive defined by the arc's center of curvature center, the radius of curvature radius, the containment plane's normal vector normal, the vector from the center of curvature to the arc start point startVector, the angle that the arc spans sweepAngle, and the arc type arcType.
center: Center point for arc's center of curvature.
radius: Arc's radius of curvature.
normal: Normal vector for plane to contain arc.
startVector: Vector defining the direction the arc start point is from the arc's center of curvature.
sweepAngle: Angle (in radians) that encompasses the arc.
arcType: Type of arc to display.
Returns: false indicates that the primitive has been successfully stored in the graphics database.true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Polyline(Autodesk.AutoCAD.DatabaseServices.Polyline,System.Int32,System.Int32)
Generates display geometry that duplicates the geometry of the polyline's segments.
value: Polyline from which to copy geometry.
fromIndex: Zero to indicate all segments will be copied.
segments: Zero to indicate all segments will be copied.
Returns: false indicates that the primitive has been successfully stored in the graphics database.true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Polyline(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,System.Int32)
Walks down the list of vertex points drawing line segments from point to point (hence the requirement for a minimum of two points). If a thickness is currently specified it will be applied to the segments of this polyline.
points: Array of vertex points.
normal: Normal.
subEntityMarker: Sub-entity marker for first segment.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Polygon(Autodesk.AutoCAD.Geometry.Point3dCollection)
Walks down the list of vertex points drawing line segments from point to point. A closing line segment is drawn from the last vertex to the first vertex to create a polygon that is fillable.
points: Array of vertex points.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Mesh(System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.GraphicsInterface.EdgeData,Autodesk.AutoCAD.GraphicsInterface.FaceData,Autodesk.AutoCAD.GraphicsInterface.VertexData,System.Boolean)
Uses the various objects passed in as parameters to generate and display a mesh primitive.
rows: Number of rows in mesh.
columns: Number of columns in mesh.
points: Array of vertex points (must be rows x columns points).
edgeData: An existing EdgeData object.
faceData: An existing FaceData object.
vertexData: An existing VertexData object.
bAutoGenerateNormals: Boolean to indicate whether the display system should automatically generate normals for vertices and faces if they are not passed in through vertexData and faceData.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Shell(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.GraphicsInterface.EdgeData,Autodesk.AutoCAD.GraphicsInterface.FaceData,Autodesk.AutoCAD.GraphicsInterface.VertexData,System.Boolean)
Uses the various objects passed in as parameters to generate and display a shell primitive.
points: Array of vertex points.
faces: Array of 32-bit integers.
edgeData: An existing EdgeData object.
faceData: An existing FaceData object.
vertexData: An existing VertexData object.
bAutoGenerateNormals: Boolean to indicate whether the display system should automatically generate normals for vertices and faces if they are not passed in through vertexData and faceData.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Text(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.String,System.Boolean,Autodesk.AutoCAD.GraphicsInterface.TextStyle)
Uses the various objects passed in as parameters to generate and display a text graphics primitive.
position: Start or insertion point for the text.
normal: Normal for the plane to contain the text.
direction: Direction the text will go.
message: Text string to display.
raw: Boolean informing AutoCAD whether to interpret escape codes.
textStyle: Describes the desired text characteristics.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Text(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.String)
Uses the various objects passed in as parameters to generate and display a text graphics primitive.
position: Start or insertion point for the text.
normal: Normal for the plane to contain the text.
direction: Direction the text will go.
height: Text height.
width: Text character cell width.
oblique: Text obliquing angle.
message: Text string to display.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Xline(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
An xline passing point1 and point2 is displayed.
point1: Point on an xline.
point2: Second point on an xline.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Ray(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Displays a ray that starts at point1 and passes through point2.
point1: Starting point of ray.
point2: Another point (different from starting point) on the ray.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Draw(Autodesk.AutoCAD.GraphicsInterface.Drawable)
Instructs the graphics system to regenerate value as a component of this object.
value: Drawable to be rendered.
Returns: false to the caller indicates that you did not process the request.

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushClipBoundary(Autodesk.AutoCAD.GraphicsInterface.ClipBoundary)
Pushes a new boundary onto the stack, possibly affecting the display of subsequent primitives until it is removed using PopClipBoundary().
boundary: A clip boundary.
Returns: true if successful.

Autodesk.AutoCAD.GraphicsInterface.Geometry.WorldLine(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Draws a line between the two points.
startPoint: Start point.
endPoint: End point.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Polypoint(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
This is just like a polyline except it is an array of points.
points: Array of points.
normals: Normal.
subentityMarkers: Array of markers to be applied per point.
Returns: false indicates that the primitive has been successfully stored in the graphics database. true indicates that the operation has been terminated and the application wants to get control back as soon as possible.

Autodesk.AutoCAD.GraphicsInterface.Geometry.{dtor}
