Autodesk.AutoCAD.Colors.EntityColor
Objects of this class store a color method and a color, which, depending on the color method, may be a Red/Green/Blue (RGB) value, an AutoCAD Color Index (ACI) value, a layer index, or a pen index.

Autodesk.AutoCAD.Colors.EntityColor.#ctor(System.Byte,System.Byte,System.Byte)
Initializes the color using the supplied RGB values. The color method defaults to ColorMethod.ByColor.
red: Red value from 0 to 255.
green: Green value from 0 to 255.
blue: Blue value from 0 to 255.

Autodesk.AutoCAD.Colors.EntityColor.#ctor(Autodesk.AutoCAD.Colors.ColorMethod,System.Int16)
Initializes the color value to index and sets the color method to value.
value: Color method.
index: The color value.

Autodesk.AutoCAD.Colors.EntityColor.#ctor(Autodesk.AutoCAD.Colors.ColorMethod)
Initializes the color value to 0 and sets the color method to value.
value: Color method.

Autodesk.AutoCAD.Colors.EntityColor.#ctor(System.Int32)
Initializes the color value to trueColor.The color method defaults to ColorMethod.ByColor.
trueColor: The color value.

Autodesk.AutoCAD.Colors.EntityColor.IsNone
Gets true if the color method is ColorMethod.None.

Autodesk.AutoCAD.Colors.EntityColor.IsLayerFrozen
Gets true if color method is ColorMethod.LayerFrozenand.

Autodesk.AutoCAD.Colors.EntityColor.IsLayerOff
Gets true if color method is ColorMethod.LayerOff.

Autodesk.AutoCAD.Colors.EntityColor.IsForeground
Gets true if color method is ColorMethod.Foreground.

Autodesk.AutoCAD.Colors.EntityColor.IsByPen
Gets true if color method is ColorMethod.ByPen.

Autodesk.AutoCAD.Colors.EntityColor.IsByAci
Gets true if color method is ColorMethod.ByAci.

Autodesk.AutoCAD.Colors.EntityColor.IsByBlock
Gets true if color method is ColorMethod.ByBlock.

Autodesk.AutoCAD.Colors.EntityColor.IsByLayer
Gets true if color method is ColorMethod.ByLayer.

Autodesk.AutoCAD.Colors.EntityColor.IsByColor
Gets true if color method is ColorMethod.ByColor.

Autodesk.AutoCAD.Colors.EntityColor.Blue
Gets the color value's blue component. To use this property, the color method must be ColorMethod.ByColor.

Autodesk.AutoCAD.Colors.EntityColor.Green
Gets the color value's green component. To use this property, the color method must be ColorMethod.ByColor.

Autodesk.AutoCAD.Colors.EntityColor.Red
Gets the color value's red component. To use this property, the color method must be ColorMethod.ByColor.

Autodesk.AutoCAD.Colors.EntityColor.PenIndex
Gets the pen index.

Autodesk.AutoCAD.Colors.EntityColor.LayerIndex
Gets the layer index.

Autodesk.AutoCAD.Colors.EntityColor.ColorIndex
Gets the AutoCAD color index (ACI) value.

Autodesk.AutoCAD.Colors.EntityColor.TrueColor
Gets the color through an EntityColor object.

Autodesk.AutoCAD.Colors.EntityColor.ColorMethod
Gets the color method.

Autodesk.AutoCAD.Colors.EntityColor.LookUpRgb(System.Byte)
Looks up the RGB value. colorIndex is an ACI that is to be mapped to an RGB value, where the low byte is blue, the second byte is green, and the third byte is red. The high byte is the color method.
colorIndex: Color value and color method.
Returns: The closest match

Autodesk.AutoCAD.Colors.EntityColor.LookUpAci(System.Byte,System.Byte,System.Byte)
Maps the RGB values given to an ACI value.
red: Red value from 0 to 255.
green: Green value from 0 to 255.
blue: Blue value from 0 to 255.
Returns: The closest match.