Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData
This class is used to serve as a mapping between an ObjectId and any index specific data or flags.

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.AddId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds the mapping data or flag data of id.
id: Object ID for which mapping data or flag data will be added later.

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.SetIdFlags(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Byte)
Sets 8-bit flag value associated with id.
id: Object ID that flags is associated with.
flags: 8-bit flag value associated with id.

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.SetIdData(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Sets 32-bit data associated with id.
id: Object ID that flags is associated with.
data: 32-bit data value associated with id.

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.GetIdData(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets 32-bit data associated with id.
id: Object ID that data is associated with.
Returns: 32-bit data associated with id.

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.GetIdFlags(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets 8-bit flag value associated with id.
id: Object ID that data is associated with.
Returns: 8-bit flag value associated with id.

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.{dtor}
