Autodesk.AutoCAD.DatabaseServices.FieldState
Specifies the state of the field.

Autodesk.AutoCAD.DatabaseServices.FieldState.HasFormattedString


Autodesk.AutoCAD.DatabaseServices.FieldState.HasCache
The field has a cache of the evaluated result.

Autodesk.AutoCAD.DatabaseServices.FieldState.Evaluated
Field has been evaluated.

Autodesk.AutoCAD.DatabaseServices.FieldState.Modified
Field has been modified and not yet evaluated.

Autodesk.AutoCAD.DatabaseServices.FieldState.Compiled
Field has been compiled.

Autodesk.AutoCAD.DatabaseServices.FieldState.Initialized
Field is not yet intitalized with any field code or data.