Autodesk.AutoCAD.DatabaseServices.AttributeReference
Represents the ATTRIB entity within AutoCAD. ATTRIB entities are associated with INSERT entities (BlockReference objects).

Autodesk.AutoCAD.DatabaseServices.AttributeReference.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.String,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor initializes the attribute object with the arguments passed in. position must be in WCS coordinates. Copies of the value and tag strings will be used, so the caller is responsible for the memory used by the strings passed in. If used, style must be a valid TextStyleTableRecord object ID.
position: Location point for the attribute.
value: Text string for the attribute.
tag: Tag string for the attribute.
style: Object ID of the TextStyleTableRecord to be referenced by the attribute.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.#ctor
Default constructor. Initializes the field length to 0, the flags to 0 (that is, nonconstant, visible, not preset, and not verifiable), and the tag to 0. In addition, all the initializations for a default new DBText object take place.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.AttributeReference.LockPositionInBlock
Gets or sets true if the Attribute object is set to be immmovable relative to the geometry in the block.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.FieldLength
Gets or sets the attribute's field length value. This value is not currently used within AutoCAD.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.IsPreset
Gets true if the attribute object has a preset value and will not prompt for user input.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.IsVerifiable
Gets true if the attribute object is set to verify user input.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.IsConstant
Gets true if the attribute object is set to be constant.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.Invisible
Gets or sets true if the attribute object is set to be invisible.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.Tag
Gets or sets a copy of the tag string for the attribute. The tag string is the identifier you see if you explode the BlockReference that owns the attribute, so that the attribute reverts back to the AttributeDefinition that was part of the original reference's block defin.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.SetAttributeFromBlock(Autodesk.AutoCAD.DatabaseServices.AttributeDefinition,Autodesk.AutoCAD.Geometry.Matrix3d)
Uses definition as a template for the attributes textual, entity, and starting geometric properties (in other words, it copies this information from the attribute definition into the attribute). It then applies blockTransform to transform the position, sizing, and obliquing as would be done by the INSERT command.
definition: The attribute definition entity to be used as a data template.
blockTransform: The block transformation matrix as returned by the BlockReference.BlockTransform property of the blockReference that will be the owner of the attribute.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.SetAttributeFromBlock(Autodesk.AutoCAD.Geometry.Matrix3d)
Applies blockTransform to the attribute's geometric data to transform the position, sizing, and obliquing as would be done by the INSERT command. The attribute's textual and entity properties data is left alone.
blockTransform: The block transformation matrix as returned by the BlockReference.BlockTransform property of the blockReference that will be the owner of the attribute.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.{dtor}
