Autodesk.AutoCAD.DatabaseServices.Hatch
A planar entity that can be created and placed in an arbitrary plane in 3D space.

Autodesk.AutoCAD.DatabaseServices.Hatch.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.Hatch.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.Hatch.NumberOfHatchLines
Gets the total number of hatch lines contained in the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.HatchStyle
Gets or sets the hatch style of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.NumberOfPatternDefinitions
Gets the total number of pattern definition lines contained in the pattern of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternDouble
Gets or sets the value of double pattern flag for the hatch entity. PatternDouble applies a second set of hatch lines at 90 degrees to the original hatch lines.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternScale
Gets or sets the pattern scale of the hatch entity. PatternScale is a non-zero positive number.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternSpace
Gets or sets the pattern space of the hatch entity. PatternSpace is the distance between two parallel hatch lines.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternAngle
Gets or sets the pattern angle (in radians) of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternName
Gets the pattern name of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternType
Gets an enumerated pattern type of either PatternType.UserDefined, PatternType.PreDefined, or PatternType.CustomDefined for the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientShift
Gets or sets the current interpolation value between the gradient definition's default and shifted values. The default is 0.0f.

Autodesk.AutoCAD.DatabaseServices.Hatch.ShadeTintValue
Gets or sets a value in the range 0.0 to 1.0, where 0.0 corresponds to a luminance of 0 and 1.0 corresponds to full luminance.

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientOneColorMode
Gets or sets a boolean indicating whether the gradient hatch is transitioning from a start to a stop color (two-color) or from a color to an adjusted luminance version of the same color (one-color). In the latter case, the full luminance version is the "tint" and the zero luminance version is the "shade".

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientAngle
Gets or sets the angle, in radians, at which the current gradient definition is applied.

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientName
Gets the name of the current gradient.

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientType
Gets an enumerator specifying the type of the gradient pattern.

Autodesk.AutoCAD.DatabaseServices.Hatch.IsSolidFill
Gets true if the hatch object is configured for solid fill.

Autodesk.AutoCAD.DatabaseServices.Hatch.IsHatch
Gets true if the hatch object is a hatched pattern as opposed to a solid or gradient fill pattern.

Autodesk.AutoCAD.DatabaseServices.Hatch.IsGradient
Gets true if the hatch object is a gradient.

Autodesk.AutoCAD.DatabaseServices.Hatch.HatchObjectType
Gets or sets the current state of the gradient object.

Autodesk.AutoCAD.DatabaseServices.Hatch.Associative
Gets or sets true if this hatch entity is associative with its source boundary geometries.

Autodesk.AutoCAD.DatabaseServices.Hatch.NumberOfLoops
Gets the total number of boundary loops contained in the hatch entity. Boundary loops define the area to be hatched.

Autodesk.AutoCAD.DatabaseServices.Hatch.Normal
Gets or sets the normal vector of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.Elevation
Gets or sets the elevation for the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.LoopTypeAt(System.Int32)
Returns the loop type of a selected hatch boundary loop from the hatch entity.
loopIndex: Index of the selected loop.
Returns: The loop type of a selected hatch boundary loop from the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetLoopAt(System.Int32)
Gets the loop definition data (path) of a selected hatch boundary loop from the hatch entity.
loopIndex: Index of the selected loop.
Returns: The loop definition data (path) of a selected hatch boundary loop from the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.AppendLoop(Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Appends a new boundary loop (path or polyline) to the hatch entity.
loopType: Loop type.
dbObjIds: Set of Object IDs.

Autodesk.AutoCAD.DatabaseServices.Hatch.AppendLoop(Autodesk.AutoCAD.DatabaseServices.HatchLoop)
Appends a new boundary loop (path or polyline) to the hatch entity.
hatchLoop: HatchLoop object.

Autodesk.AutoCAD.DatabaseServices.Hatch.InsertLoopAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Inserts a new boundary loop (path or polyline) to the hatch entity.
loopIndex: Index for the selected loop.
loopType: Loop type.
dbObjIds: Set of Object IDs.

Autodesk.AutoCAD.DatabaseServices.Hatch.InsertLoopAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.HatchLoop)
Inserts a new boundary loop (path or polyline) to the hatch entity.
loopIndex: Index for the selected loop.
hatchLoop: HatchLoop object.

Autodesk.AutoCAD.DatabaseServices.Hatch.RemoveLoopAt(System.Int32)
Removes a loop and its data from the hatch entity.
loopIndex: Index for the selected loop.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetAssociatedObjectIdsAt(System.Int32)
Gets the object IDs of the source boundary geometries associative to the selected loop.
loopIndex: Index for the selected loop.
Returns: Set of object IDs.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetAssociatedObjectIds
Gets the object IDs of the source boundary geometries associative to the selected loop.
Returns: Set of object IDs.

Autodesk.AutoCAD.DatabaseServices.Hatch.SetGradient(Autodesk.AutoCAD.DatabaseServices.GradientPatternType,System.String)
Provides the mechanism for specifying the shape definition of the gradient fill.
gradientType: Gradient type.
gradientName: Name of the gradient to apply.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetGradientColors
Returns the colors and interpolation values describing how the gradient fill definition will be applied.
Returns: The colors and interpolation values describing how the gradient fill definition will be applied.

Autodesk.AutoCAD.DatabaseServices.Hatch.SetGradientColors(Autodesk.AutoCAD.DatabaseServices.GradientColor[])
Provides the mechanism for defining the colors to be applied to the gradient definition.
value: Array of colors defining the gradient.

Autodesk.AutoCAD.DatabaseServices.Hatch.EvaluateGradientColorAt(System.Single)
Provides a way to evaluate the interpolated color that the current gradient definition and colors will produce at a specified location along the gradient.
value: Normalized value, [0.0...1.0], at which to evaluate the gradient color.
Returns: The color of the current gradient evaluated at the location value.

Autodesk.AutoCAD.DatabaseServices.Hatch.SetHatchPattern(Autodesk.AutoCAD.DatabaseServices.HatchPatternType,System.String)
Sets both pattern type and pattern name for hatch entity.
patternType: Enumerated number of pattern type.
patternName: Name of the pattern.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetPatternDefinitionAt(System.Int32)
Gets the pattern definition line data from the hatch entity at the selected pattern line.
index: Pattern index.
Returns: The pattern definition line data.

Autodesk.AutoCAD.DatabaseServices.Hatch.EvaluateHatch(System.Boolean)
Gets the pattern definition line data from the hatch entity at the selected pattern line.
underEstimateNumLines: If true, underestimates the count before deciding to abort. That is, if Hatch.EvaluateHatch(true) is used, the method will abort if the count is in excess of 100,000.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetHatchLinesData
Gets the pattern definition line data from the hatch entity at the selected pattern line.
Returns: The pattern definition line data.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetHatchLineDataAt(System.Int32)
Gets the hatch line data from the hatch entity.
index: Number at which the hatch line data will be returned.
Returns: The hatch line data from the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.{dtor}
