Autodesk.AutoCAD.DatabaseServices.PlotSettingsShadePlotType
Defines the shade plot mode of the current PlotSettings object. This mode specifies how viewports will plot.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsShadePlotType.Wireframe
Plot wireframe regardless of display.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsShadePlotType.RenderPreset
Plot using the render preferences referenced by the shade plot ID.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsShadePlotType.VisualStyle
Plot using the visual style settings referenced by the shade plot ID.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsShadePlotType.Rendered
Plot rendered regardless of display.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsShadePlotType.Hidden
Plot hidden regardless of display.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsShadePlotType.AsDisplayed
Plot the same way it is displayed.