Autodesk.AutoCAD.DatabaseServices.RasterImageDef
The RasterImageDef object (or "image definition object") works with the RasterImage entity (or "image entity") to implement raster images inside AutoCAD. The relationship between these two classes is much like the relationship between an AutoCAD block definition object and a block insert entity.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ImageModified
Gets or sets the state of the internal "image data modified" flag, which is true if the image has been modified.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.UndoStoreSize
Gets or sets the current value of the Undo store size.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.FileDescCopy


Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ResolutionUnits
Gets or sets the units in which the image resolution was specified in the source image file.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ResolutionMMPerPixel
Gets or sets the default physical size of a single image pixel in millimeters. If the image has no default resolution, then this property gets or sets pixel height and width values equal to 1/width of image in pixels.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.FileType
Gets the type of image file, such as BMP for a Windows bitmap.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ColorDepth
Gets the number of bits per pixel for the source image data. Possible values are 1, 8, 24, or 32.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Organization
Gets the pixel organization scheme of the source image file. Requires that the image be loaded to work properly.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Size
Gets the raw image size in pixels. The width is stored in the x element, and the height in the y element.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.IsLoaded
Gets true if the image is loaded.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.IsEmbedded
Gets true if the image is embedded in the drawing file.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SearchForActivePath
Gets the new active path if successful.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ActiveFileName
Gets or sets the path name of the actual file being currently used to define the image.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SourceFileName
Gets or sets the path name of the externally referenced image file name. This file name is saved in the DWG file with the object.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Embed
This method is currently unimplemented, but may appear in a future release.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Load
Enables "lazy loading" of the image pixel data from the source image file.Note that with lazy loading, the image isn't physically loaded into memory until it is required (for example, to appear on the screen.) A delay may be noticed later when the image is physically loaded.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Unload(System.Boolean)
Immediately unloads the image data in RasImageDef from the Image Engine's working memory, but does not delete the RasImageDef itself.
modifyDatabase: Boolean indicates whether or not to do undo recording.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.GetEntityCount(System.Boolean@)
Returns the number of RasterImage entities in the current drawing that are dependent upon this object for display graphics.
locked: true if any dependent entities reside on locked layers.
Returns: The number of RasterImage entities.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.UpdateEntities
Causes all the RasterImage entities in the current drawing that are dependent upon this object to be redrawn when this object is next closed. This method requires that the image definition be open for writing.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ImageCopy(System.Boolean)
Creates a copy of the image data, and returns a pointer to it.
forceImageLoad: Boolean indicates whether to load the image if it is not currently loaded.
Returns: A pointer to the image data.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.OpenImage
This method is not implemented. Use the Load method instead.
Returns: A pointer to the image data.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SetImage(System.IntPtr,System.IntPtr,System.Boolean)
Directly specifies an in-memory Image or a custom FileReadDescriptor to be used.
image: null or pointer to valid Image object.
fileDescription: null or pointer to valid FileReadDescriptor object.
modifyDatabase: Boolean indicates whether to do undo recording.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.CreateImageDictionary(Autodesk.AutoCAD.DatabaseServices.Database)
Creates a new image dictionary if the method RasterImageDef.GetImageDictionary returns 0, indicating that no image dictionary exists.
database: AutoCAD database in which to create the dictionary.
Returns: Object ID of the newly created dictionary.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.GetImageDictionary(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the object ID of the image dictionary in the specified drawing database or 0 if the dictionary was not found.
database: AutoCAD database in which to find the dictionary.
Returns: The object ID of the image dictionary in the specified drawing database.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SuggestName(Autodesk.AutoCAD.DatabaseServices.DBDictionary,System.String)
Operates on the original image file name to produce a string as similar as possible to the original file name, but suitable for use in the image dictionary.
imageDictionary: The (previously opened for reading) image dictionary within which this name must be unique.
newImagePathName: A string contains the source image file or path name.
Returns: String contains a unique name suitable for use in the image dictionary.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.{dtor}
