Autodesk.AutoCAD.Geometry.OffsetCurve3d
Represents a curve that is an exact offset of another curve (base curve).

Autodesk.AutoCAD.Geometry.OffsetCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Constructs an offset curve that is an exact offset of the specified base curve. The direction of offset is determined by the sign of the offsetDistance parameter and by the direction of planeNormal. The base curve must be planar and planeNormal must be perpendicular to the plane of the base curve.
baseCurve: Base curve.
planeNormal: Plane normal.
offsetDistance: Offset distance.

Autodesk.AutoCAD.Geometry.OffsetCurve3d.Transformation
Gets transformation matrix that was applied to this curve by calling TransformBy().

Autodesk.AutoCAD.Geometry.OffsetCurve3d.ParameterDirection
Gets true if this curve has same parameter direction as base curve, false if this curve has opposite parameter direction as base curve.

Autodesk.AutoCAD.Geometry.OffsetCurve3d.OffsetDistance
Gets or sets the signed distance that this curve is offset from the base curve.

Autodesk.AutoCAD.Geometry.OffsetCurve3d.Normal
Gets or sets the normal vector that determines the direction of offset.

Autodesk.AutoCAD.Geometry.OffsetCurve3d.Curve
Gets or sets the base curve of which this curve is an offset.

Autodesk.AutoCAD.Geometry.OffsetCurve3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.OffsetCurve3d.{dtor}
