Autodesk.AutoCAD.DatabaseServices.SectionState
Section plane types: Plane, Boundary, and Volume.

Autodesk.AutoCAD.DatabaseServices.SectionState.Volume
Section plane is bounded by the front, side, back, top, and bottom lines.

Autodesk.AutoCAD.DatabaseServices.SectionState.Boundary
Section plane is bounded by the section line, two side lines, and a back line. However it extends infinitely up and down.

Autodesk.AutoCAD.DatabaseServices.SectionState.Plane
Section plane extends infinitely in all directions.