Autodesk.AutoCAD.GraphicsSystem.InvalidationHint
Tells the Graphic System how to process the invalidate method.

Autodesk.AutoCAD.GraphicsSystem.InvalidationHint.InvalidateMaterials


Autodesk.AutoCAD.GraphicsSystem.InvalidationHint.InvalidateLinetypes
Invalidates all linetype caches.

Autodesk.AutoCAD.GraphicsSystem.InvalidationHint.InvalidateFills


Autodesk.AutoCAD.GraphicsSystem.InvalidationHint.InvalidateFacets


Autodesk.AutoCAD.GraphicsSystem.InvalidationHint.InvalidateAllStatic


Autodesk.AutoCAD.GraphicsSystem.InvalidationHint.InvalidateAll
Invalidates the entire cache.

Autodesk.AutoCAD.GraphicsSystem.InvalidationHint.InvalidateViewportCache
Invalidates all per-view caches.

Autodesk.AutoCAD.GraphicsSystem.InvalidationHint.InvalidateIsolines
Invalidates any isolines that may be cached.

Autodesk.AutoCAD.GraphicsSystem.InvalidationHint.InvalidateNone
