Autodesk.AutoCAD.Geometry.EllipticalArc2d
Represents both full circles and circular arcs in 2D space.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Double,System.Double,System.Double,System.Double)
Constructs an ellipse with the specified center, major and minor axes, major and minor radii, and start and end angles.
center: Ellipse center.
majorAxis: Ellipse major axis.
minorAxis: Ellipse minor axis.
majorRadius: Ellipse major radius.
minorRadius: Ellipse minor radius.
startAngle: Angle of ellipse start point.
endAngle: Angle of ellipse endpoint.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Double,System.Double)
Constructs a full ellipse with the specified center, major and minor axes, and major and minor radii.
center: Ellipse center.
majorAxis: Ellipse major axis.
minorAxis: Ellipse minor axis.
majorRadius: Ellipse major radius.
minorRadius: Ellipse minor radius.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.#ctor(Autodesk.AutoCAD.Geometry.CircularArc2d)
Constructs a 2D ellipse that is identical to the input circular arc.
arc: Any 2D circular arc.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsClockWise
Gets a boolean indicating whether the orientation of an ellipse is clockwise or counterclockwise.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.EndPoint
Gets the endpoint of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.StartPoint
Gets the start point of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.EndAngle
Gets the angle of the endpoint of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.StartAngle
Gets the angle of the ellipse start point.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MajorAxis
Gets the major axis vector of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MinorAxis
Gets the minor axis vector of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MajorRadius
Gets or sets the major radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MinorRadius
Gets or sets the minor radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.Center
Gets or sets the center point of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.EllipticalArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d)
Determines if the input line intersects the ellipse.
line: Any 2D linear entity.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input line intersects the ellipse.
line: Any 2D linear entity.
tolerance: Tolerance for tangent intersections.
Returns: Intersection points.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsCircular
Determines if an ellipse is a circular arc.
Returns: true if an ellipse is a circular arc.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsCircular(Autodesk.AutoCAD.Geometry.Tolerance)
Determines if an ellipse is a circular arc.
tolerance: Tolerance for tangent intersections.
Returns: true if an ellipse is a circular arc.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsInside(Autodesk.AutoCAD.Geometry.Point2d)
Determines whether the input point lies inside the ellipse.
point: Any 2D point.
Returns: true if the input point lies inside the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsInside(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines whether the input point lies inside the ellipse.
point: Any 2D point.
tolerance: Tolerance for tangent intersections.
Returns: true if the input point lies inside the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.SetAxes(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Resets the major and minor axes of the ellipse.
majorAxis: Ellipse major axis.
minorAxis: Ellipse minor axis.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.SetAngles(System.Double,System.Double)
Changes the start point and endpoint of the ellipse by resetting the angles of the start point and endpoint.
startAngle: Angle of ellipse start point.
endAngle: Angle of ellipse endpoint.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.Set(Autodesk.AutoCAD.Geometry.CircularArc2d)
Changes the definition of the ellipse to be identical to the input circular arc.
arc: Any 2D circular arc.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Double,System.Double,System.Double,System.Double)
Changes the definition of the ellipse to have the specified center, major and minor axes, major and minor radii, and start and end angles.
center: Ellipse center.
majorAxis: Ellipse major axis.
minorAxis: Ellipse minor axis.
majorRadius: Ellipse major radius.
minorRadius: Ellipse minor radius.
startAngle: Angle of ellipse start point.
endAngle: Angle of ellipse endpoint.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Double,System.Double)
Changes the definition of the ellipse to a full ellipse with the specified center, major and minor axes, and major and minor radii.
center: Ellipse center.
majorAxis: Ellipse major axis.
minorAxis: Ellipse minor axis.
majorRadius: Ellipse major radius.
minorRadius: Ellipse minor radius.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.{dtor}
