Autodesk.AutoCAD.DatabaseServices.Unit


Autodesk.AutoCAD.DatabaseServices.Unit.GigaMeters


Autodesk.AutoCAD.DatabaseServices.Unit.Microinches


Autodesk.AutoCAD.DatabaseServices.Unit.Mile


Autodesk.AutoCAD.DatabaseServices.Unit.Yard


Autodesk.AutoCAD.DatabaseServices.Unit.Foot


Autodesk.AutoCAD.DatabaseServices.Unit.Inch


Autodesk.AutoCAD.DatabaseServices.Unit.Kilometer


Autodesk.AutoCAD.DatabaseServices.Unit.Meter


Autodesk.AutoCAD.DatabaseServices.Unit.Centimeter


Autodesk.AutoCAD.DatabaseServices.Unit.Millimeter


Autodesk.AutoCAD.DatabaseServices.Unit.Parsecs


Autodesk.AutoCAD.DatabaseServices.Unit.LightYears


Autodesk.AutoCAD.DatabaseServices.Unit.Astronomical


Autodesk.AutoCAD.DatabaseServices.Unit.Hectometers


Autodesk.AutoCAD.DatabaseServices.Unit.Dekameters


Autodesk.AutoCAD.DatabaseServices.Unit.Decimeters


Autodesk.AutoCAD.DatabaseServices.Unit.Microns


Autodesk.AutoCAD.DatabaseServices.Unit.Nanometers


Autodesk.AutoCAD.DatabaseServices.Unit.Angstroms


Autodesk.AutoCAD.DatabaseServices.Unit.Mils


Autodesk.AutoCAD.DatabaseServices.Unit.None
