Autodesk.AutoCAD.DatabaseServices.IdPair
The element class for IdMapping, which is used in deep clone operations. It holds a pair of ObjectIds. The key is the original object's ID, and the value is the cloned object's ID.

Autodesk.AutoCAD.DatabaseServices.IdPair.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean,System.Boolean,System.Boolean)
This constructor allows the creation of an IdPair object with all internal data specified in the arguments passed in.
key: ObjectId to use as the key.
value: ObjectId to use as the value.
isCloned: Boolean indicating if it has been cloned already.
isPrimary: Boolean indicating if it is a primary object.
isOwnerTranslated: Boolean indicating if its owner has already been translated.

Autodesk.AutoCAD.DatabaseServices.IdPair.IsOwnerTranslated
Gets true if the owner has been translated.

Autodesk.AutoCAD.DatabaseServices.IdPair.IsPrimary
Gets true if the key object is part of the primary set of objects being cloned, or if it was "deep cloned" because it was owned by a cloned primary object.

Autodesk.AutoCAD.DatabaseServices.IdPair.IsCloned
Gets true if the key object has been cloned.

Autodesk.AutoCAD.DatabaseServices.IdPair.Value
Gets the value (which is the ObjectId of the cloned object).

Autodesk.AutoCAD.DatabaseServices.IdPair.Key
Gets the key (which is the ObjectId of the original object).

Autodesk.AutoCAD.DatabaseServices.IdPair.ToString(System.IFormatProvider)


Autodesk.AutoCAD.DatabaseServices.IdPair.ToString


Autodesk.AutoCAD.DatabaseServices.IdPair.Equals(System.Object)


Autodesk.AutoCAD.DatabaseServices.IdPair.GetHashCode


Autodesk.AutoCAD.DatabaseServices.IdPair.op_Inequality(Autodesk.AutoCAD.DatabaseServices.IdPair,Autodesk.AutoCAD.DatabaseServices.IdPair)


Autodesk.AutoCAD.DatabaseServices.IdPair.op_Equality(Autodesk.AutoCAD.DatabaseServices.IdPair,Autodesk.AutoCAD.DatabaseServices.IdPair)
