Autodesk.AutoCAD.DatabaseServices.UnitType
For internal use only.

Autodesk.AutoCAD.DatabaseServices.UnitType.Volume
Number specifies volume.

Autodesk.AutoCAD.DatabaseServices.UnitType.Area
Number specifies area.

Autodesk.AutoCAD.DatabaseServices.UnitType.Angle
Number specifies angle.

Autodesk.AutoCAD.DatabaseServices.UnitType.Distance
Number specifies distance.

Autodesk.AutoCAD.DatabaseServices.UnitType.Unitless
Unitless number.