Autodesk.AutoCAD.GraphicsInterface.ViewportDraw
The ViewportDraw class is a container class that provides the ability to generate different geometry for different viewports.

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.ViewportObjectId
Gets the ObjectId of the Viewport being drawn to.

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.SequenceNumber
Gets the number of viewports deleted so far during the AutoCAD edit session for the current drawing. If this number has incremented since last checked, then some viewport has been removed.

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.Geometry
Gets a reference to the Viewport Geometry object. The ViewportGeometry object allows the user to generate geometry (polylines, arcs, meshes, etc.).

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.Viewport
Gets a reference to the Viewport object in use by the ViewportDraw object. The Viewport object contains viewport-specific information applicable to the current viewport being drawn to.

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.IsValidId(System.Int32)
Returns true if the viewport specified by value still exists.
value: Viewport ID value.
Returns: true if the viewport specified by value still exists.

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.{dtor}
