Autodesk.AutoCAD.Geometry.ExternalBoundedSurface
ExternalBoundedSurface class is a representation of a bounded surface defined outside of the geometry library.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.#ctor(System.IntPtr,Autodesk.AutoCAD.Geometry.ExternalEntityKind)
Constructor that creates an external bounded surface from an external surface definition passed in by the caller.
surfaceDefinition: Definition of the external bounded surface.
surfaceKind: Information about the system in which the surface definition was created.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsOwnerOfSurface
Gets true if the instance is the owner of its data.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.NumContours
Gets the number of curve boundaries on this surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsExternalSurface
Gets true if the base surface is an external surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsNurbs
Gets true if the base surface is NURBS.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsTorus
Gets true if the base surface is a torus.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsCone
Gets true if the base surface is a cone.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsCylinder
Gets true if the base surface is a cylinder.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsSphere
Gets true if the base surface is a sphere.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsPlane
Gets true if the base surface is a plane.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.ExternalBaseSurface
Gets definition of the unbounded external surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.BaseSurface
Gets definition of the unbounded external surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.ExternalSurfaceDefinition
Gets copy of the definition data as a pointer.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsDefined
Gets true if the instance does have a surface definition.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.ExternalSurfaceKind
Gets information concerning the native system in which the external bounded surface definition was created.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.GetContours
Returns boundaries on the surface as an array of CurveBoundary.
Returns: Boundaries on the surface as an array of CurveBoundary.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.Set(System.IntPtr,Autodesk.AutoCAD.Geometry.ExternalEntityKind)
Resets the definition of an instance of this class. If the current instance is not empty, and it owns its definition data, then before resetting the definition data it deletes the existing definition.
surfaceDef: Definition of the external bounded surface.
surfaceKind: Information about the system in which the surface definition was created.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.{dtor}
