Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection
This collection class provides a container for GraphNode objects.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Count
Gets the number of objects in the collection.
Returns: Returns a value representing the number of objects in the collection.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.RemoveAt(System.Int32)
Removes the element at the specified index of the collection.
index: The zero-based index of the element to remove.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.GetEnumerator
Gets an enumerator for the collection.
Returns: An enumerator that can be used to iterate through the collection.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Add(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Adds an object to the end of the collection.
value: The object to be added to the end of the collection. The value can be null.
Returns: The collection index at which the value has been added.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Gets the 0-based index of the collection item that matches value.
value: The object to search for in this collection.
Returns: The zero-based index of the collection item that matches value, or -1 if value does not exist in the collection.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.GraphNode)
Inserts an element into the collection at the specified index.
index: The zero-based index at which value should be inserted.
value: Element to be inserted in the collection.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Remove(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Removes the object represented by value from this collection.
value: The item to remove from the collection.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Contains(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Determines whether an element is in the collection.
value: The object to search for in this collection.
Returns: true if the collection contains an object that matches value; otherwise, false.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.GraphNode[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.{dtor}
