Autodesk.AutoCAD.DatabaseServices.LinetypeTable
The symbol table for LinetypeTableRecords, which represent the linetypes within a drawing database.

Autodesk.AutoCAD.DatabaseServices.LinetypeTable.{dtor}
