Autodesk.AutoCAD.LayerManager.LayerFilter
This is the main layer filter class. It allows the client to specify and retrieve the filter expression and to nest filters.

Autodesk.AutoCAD.LayerManager.LayerFilter.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.LayerManager.LayerFilter.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.LayerManager.LayerFilter.FilterExpression
Gets or sets a filter expression.

Autodesk.AutoCAD.LayerManager.LayerFilter.DisplayImages
Gets images to be displayed in the layer properties manager for your custom filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.IsIdFilter
Gets true if this filter only filters for the object ID property of a layer. These filters are also known as layer groups.

Autodesk.AutoCAD.LayerManager.LayerFilter.IsProxy
Gets true if this is a proxy filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.AllowDelete
Gets true if this filter can be removed.

Autodesk.AutoCAD.LayerManager.LayerFilter.DynamicallyGenerated
Gets true if the filter is dynamically generated by its parent and should not be persisted on its own.

Autodesk.AutoCAD.LayerManager.LayerFilter.AllowNested
Gets true if this filter allows nested filters.

Autodesk.AutoCAD.LayerManager.LayerFilter.NestedFilters
Gets an array containing the nested filters of this filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.Parent
Gets the parent filter for this filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.AllowRename
Gets a Boolean value indicating whether or not renaming this filter is allowed.

Autodesk.AutoCAD.LayerManager.LayerFilter.Name
Gets the name of the filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.DeleteUnmanagedObject


Autodesk.AutoCAD.LayerManager.LayerFilter.Filter(Autodesk.AutoCAD.DatabaseServices.LayerTableRecord)
Returns true if the given LayerTableRecord is visible with this filter.
layer: LayerTableRecord on which the decision is going to be made.
Returns: true if the given LayerTableRecord is visible with this filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.ShowEditor
Called by the host application to show an editor window for the filter. The editor is displayed as a child of the active popup window.
Returns: Dialogresult.UseDefault if you want to instruct the host application to display the default filter dialog.

Autodesk.AutoCAD.LayerManager.LayerFilter.GetFilterExpressionTree
Returns a read-only expression tree that represents this filter.
Returns: A read-only expression tree that represents this filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.{dtor}
