Autodesk.AutoCAD.GraphicsInterface.FaceModifiers
Describes the modifiers applied to the faces using this face style.

Autodesk.AutoCAD.GraphicsInterface.FaceModifiers.Specular
Apply a specular highlight (indicating reflection and shininess values) to a material that is applied to the faces.

Autodesk.AutoCAD.GraphicsInterface.FaceModifiers.Opacity
Apply an opacity value to the faces. If unset, faces are displayed with full opacity. If set, faces are displayed with a specified degree of opacity from completely opaque to completely transparent.

Autodesk.AutoCAD.GraphicsInterface.FaceModifiers.None
Apply no face modifiers to the faces.