Autodesk.AutoCAD.Geometry.PointEntity3d
Abstract base class for 3D point classes.

Autodesk.AutoCAD.Geometry.PointEntity3d.Create(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Geometry.PointEntity3d.GetPoint
Returns 3D coordinates of point entity.
Returns: 3D coordinates of point entity.

Autodesk.AutoCAD.Geometry.PointEntity3d.{dtor}
