Autodesk.AutoCAD.DatabaseServices.Planarity
The type of Planarity.

Autodesk.AutoCAD.DatabaseServices.Planarity.Linear
The Planarity is linear.

Autodesk.AutoCAD.DatabaseServices.Planarity.Planar
The Planarity is planar.

Autodesk.AutoCAD.DatabaseServices.Planarity.NonPlanar
The Planarity is non planar.