Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties
Encapsulates the data returned by the Solid3d.MassProperties property.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.#ctor(System.Int32)


Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.PrincipalAxes(System.Int32)
Gets the X, Y, and Z principal axes of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.Extents
Gets the extents (bounding box) of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.RadiiOfGyration
Gets the X, Y, and Z radii of gyration of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.PrincipalMoments
Gets the X, Y, and Z principal moments of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.ProductsOfIntertia
Gets the X, Y, and Z products of inertia of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.MomentsOfIntertia
Gets the X, Y, and Z moments of inertia of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.Centroid
Gets the centroid of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.Volume
Gets the volume of the solid.