Autodesk.AutoCAD.LayerManager.LayerFilterCollection
This collection class provides a container for LayerFilter.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.Count
Gets the number of objects in the collection.
Returns: Returns a value representing the number of objects in the collection.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.GetEnumerator
Gets an enumerator for the collection.
Returns: An enumerator that can be used to iterate through the collection.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.Add(Autodesk.AutoCAD.LayerManager.LayerFilter)
Adds an object to the end of the collection.
value: The object to be added to the end of the collection. The value can be null.
Returns: The collection index at which the value has been added.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.Remove(Autodesk.AutoCAD.LayerManager.LayerFilter)


Autodesk.AutoCAD.LayerManager.LayerFilterCollection.Contains(Autodesk.AutoCAD.LayerManager.LayerFilter)
Determines whether an element is in the collection.
value: The object to search for in this collection.
Returns: true if the collection contains an object that matches value; otherwise, false.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.CopyTo(Autodesk.AutoCAD.LayerManager.LayerFilter[],System.Int32)
Copies the entire collection to a one-dimensional array, starting at the specified index of the target array.
array: The target array to which to copy.
index: The zero-based index in values where this method starts copying this collection.