Autodesk.AutoCAD.GraphicsInterface.Drawable
All graphical objects, both transient and persistent, will implement a drawable interface. Objects exposing this interface are capable of drawing themselves through the Draw API.

Autodesk.AutoCAD.GraphicsInterface.Drawable.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.GraphicsInterface.Drawable.DrawableType
Gets the type of the current drawable.

Autodesk.AutoCAD.GraphicsInterface.Drawable.Id
Gets the database ID that corresponds to this drawable (if the drawable is persistent).

Autodesk.AutoCAD.GraphicsInterface.Drawable.IsPersistent
Gets true if the calling AcGiDrawable object is persistent (stored in a database).

Autodesk.AutoCAD.GraphicsInterface.Drawable.SetAttributes(Autodesk.AutoCAD.GraphicsInterface.DrawableTraits)
Takes the input DrawableTraits object and sets the values for the current object's subentity traits.
traits: DrawableTraits object to be set. Returns with traits filled in with the calling objects subentity traits values.
Returns:

Autodesk.AutoCAD.GraphicsInterface.Drawable.WorldDraw(Autodesk.AutoCAD.GraphicsInterface.WorldDraw)
In response to WorldDraw(), a drawable uses the passed-in WorldDraw interface to describe its geometry that is sharable across viewports.
wd: WorldDraw interface.
Returns: false indicates that the 3D GS must call ViewportDraw() in order to obtain the complete geometry and attribute set for this drawable.

Autodesk.AutoCAD.GraphicsInterface.Drawable.ViewportDraw(Autodesk.AutoCAD.GraphicsInterface.ViewportDraw)
In response to ViewportDraw(), a drawable uses the passed in ViewportDraw interface to describe its view-dependent geometry.
vd: ViewportDraw interface.

Autodesk.AutoCAD.GraphicsInterface.Drawable.ViewportDrawLogicalFlags(Autodesk.AutoCAD.GraphicsInterface.ViewportDraw)
Entity implementers who desire view-independent ViewportDraw caching must provide a meaningful response to this API -- the return value is a combination of the Drawable SetAttributes flags.
vd: ViewportDraw interface.
Returns: A combination of the Drawable SetAttributes flags.

Autodesk.AutoCAD.GraphicsInterface.Drawable.{dtor}
