Autodesk.AutoCAD.Colors.ColorMethod
Specifies how the color is stored.

Autodesk.AutoCAD.Colors.ColorMethod.LayerFrozen
Layer index in mRGBM.indirect.

Autodesk.AutoCAD.Colors.ColorMethod.LayerOff


Autodesk.AutoCAD.Colors.ColorMethod.Foreground
Foreground color.

Autodesk.AutoCAD.Colors.ColorMethod.ByPen
Pen index in mRGBM.indirect.

Autodesk.AutoCAD.Colors.ColorMethod.ByAci
ACI index in mRGBM.indirect.

Autodesk.AutoCAD.Colors.ColorMethod.ByColor
blue, green, red, and colorMethod memebers of mRGBM.

Autodesk.AutoCAD.Colors.ColorMethod.ByBlock
Block color.

Autodesk.AutoCAD.Colors.ColorMethod.ByLayer
Layer index in mRGBM.indirect.

Autodesk.AutoCAD.Colors.ColorMethod.None
Only mRGBM.colorMethod is valid.