Autodesk.AutoCAD.DatabaseServices.GripStatus
This enumeration provides status values concerning a grip operation.

Autodesk.AutoCAD.DatabaseServices.GripStatus.DimDataToBeDeleted
The application should delete any application data associated with the DynamicDimensionData object being deleted by AutoCAD.

Autodesk.AutoCAD.DatabaseServices.GripStatus.GripsToBeDeleted
The entity's grips are about to be deleted in the host application.

Autodesk.AutoCAD.DatabaseServices.GripStatus.GripsDone
The entity's grips have been deleted in the host application and the entity is no longer involved in any grip edit operations.