Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d
Represents a mathematical entity used to support different types of spline curves in 3D space.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double,System.Double)
Constructs polyline which approximates the input curve. Each vertex of the polyline lies on the input curve. The maximum distance from any point on any segment of the polyline to the input curve does not exceed eps.
curve: Any 3D curve.
fromParameter: Parameter value on curve.
toParameter: Parameter value on curve (must be larger than fromParam).
eps: Approximation distance.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3dCollection)
Constructs object representing a 3D polyline with attached vectors at each control point.
controlPoints: Control point array.
vectorBundle: Vector array.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3dCollection)
Constructs object by knots, control points, and vectors.
knots: Knot vector.
controlPoints: Control point array.
vectorBundle: Vector array.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.ApproximateTolerance
Gets or sets tolerance that was used to construct polyline if polyline was constructed to approximate a 3D curve.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.D2Vectors
Gets list of second derivative vectors at each point of the polyline.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.D1Vectors
Gets list of tangent vectors at each point of the polyline.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.Points
Gets list of points that define the polyline.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.Create(System.IntPtr,System.Boolean)
This method is provided for developers who require interoperability between their own unmanaged C++ objects and managed code.This method creates a new AugmentedPolylineCurve3d object from an unmanaged AcGeAugPolyline3d pointer.
unmanagedPointer: Pointer to unmanaged C++ objects.
autoDelete: true, the system automatically deletes the underlying object when it is no longer used by the wrapper.
Returns: A new AugmentedPolylineCurve3d object from an unmanaged AcGeAugPolyline3d pointer.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.GetPointAt(System.Int32)
Returns the point at the specified index.
index: Index of a point.
Returns: The point at the specified index.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.SetPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets point at the specified index to the input point.
index: Index of a point.
point: Point.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.GetVectorAt(System.Int32)
Returns a vector at the specified index.
index: Index of a vector.
Returns: A vector at the specified index.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.SetVectorAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector3d)
Resets vector at the specified index to the input vector.
index: Index of a vector.
point: Vector.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.GetD2VectorAt(System.Int32)
Returns second derivative vector at the specified index.
index: Index of a vector.
Returns: Second derivative vector at the specified index.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.SetD2VectorAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector3d)
Resets second derivative vector at the specified index to the input vector.
index: Index of a vector.
point: Vector.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.{dtor}
