Autodesk.AutoCAD.DatabaseServices.StdScaleType
The standard scale type.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1000To1
1000:1.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale100To1
100:1.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale10To1
10:1.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale8To1
8:1.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale4To1
4:1.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale2To1
2:1.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To100
1:100.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To50
1:50.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To40
1:40.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To30
1:30.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To20
1:20.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To16
1:16.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To10
1:10.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To8
1:8.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To4
1:4.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To2
1:2.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To1
1:1.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1ftIs1ft
1'= 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale6InchIs1ft
6"= 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale3InchIs1ft
3"= 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1InchIs1ft
1"= 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale3To4InchIs1ft
3/4" = 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To2InchIs1ft
1/2" = 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale3To8InchIs1ft
3/8" = 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To4InchIs1ft
1/4" = 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale3To16InchIs1ft
3/16"= 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To8InchIs1ft
1/8" = 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale3To32InchIs1ft
3/32"= 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To16InchIs1ft
1/16"= 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To32InchIs1ft
1/32"= 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To64InchIs1ft
1/64"= 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.StdScale1To128InchIs1ft
1/128"= 1'.

Autodesk.AutoCAD.DatabaseServices.StdScaleType.ScaleToFit
Scaled to Fit.