Autodesk.AutoCAD.GraphicsInterface.ShadowFlags
This is an enumeration of valid bitmasks for the current shadow display property for the drawing.

Autodesk.AutoCAD.GraphicsInterface.ShadowFlags.ShadowsIgnore
Indicates that new entities do not cast or receive shadows by default.

Autodesk.AutoCAD.GraphicsInterface.ShadowFlags.ShadowsDoesNotReceive
Indicates that new entities do not receive shadows by default.

Autodesk.AutoCAD.GraphicsInterface.ShadowFlags.ShadowsDoesNotCast
Indicates that new entities do not cast shadows by default.

Autodesk.AutoCAD.GraphicsInterface.ShadowFlags.ShadowsCastAndReceive
Indicates that new entities cast and receive shadows by default.