Autodesk.AutoCAD.DatabaseServices.DuplicateRecordCloning
DuplicateRecordCloning Enum.

Autodesk.AutoCAD.DatabaseServices.DuplicateRecordCloning.UnmangleName
Primarily used by RefEdit when it checks records back into the origin database. Any mangling done by MangleName is undone, and then it defaults to Ignore. In other words, if a duplicate is found after the mangling is removed, AutoCAD continues to use the existing record, and ignores the cloned one.

Autodesk.AutoCAD.DatabaseServices.DuplicateRecordCloning.MangleName
Mangle all the incoming record names using $0$.

Autodesk.AutoCAD.DatabaseServices.DuplicateRecordCloning.RefMangleName


Autodesk.AutoCAD.DatabaseServices.DuplicateRecordCloning.Replace
If a duplicate is found, replace it with the cloned record.

Autodesk.AutoCAD.DatabaseServices.DuplicateRecordCloning.Ignore
If a duplicate is found, ignore the clone, and continue to use the existing record in the destination database. This is how the INSERT command and Database.Insert() operate.

Autodesk.AutoCAD.DatabaseServices.DuplicateRecordCloning.NotApplicable
