Autodesk.AutoCAD.DatabaseServices.XrefNotificationStatus
Defines statuses for xref resolution notifications.

Autodesk.AutoCAD.DatabaseServices.XrefNotificationStatus.ResolvedUpdateAvailable
Indicates an xref has been resolved, but the file has been updated since was resolved and it should be reloaded.

Autodesk.AutoCAD.DatabaseServices.XrefNotificationStatus.ResolvedWithUpdate
Indicates an xref was resolved with a drawing that has been updated since the last time the reference drawing was saved.

Autodesk.AutoCAD.DatabaseServices.XrefNotificationStatus.ResolvedElsewhere
Indicates an xref was resolved with a drawing from a different location than the one specified by the block table record.

Autodesk.AutoCAD.DatabaseServices.XrefNotificationStatus.ResolvedMatch
Indicates an xref was resolved with a drawing as specified by the block table record.

Autodesk.AutoCAD.DatabaseServices.XrefNotificationStatus.None
Indicates no information available for xref notifications. This is the default status.