Autodesk.AutoCAD.DatabaseServices.XrefGraphNode
A derived class for representing an xref. Each XrefGraphNode represents one xref database.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.XrefNotificationStatus
Gets the node's xref notification status.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.XrefStatus
Gets the XrefStatus of this xref block.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.IsNested
Gets true if this node represents a nested xref that is not directly referenced in the host drawing.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.Database
Gets the database relevant to this node.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.BlockTableRecordId
Gets the Object ID of the BlockTableRecord associated with this node.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.Name
Gets the name for this node.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.{dtor}
