Autodesk.AutoCAD.GraphicsInterface.Linetype
Describes an enumeration representing the types of line patterns that can be displayed to represent an edge.

Autodesk.AutoCAD.GraphicsInterface.Linetype.SparseDot
Display edges with a sparse dotted line pattern.

Autodesk.AutoCAD.GraphicsInterface.Linetype.MediumLongDash
Display edges with a medium long dashed line pattern with transparency.

Autodesk.AutoCAD.GraphicsInterface.Linetype.DoubleLongDash
Display edges with a double long dashed line pattern.

Autodesk.AutoCAD.GraphicsInterface.Linetype.DoubleMediumDash
Display edges with a double medium dashed line pattern.

Autodesk.AutoCAD.GraphicsInterface.Linetype.DoubleShortDash
Display edges with a double short dashed line pattern.

Autodesk.AutoCAD.GraphicsInterface.Linetype.LongDash
Display edges with a long dashed line pattern.

Autodesk.AutoCAD.GraphicsInterface.Linetype.MediumDash
Display edges with a medium dashed line pattern with transparency.

Autodesk.AutoCAD.GraphicsInterface.Linetype.ShortDash
Display edges with a short dashed line pattern.

Autodesk.AutoCAD.GraphicsInterface.Linetype.Dotted
Display edges with a dotted line pattern.

Autodesk.AutoCAD.GraphicsInterface.Linetype.Dashed
Display edges with a dashed line pattern.

Autodesk.AutoCAD.GraphicsInterface.Linetype.Solid
Display edges with a solid line pattern.