Autodesk.AutoCAD.GraphicsSystem.RenderMode
The RenderMode enumerated type contains the values specifying how to render shading in a viewport. Each enumeration constant's name describes its mode.

Autodesk.AutoCAD.GraphicsSystem.RenderMode.GouraudShadedWithWireframe


Autodesk.AutoCAD.GraphicsSystem.RenderMode.FlatShadedWithWireframe


Autodesk.AutoCAD.GraphicsSystem.RenderMode.GouraudShaded


Autodesk.AutoCAD.GraphicsSystem.RenderMode.FlatShaded


Autodesk.AutoCAD.GraphicsSystem.RenderMode.HiddenLine


Autodesk.AutoCAD.GraphicsSystem.RenderMode.Wireframe


Autodesk.AutoCAD.GraphicsSystem.RenderMode.BoundingBox


Autodesk.AutoCAD.GraphicsSystem.RenderMode.DOptimized


Autodesk.AutoCAD.GraphicsSystem.RenderMode.None


Autodesk.AutoCAD.GraphicsSystem.RenderMode.Count
Gets the number of objects in the collection.
Returns: Returns a value representing the number of objects in the collection.