Autodesk.AutoCAD.DatabaseServices.PlotRotation
The rotation of the plot on the paper.

Autodesk.AutoCAD.DatabaseServices.PlotRotation.Degrees270
90 degrees clockwise.

Autodesk.AutoCAD.DatabaseServices.PlotRotation.Degrees180
Upside down.

Autodesk.AutoCAD.DatabaseServices.PlotRotation.Degrees090
90 degrees counterclockwise.

Autodesk.AutoCAD.DatabaseServices.PlotRotation.Degrees000
No rotation.