Autodesk.AutoCAD.DatabaseServices.BeginWblockEntireDatabaseEventArgs
Provides data for the BeginWblockEntireDatabase event of the database.

Autodesk.AutoCAD.DatabaseServices.BeginWblockEntireDatabaseEventArgs.From
Gets the database being wblocked.