Autodesk.AutoCAD.GraphicsSystem.DegradationChannel
This enumeration describes the degradation options for the Graphics System.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.Wireframe
Wireframe to Bounding box.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.LightingQuality
Lighting Quality Per-Vertex to Per-Face.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.DegradationChannels
This value indicates the number of degradation channels supported.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.Faceted
Faceted to Wireframe.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.IntersectEdges
Face Intersect Edges On to Off.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.Backgrounds
Backgrounds On to Off.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.Materials
Materials On to Off.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.Textures
Textures On to Off.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.FastSilhouette
Fast silhouettes On to Off.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.FacetEdges
Facet Edges to Isolines.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.EdgeStyles
Any Edge Style On to All Edge Styles Off.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.ShadowsGround
Ground Shadows to Shadows Off.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.DiscardBackfaces
Discard Backfaces Off to On.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.Transparency
Transparency On to Off.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.ShadowsFull
Full Shadows to Ground Shadows.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.TransparencyQuality
Transparency quality High to Medium then Medium to Low.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.Lighting
User lighting to Default lighting.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.LineAntialias
Line antialias On to Off.

Autodesk.AutoCAD.GraphicsSystem.DegradationChannel.ViewportDraw
Viewport draw objects On to Off.