Autodesk.AutoCAD.DatabaseServices.SweepOptionsAlignOption
Enumerates the alignment options for swept objects.

Autodesk.AutoCAD.DatabaseServices.SweepOptionsAlignOption.TranslatePathToSweepEntity


Autodesk.AutoCAD.DatabaseServices.SweepOptionsAlignOption.TranslateSweepEntityToPath


Autodesk.AutoCAD.DatabaseServices.SweepOptionsAlignOption.AlignSweepEntityToPath


Autodesk.AutoCAD.DatabaseServices.SweepOptionsAlignOption.NoAlignment
