Autodesk.AutoCAD.DatabaseServices.DBObject
The base class for all objects that reside in a Database object. This class provides all the functionality for database residency such as objectId, handle, ownership backpointer, filing, persistent event notification, xdata, deepClone, object state queries, erase, audit, etc. Many of these involve virtual method so that they can be overridden in classes derived from DBObject.

Autodesk.AutoCAD.DatabaseServices.DBObject.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DBObject.HasFields
Gets true if the object has one or more fields.

Autodesk.AutoCAD.DatabaseServices.DBObject.AcadObject
Gets a pointer to the COM object from the corresponding .NET object.

Autodesk.AutoCAD.DatabaseServices.DBObject.ClassID


Autodesk.AutoCAD.DatabaseServices.DBObject.ObjectBirthVersion
Gets the birth version of an object. The birth version is the version in which the class was introduced. This information needs to be specified when the class is registered with AutoCAD.

Autodesk.AutoCAD.DatabaseServices.DBObject.HasSaveVersionOverride
Gets or sets true if the object has the bit set to override the filer version.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsObjectIdsInFlux
Gets true when the cloned objects' IDs have not yet been translated and thus cannot be used in any operations on the objects.

Autodesk.AutoCAD.DatabaseServices.DBObject.UndoFiler
Gets the undo filer for the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsAProxy
Gets true if the object is a proxy object or entity.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsTransactionResident
Gets true if the object is currently part of a transaction.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsReallyClosing
Gets true if calling Close() at this time would really close the object completely.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsCancelling
Gets true if the object is currently in the middle of a Cancel() call (that is, an open is being canceled and all changes made are being rolled back).

Autodesk.AutoCAD.DatabaseServices.DBObject.IsUndoing
Gets true if the object is involved in an Undo operation at this time.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsNotifying
Gets true if the object is in the process of sending notification.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsNewObject
Gets true if the object has not yet been closed since it was first created.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsModifiedGraphics
Gets true if the object is derived from Entity and has had either an AssertWriteEnabled() called since it was opened (which would indicate that a member method that can change its data was called), or its RecordGraphicsModified() function called with a true argument value.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsModifiedXData
Gets true if the object has had an AssertWriteEnabled() called since it was opened (which would indicate that a member method that can change its data was called) and has then had its XData property called.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsModified
Gets true if the object has had an AssertWriteEnabled() called since it was opened (which would indicate that a member method that can change its data was called).

Autodesk.AutoCAD.DatabaseServices.DBObject.IsNotifyEnabled
Gets true if the object is currently open OpenMode.ForNotify.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsWriteEnabled
Gets true if the object is currently open OpenMode.ForWrite and is not currently sending notification.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsReadEnabled
Gets true if the object is currently open OpenMode.ForRead.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsErased
Gets true if the object is currently erased.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsEraseStatusToggled
Gets true if the object's erase bit has been toggled since it was opened.

Autodesk.AutoCAD.DatabaseServices.DBObject.XData
Gets or sets a linked list of ResultBuffer structures containing a copy of the xdata for the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.MergeStyle
Gets or sets the merge style of the dictionary.

Autodesk.AutoCAD.DatabaseServices.DBObject.ExtensionDictionary
Gets the objectId of the extension dictionary owned by the object. If the object does not own an extension dictionary, then the returned objectId is set to ObjectId.Null.

Autodesk.AutoCAD.DatabaseServices.DBObject.Drawable
Gets a pointer to the Drawable for the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.Database
Gets a pointer to the Database object that contains the DBObject.

Autodesk.AutoCAD.DatabaseServices.DBObject.Handle
Gets the object's handle value.

Autodesk.AutoCAD.DatabaseServices.DBObject.OwnerId
Gets or sets the objectId of the owner of the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.ObjectId
Gets the objectId of the object. If the object is not yet database-resident, then the returned objectId will be set to ObjectId.Null.

Autodesk.AutoCAD.DatabaseServices.DBObject.Id
Gets the database ID that corresponds to this object.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsPersistent
Gets true if the DBObject is database resident.

Autodesk.AutoCAD.DatabaseServices.DBObject.DeleteUnmanagedObject


Autodesk.AutoCAD.DatabaseServices.DBObject.Finalize


Autodesk.AutoCAD.DatabaseServices.DBObject.SetAttributes(Autodesk.AutoCAD.GraphicsInterface.DrawableTraits)
Takes the input DrawableTraits object and set the values for the current object's subentity traits.
traits: DrawableTraits object to be set.
Returns: With traits filled in with the calling objects subentity traits values.

Autodesk.AutoCAD.DatabaseServices.DBObject.WorldDraw(Autodesk.AutoCAD.GraphicsInterface.WorldDraw)
In response to WorldDraw(), a drawable uses the passed-in WorldDraw interface to describe its geometry that is sharable across viewports.
wd: WorldDraw interface.
Returns: False indicates that the 3D GS must call ViewportDraw() in order to obtain the complete geometry and attribute set for this drawable.

Autodesk.AutoCAD.DatabaseServices.DBObject.ViewportDraw(Autodesk.AutoCAD.GraphicsInterface.ViewportDraw)
In response to ViewportDraw(), a drawable uses the passed in ViewportDraw interface to describe its view-dependent geometry.
vd: ViewportDraw interface.

Autodesk.AutoCAD.DatabaseServices.DBObject.ViewportDrawLogicalFlags(Autodesk.AutoCAD.GraphicsInterface.ViewportDraw)
Entity implementers who desire view-independent ViewportDraw caching must provide a meaningful response to this method.
vd: ViewportDraw interface.
Returns: A combination of the Drawable SetAttributes flags.

Autodesk.AutoCAD.DatabaseServices.DBObject.DeepClone(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.IdMapping,System.Boolean)
Gives control of deep clone operations to the object. In the default implementation, the object is cloned and appended to the owner object.
ownerPointer: Object to which the clones should be appended.
idMap: Current object ID map.
isPrimary: Boolean indicating whether this object is primary or owned.
Returns: The cloned object, or null if not cloned.

Autodesk.AutoCAD.DatabaseServices.DBObject.WblockClone(Autodesk.AutoCAD.Runtime.RXObject,Autodesk.AutoCAD.DatabaseServices.IdMapping,System.Boolean)
Gives control of deep clone operations to the object.
ownerPointer: Object to which the clones should be appended. If the owner has not been cloned, then the Database must be passed in.
idMap: Current object ID map.
isPrimary: Boolean indicating whether this object is primary or owned.
Returns: The cloned object, or null if not cloned.

Autodesk.AutoCAD.DatabaseServices.DBObject.DecomposeForSave(Autodesk.AutoCAD.DatabaseServices.DwgVersion)
Is used to control saveasr13 and saveasr12 behavior for custom objects and entities. Custom objects can decompose themselves into other objects and can add additional xdata to the objects created.
version: DWG version being saved to.
Returns: The replacement for the object this method is called on.

Autodesk.AutoCAD.DatabaseServices.DBObject.ReleaseExtensionDictionary
Removes the object's extension dictionary (that is, removes the object as the owner of the dictionary object) if it exists and is empty. Once removed, this method calls the dictionary's Erase() method. Any events attached to the extension dictionary receive normal notification appropriate to an open for write, erase, close sequence.

Autodesk.AutoCAD.DatabaseServices.DBObject.UpgradeOpen
If the object is currently open OpenMode.ForRead with only one reader, then this method upgrades the object to open OpenMode.ForWrite. In the process of changing to open for write, the object is closed, thus triggering any pertinent event.

Autodesk.AutoCAD.DatabaseServices.DBObject.DowngradeOpen
Downgrades the object from being open OpenMode.ForWrite, to beingOpenMode.ForRead. In the process, all changes made to the object while it was open for write are committed to the database and appropriate event is sent.

Autodesk.AutoCAD.DatabaseServices.DBObject.DowngradeToNotify(System.Boolean)
Restores an object from being open both OpenMode.ForNotify and OpenMode.ForWrite, to being open just OpenMode.ForNotify.
wasWritable: Indicating if object was open for write when UpgradeFromNotify was called.

Autodesk.AutoCAD.DatabaseServices.DBObject.Cancel
Terminates the current open operation. All changes made to the object since it was opened are undone, the object is marked as closed, and "cancel" event is sent.

Autodesk.AutoCAD.DatabaseServices.DBObject.Close
Disposes of this wrapper object and closes the database object.

Autodesk.AutoCAD.DatabaseServices.DBObject.CloseAndPage(System.Boolean)
Closes the object and pages it if the object pager is turned on. All changes made to the object since it was opened are committed to the database, and "closed" event (as well as any other appropriate notification such as "modified", "erased", and so on) is sent.
onlyWhenClean: Boolean indicating to turn off or on undo recording.

Autodesk.AutoCAD.DatabaseServices.DBObject.Erase
This method calls the Erase(System.Boolean erasing) overloaded method with erasing set to true.

Autodesk.AutoCAD.DatabaseServices.DBObject.Erase(System.Boolean)
Sets the erase bit of the object. If erasing == true, then the erase bit is set on. If erasing == false, then the erase bit is set off.
erasing: Boolean indicating if object is to be erased or unerased.

Autodesk.AutoCAD.DatabaseServices.DBObject.HandOverTo(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean,System.Boolean)
Provides the ability to exchange a non-database-resident object (NDBRO) in place of an existing database-resident object (DBRO) while retaining the objectId, handle, and event list of the DBRO.
newPointer: Object to be used to replace the current object.
keepXData: Boolean indicating if xdata is to be transferred during the process.
keepExtensionDictionary: Boolean indicating whether the extension dictionary is passed on from the old object to the new one. If set to true, the extension dictionary will be passed on, otherwise it will be left behind.

Autodesk.AutoCAD.DatabaseServices.DBObject.SwapIdWith(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean,System.Boolean)
Swaps objectIds and handles between the object specified by otherId and the object invoking this method. Both objects must currently be database-resident and must reside in the same database.
otherId: ObjectId of object to swap with.
swapExtendedData: Boolean indicating whether to swap extended entity data.
swapExtensionDictionary: Boolean indicating whether to swap extension dictionaries.

Autodesk.AutoCAD.DatabaseServices.DBObject.SwapReferences(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Translate object ID references on the object using idMap.
idMap: Refedit ID map.

Autodesk.AutoCAD.DatabaseServices.DBObject.Audit(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
This method is called by AutoCAD when the AUDIT command is executed.
auditInfo: An AuditInfo object.

Autodesk.AutoCAD.DatabaseServices.DBObject.DwgIn(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
Does some internal bookkeeping, calls the object's DBObject.DwgInFields() method, and then reads in any xdata attached to the object. If the object's DwgInFields() method does not supermessage its parent class, or it returns an error status, then an assert is triggered.
filer: DWG filer to be used for this filing operation.

Autodesk.AutoCAD.DatabaseServices.DBObject.DwgInFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)


Autodesk.AutoCAD.DatabaseServices.DBObject.DwgOut(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
Does some internal bookkeeping, calls the object's DBObject.DwgOutFields() method, and then reads in any xdata attached to the object. If the object's DwgOutFields() method does not supermessage its parent class, or it returns an error status, then an assert is triggered.
filer: DWG filer to be used for this filing operation.

Autodesk.AutoCAD.DatabaseServices.DBObject.DwgOutFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)


Autodesk.AutoCAD.DatabaseServices.DBObject.DxfIn(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
Does some internal book keeping by reading in any xdata that comes before the main entity data.The DxfIn method then calls the object's DBObject.DxfInFields() method, and then reads in any xdata that comes after the entity data.
filer: DXF filer to be used for this filing operation.

Autodesk.AutoCAD.DatabaseServices.DBObject.DxfInFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)


Autodesk.AutoCAD.DatabaseServices.DBObject.DxfOut(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
Does some internal book keeping by reading in any xdata that comes before the main entity data.The DxfOut method then calls the object's DBObject.DxfOutFields() method, and then reads in any xdata that comes after the entity data.
filer: DXF filer to be used for this filing operation.

Autodesk.AutoCAD.DatabaseServices.DBObject.DxfOutFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)


Autodesk.AutoCAD.DatabaseServices.DBObject.XDataTransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
This method applies the transform transformation matrix to any XData data types 1011, 1021, 1031, 1012, 1022, 1032, 1013, 1023, 1033, 1041, and 1042 in the object's XData.
transform: Transformation matrix to be applied to the XData.

Autodesk.AutoCAD.DatabaseServices.DBObject.GetXDataForApplication(System.String)
Returns a linked list of Result Buffer structures containing a copy of the xdata for the object. If applicationName == null is passed in, all xdata is returned, otherwise only the xdata for the specified name is returned. If not all xdata is required, but the xdata for more than one RegappName is desired, then multiple calls to this member function must be made--one for each RegappName.
applicationName: Regapp name to get the xdata for.
Returns: A linked list of Result Buffer structures containing a copy of the xdata for the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.AssertReadEnabled


Autodesk.AutoCAD.DatabaseServices.DBObject.AssertWriteEnabled(System.Boolean,System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DBObject.AssertNotifyEnabled


Autodesk.AutoCAD.DatabaseServices.DBObject.DisableUndoRecording(System.Boolean)


Autodesk.AutoCAD.DatabaseServices.DBObject.ApplyPartialUndo(Autodesk.AutoCAD.DatabaseServices.DwgFiler,Autodesk.AutoCAD.Runtime.RXClass)
This method is called by AutoCAD whenever an Undo operation is performed on the DBObject object and the object has consistently set the autoUndo Boolean in all AssertWriteEnabled() calls to false, thus indicating that it's using the partial undo mechanism.
undoFiler: Passed in the undo filer containing the partial undo information to be re-instated.
classObj: The RXClass object for the class that is expected to be handling this Undo information.

Autodesk.AutoCAD.DatabaseServices.DBObject.HasPersistentReactor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if objId is the object ID of a reactor attached to this object.
objId: Object ID of a persistent reactor object.
Returns: True if objId is the object ID of a reactor attached to this object.

Autodesk.AutoCAD.DatabaseServices.DBObject.GetReactors
Returns an array object containing the reactors attached to the object.
Returns: An array object containing the reactors attached to the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.GetPersistentReactorIds
Returns an array object containing the persistent reactors attached to the object.
Returns: An array object containing the persistent reactors attached to the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.SetObjectIdsInFlux
This method must be called on any newly created objects in DBObject.DeepClone or DBObject.WblockClone. It indicates that reference object IDs are not yet pointing to the correct objects. The references can be translated only when the entire deep clone operation is complete. The flag is cleared at that time.

Autodesk.AutoCAD.DatabaseServices.DBObject.GetObjectSaveVersion(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
Override this method to specify which version the object data needs to be stored in. This does not require super-messaging.
filer: DXF filer to be used for this filing operation.
Returns: Version number.

Autodesk.AutoCAD.DatabaseServices.DBObject.GetObjectSaveVersion(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
Override this method to specify which version the object data needs to be stored in. This does not require super-messaging.
filer: DWG filer to be used for this filing operation.
Returns: Version number.

Autodesk.AutoCAD.DatabaseServices.DBObject.FromAcadObject(System.Object)
Gets the .NET object from the COM object.
sun: A sun object.
Returns: The .NET object from the COM object.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsCustomObject(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if id is the objectId of an object of a custom class(that is, not a class built into AutoCAD).
id: ObjectId of the object in question.
Returns: True if id is the objectId of an object of a custom class.

Autodesk.AutoCAD.DatabaseServices.DBObject.SetField(System.String,Autodesk.AutoCAD.DatabaseServices.Field)
A field can be stored in an object using the property name as the key. The object should be in database for this method to succeed. If the field is not yet posted to the database, it will be posted to the database. If the field is already in database, it should be opened for write. After calling this method, the field object must be closed.
propertyName: Property name for which to set the field.
field: Field to set.
Returns: Reference to receive the field ID.

Autodesk.AutoCAD.DatabaseServices.DBObject.SetField(Autodesk.AutoCAD.DatabaseServices.Field)
A field can be stored in an object using the property name as the key. The object should be in database for this method to succeed. If the field is not yet posted to the database, it will be posted to the database. If the field is already in database, it should be opened for write. After calling this method, the field object must be closed.
field: Field to set.
Returns: Reference to receive the field ID.

Autodesk.AutoCAD.DatabaseServices.DBObject.RemoveField(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the specified field.
id: Field ID to remove from the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.RemoveField(System.String)
Removes the specified field.
propertyName: Property name whose field is to be removed.
Returns: Reference to receive the removed field ID.

Autodesk.AutoCAD.DatabaseServices.DBObject.RemoveField
Removes the specified field.
Returns: Reference to receive the removed field ID.

Autodesk.AutoCAD.DatabaseServices.DBObject.{dtor}
