Autodesk.AutoCAD.Windows.DockSides
Represents values that indicate the current docked site or the potential dock sites for a window.

Autodesk.AutoCAD.Windows.DockSides.None


Autodesk.AutoCAD.Windows.DockSides.Bottom


Autodesk.AutoCAD.Windows.DockSides.Right


Autodesk.AutoCAD.Windows.DockSides.Top


Autodesk.AutoCAD.Windows.DockSides.Left
