Autodesk.AutoCAD.PlottingServices.PlotProgressDialog
This class implements a default plot progress dialog supplied as part of the ObjectARX SDK.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.#ctor(System.Boolean,System.Int32,System.Boolean)
Constructor.
isPreview: Indicating whether to create a plot progress dialog for preview.
sheetCount: Number of sheets; creates a plot progress dialog to handle single-sheet plots by default.
showCancelSheetButton: Indicating whether the Cancel Sheet button is shown in the plot progress dialog (the default).

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.IsSingleSheetPlot
Gets true if the plot progress dialog was created to handle single-sheet plots and previews.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.PlotMsgString(Autodesk.AutoCAD.PlottingServices.PlotMessageIndex)
Getsor sets the strings that appear in different UI controls of the plot progress dialog.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.OnBeginPlot
Clients of the plot progress dialog would fire this event before beginning to plot using the plot engine. The default implementation resets the plot and sheet status.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.OnEndPlot
Clients of the plot progress dialog would fire this event after the end of the plot process using the plot engine. The default implementation closes the plot progress dialog and the associated UI thread object.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.OnBeginSheet
Clients of the plot progress dialog would fire this event before beginning to plot a sheet using the plot engine. The default implementation resets the sheet status and restores the UI from the previous canceled state (if the previous sheet plot was canceled).

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.OnEndSheet
Clients of the plot progress dialog would fire this event after the end of a sheet plot process using the plot engine.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.{dtor}
