Autodesk.AutoCAD.EditorInput.Camera
The Camera entity represents a named view in model space. Camera entities are not persisted into the drawing file. A Camera entity is created when the CAMERADISPLAY sysvar is set to 1. When a named view is deleted its corresponding camera is also deleted, and vice versa.

Autodesk.AutoCAD.EditorInput.Camera.ViewId
Gets the corresponding named view associated with this camera object.

Autodesk.AutoCAD.EditorInput.Camera.{dtor}
