Autodesk.AutoCAD.EditorInput.Editor
AutoCAD drawing editor.

Autodesk.AutoCAD.EditorInput.Editor.MouseHasMoved
Gets boolean to indicate if the mouse has moved.

Autodesk.AutoCAD.EditorInput.Editor.CurrentUserCoordinateSystem
Gets or sets the current UCS from the 3D matrix. The first row of the matrix is the UCS X-axis (in WCS coordinates), the second row is the UCS Y-axis, and the third row is the UCS Z-axis.

Autodesk.AutoCAD.EditorInput.Editor.UseCommandLineInterface
Gets boolean to indicate if using CommandLine Interface.

Autodesk.AutoCAD.EditorInput.Editor.IsDragging
Gets boolean to indicates whether dragging is occurring in AutoCAD's editor.

Autodesk.AutoCAD.EditorInput.Editor.IsQuiescent
Gets true if there is no command, LISP script, or ARX command active; otherwise, it gets false.

Autodesk.AutoCAD.EditorInput.Editor.CurrentViewportObjectId
Gets the ObjectId of the current Viewport entity (it does not work with ViewportTableRecords). If TILEMODE is 1, then there is no Viewport entity current so it will return ObjectId.Null.

Autodesk.AutoCAD.EditorInput.Editor.Document
Gets the document that this editor belongs to.

Autodesk.AutoCAD.EditorInput.Editor.GetViewportNumber(System.Drawing.Point)
Provide coordinates in AutoCAD drawing window (in client coordinates) and this method will return the viewport number the coordinates correspond to.
point: Windows client coordinates.
Returns: The viewport number based on Windows client coordinates.

Autodesk.AutoCAD.EditorInput.Editor.PointToScreen(Autodesk.AutoCAD.Geometry.Point3d,System.Int32)
Converts coordinates in given viewport to Windows screen coordinates.
pt: AutoCAD drawing window coordinates in Windows' client coordinates. The origin is at upper left corner.
viewportNumber: Viewport number.
Returns: AutoCAD drawing window coordinates in Windows' client coordinates.

Autodesk.AutoCAD.EditorInput.Editor.PointToWorld(System.Drawing.Point,System.Int32)
Converts coordinates from AutoCAD drawing window to current active viewport's coordinates.
pt: AutoCAD drawing window coordinates in Windows' client coordinates. The origin is at upper left corner.
viewportNumber: Viewport number.
Returns: AutoCAD coordinates at given client coordinates. The origin is at lower left corner. The Z coordinate value is always zero.

Autodesk.AutoCAD.EditorInput.Editor.PointToWorld(System.Drawing.Point)
Converts coordinates from AutoCAD drawing window to current active viewport's coordinates.
pt: AutoCAD drawing window coordinates in Windows' client coordinates. The origin is at upper left corner.
Returns: AutoCAD coordinates at given client coordinates. The origin is at lower left corner. The Z coordinate value is always zero.

Autodesk.AutoCAD.EditorInput.Editor.WriteMessage(System.String,System.Object[])
Displays a message on the AutoCAD text screen.
message: Contents to be displayed.
parameter: Format string.

Autodesk.AutoCAD.EditorInput.Editor.WriteMessage(System.String)
Displays a message on the AutoCAD text screen.
message: Contents to be displayed.

Autodesk.AutoCAD.EditorInput.Editor.GetSelection(Autodesk.AutoCAD.EditorInput.PromptSelectionOptions,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Gets a selection set using the supplied prompt selection options and the supplied filter.
options: Selection options.
filter: Selection filter.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.GetSelection(Autodesk.AutoCAD.EditorInput.PromptSelectionOptions)
Gets a selection set using the supplied prompt selection options and no filter.
options: Selection options.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.GetSelection(Autodesk.AutoCAD.EditorInput.SelectionFilter)
Gets a selection set using the supplied filter.
filter: Selection filter.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.GetSelection
Gets a selection set.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectAll(Autodesk.AutoCAD.EditorInput.SelectionFilter)
Select all objects from the screen using the supplied filter.
filter: Selection filter.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectAll
Select all objects from the screen.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectCrossingWindow(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Selects objects within and crossing a rectangular area whose corners are defined by pt1 and pt2 using the supplied filter.
pt1: The 3D WCS coordinates.
pt2: The 3D WCS coordinates.
filter: Selection filter.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectCrossingWindow(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Selects objects within and crossing a rectangular area whose corners are defined by pt1 and pt2.
pt1: The 3D WCS coordinates.
pt2: The 3D WCS coordinates.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectCrossingPolygon(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Selects objects within and crossing an area defined by a polygon using the supplied filter.
polygon: An array of 3D WCS coordinates specifying the selection polygon.
filter: Selection filter.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectCrossingPolygon(Autodesk.AutoCAD.Geometry.Point3dCollection)
Selects objects within and crossing an area defined by a polygon.
polygon: An array of 3D WCS coordinates specifying the selection polygon.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectFence(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Selects all objects crossing a selection fence using the supplied filter. The fence is defined by coordinates in fence.
fence: An array of 3D WCS coordinates specifying the selection fence.
filter: Selection filter.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectFence(Autodesk.AutoCAD.Geometry.Point3dCollection)
Selects all objects crossing a selection fence. The fence is defined by coordinates in fence.
fence: An array of 3D WCS coordinates specifying the selection fence.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectWindow(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Selects all objects completely inside a rectangular area whose corners are defined by pt1 and pt2 using the supplied filter.
pt1: The 3D WCS coordinates.
pt2: The 3D WCS coordinates.
filter: Selection filter.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectWindow(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Selects all objects crossing a selection fence. The fence is defined by coordinates in fence.
pt1: The 3D WCS coordinates.
pt2: The 3D WCS coordinates.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectWindowPolygon(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Selects objects within a polygon defined by polygon using the supplied filter.
polygon: An array of 3D WCS coordinates specifying the polygon.
filter: Selection filter.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectWindowPolygon(Autodesk.AutoCAD.Geometry.Point3dCollection)
Selects objects within a polygon defined by polygon.
polygon: An array of 3D WCS coordinates specifying the polygon.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectImplied
Selects the current PICKFIRST set.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectLast
Selects the most recently created visible objects.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectPrevious
Selects the most recent selection set. This mode is ignored if you switch between paper space and model space and attempt to use the selection set.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.DoPrompt(Autodesk.AutoCAD.EditorInput.PromptOptions)
Carries out a prompt with the specified options.
opt: Options for the prompt.
Returns: The result of the prompt operation.

Autodesk.AutoCAD.EditorInput.Editor.GetInteger(Autodesk.AutoCAD.EditorInput.PromptIntegerOptions)
Gets user input for an integer using the supplied prompt selection options.
options: Selection options.
Returns: The entered integer.

Autodesk.AutoCAD.EditorInput.Editor.GetInteger(System.String)
Gets user input for an integer.
message: Message to be displayed to the user during the prompt.
Returns: The entered integer.

Autodesk.AutoCAD.EditorInput.Editor.GetDouble(Autodesk.AutoCAD.EditorInput.PromptDoubleOptions)
Gets user input for a real value using the supplied prompt selection options.
options: Selection options.
Returns: The entered real number.

Autodesk.AutoCAD.EditorInput.Editor.GetDouble(System.String)
Gets user input for a linear distance.
message: Message to be displayed to the user during the prompt.
Returns: The entered real number.

Autodesk.AutoCAD.EditorInput.Editor.GetDistance(Autodesk.AutoCAD.EditorInput.PromptDistanceOptions)
Gets user input for a linear distance using the supplied prompt selection options.
options: Selection options.
Returns: The distance entered by the user.

Autodesk.AutoCAD.EditorInput.Editor.GetDistance(System.String)
Gets user input for a linear distance.
message: Message to be displayed to the user during the prompt.
Returns: The distance entered by the user.

Autodesk.AutoCAD.EditorInput.Editor.GetAngle(Autodesk.AutoCAD.EditorInput.PromptAngleOptions)
Gets user input for an angle using the supplied prompt selection options, taking into account the current value of the ANGBASE system variable.
options: Selection options.
Returns: Angle selected by the user in radians.

Autodesk.AutoCAD.EditorInput.Editor.GetAngle(System.String)
Gets user input for an angle, taking into account the current value of the ANGBASE system variable.
message: Message to be displayed to the user during the prompt.
Returns: Angle selected by the user in radians.

Autodesk.AutoCAD.EditorInput.Editor.GetPoint(Autodesk.AutoCAD.EditorInput.PromptPointOptions)
Gets user input for a point using the supplied prompt selection options.
options: Selection options.
Returns: Entered 3D point.

Autodesk.AutoCAD.EditorInput.Editor.GetPoint(System.String)
Gets user input for a point.
message: Message to be displayed to the user during the prompt.
Returns: Entered 3D point.

Autodesk.AutoCAD.EditorInput.Editor.GetCorner(Autodesk.AutoCAD.EditorInput.PromptCornerOptions)
Gets user input for the corner of a rectangle using the supplied prompt selection options.
options: Selection options.
Returns: Point selected by the user, a memory area large enough to store three double-precision floating-point numbers.

Autodesk.AutoCAD.EditorInput.Editor.GetCorner(System.String,Autodesk.AutoCAD.Geometry.Point3d)
Gets user input for the corner of a rectangle.
message: Message to be displayed to the user during the prompt.
basePoint: First corner of the rectangle being selected.
Returns: Point selected by the user, a memory area large enough to store three double-precision floating-point numbers.

Autodesk.AutoCAD.EditorInput.Editor.GetKeywords(Autodesk.AutoCAD.EditorInput.PromptKeywordOptions)
Gets user input for a keyword using the supplied prompt selection options.
options: Selection options.
Returns: Holds the entered keyword (maximum 131 characters).

Autodesk.AutoCAD.EditorInput.Editor.GetKeywords(System.String,System.String[])
Gets user input for a keyword.
message: Message to be displayed to the user during the prompt.
globalKeywords: Keywords from which the user is prompted to choose.
Returns: Holds the entered keyword (maximum 131 characters).

Autodesk.AutoCAD.EditorInput.Editor.GetString(Autodesk.AutoCAD.EditorInput.PromptStringOptions)
Gets user input for a string using the supplied prompt selection options.
options: Selection options.
Returns: Holds the entered string.

Autodesk.AutoCAD.EditorInput.Editor.GetString(System.String)
Gets user input for a string.
message: Message to be displayed to the user during the prompt.
Returns: Holds the entered string.

Autodesk.AutoCAD.EditorInput.Editor.GetEntity(Autodesk.AutoCAD.EditorInput.PromptEntityOptions)
Prompts the user to select an entity using the supplied prompt selection options.
options: Selection options.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.GetEntity(System.String)
Prompts the user to select an entity.
message: Message to be displayed to the user during the prompt.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.GetNestedEntity(Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions)
Gets the name of an entity selected by the user using the supplied prompt selection options.
options: Selection options.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.GetNestedEntity(System.String)
Gets the name of an entity selected by the user.
options: Selection options.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForOpen(Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions)
This method emulates the subtleties of AutoCAD file prompting. It properly prompts on the command line when FILEDIA is zero, or if a script or an AutoLISP routine is running.
options: Options.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForOpen(System.String)
This method emulates the subtleties of AutoCAD file prompting. It properly prompts on the command line when FILEDIA is zero, or if a script or an AutoLISP routine is running.
options: Options.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForSave(Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions)
This method emulates the subtleties of AutoCAD file prompting. It properly prompts on the command line when FILEDIA is zero, or if a script or an AutoLISP routine is running.
options: Selection options.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForSave(System.String)
This method emulates the subtleties of AutoCAD file prompting. It properly prompts on the command line when FILEDIA is zero, or if a script or an AutoLISP routine is running.
options: Selection options.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.Drag(Autodesk.AutoCAD.EditorInput.PromptDragOptions)
Prompts the user to modify a selection set by graphically dragging its entities.
options: Selection options.
Returns: The selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.Drag(Autodesk.AutoCAD.EditorInput.SelectionSet,System.String,Autodesk.AutoCAD.EditorInput.DragCallback)


Autodesk.AutoCAD.EditorInput.Editor.Drag(Autodesk.AutoCAD.EditorInput.Jig)
Starts a Jig operation.
jig: The jig to drag.
Returns: The outcome of the Jig operation.

Autodesk.AutoCAD.EditorInput.Editor.UpdateScreen
Causes AutoCAD to update its display screen. The update is essentially a repaint of the AutoCAD graphics window with what AutoCAD's display engine has cached as the window's image.

Autodesk.AutoCAD.EditorInput.Editor.UpdateTiledViewportsInDatabase
For the currenlty active drawing, this method copies the data from the ViewportTableRecords with the name "*ACTIVE" over into the corresponding displayed viewports creating or removing display viewports if necessary. This method will result in a regen in all viewports.

Autodesk.AutoCAD.EditorInput.Editor.UpdateTiledViewportsFromDatabase
For the currently active drawing, this method copies the displayed viewport data over into the corresponding ViewportTableRecords (those with the name "*ACTIVE"), creating or erasing "*ACTIVE" ViewportTableRecords as necessary.

Autodesk.AutoCAD.EditorInput.Editor.StartUserInteraction(System.Windows.Forms.Control)
Returns a new EditorUserInteraction object.
modalForm: The jig to drag.
Returns: A new EditorUserInteraction object.

Autodesk.AutoCAD.EditorInput.Editor.TurnForcedPickOn
This method will cause the AutoCAD input event mechanism to do a pick under the prevailing pick aperture on all digitizer events, regardless of whether a point is being acquired or whether any OSNAP modes are currently active.
Returns: A count.

Autodesk.AutoCAD.EditorInput.Editor.TurnForcedPickOff
Decrements the forced pick counter, and if the counter hits 0, disables forced picking, which means entity picking occurs under normal AutoCAD conditions, such as when input points are being acquired and an OSNAP mode is active, or normal entity selection operations.

Autodesk.AutoCAD.EditorInput.Editor.SwitchToModelSpace
When called in a layout, this method switches the editor to model space.

Autodesk.AutoCAD.EditorInput.Editor.SwitchToPaperSpace
When called in a layout, this method switches the editor to paper space.

Autodesk.AutoCAD.EditorInput.Editor.SetImpliedSelection(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets which objects are selected and gripped.
selectedObjects: Set of entities to be added to the pickfirst selection set and on which grips will be displayed.

Autodesk.AutoCAD.EditorInput.Editor.GetCurrentView
Gets the current Viewport entity (it does not work with ViewportTableRecords).
Returns: The current Viewport entity.

Autodesk.AutoCAD.EditorInput.Editor.SetCurrentView(Autodesk.AutoCAD.DatabaseServices.ViewTableRecord)
Uses the information from the ViewTableRecord value to set the view.
value: ViewTableRecord to read data from.

Autodesk.AutoCAD.EditorInput.Editor.DrawVectors(Autodesk.AutoCAD.DatabaseServices.ResultBuffer,Autodesk.AutoCAD.Geometry.Matrix3d)
Draws multiple vectors on the graphics screen.
rb: List of result buffers that specify the vectors to draw.
transform: 4 x 4 transformation matrix that DrawVectors() applies to the vectors before displaying them; if null, defaults to the identity matrix.

Autodesk.AutoCAD.EditorInput.Editor.DrawVector(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.Int32,System.Boolean)
Draws a vector between two points in the current viewport.
from: Beginning point of the vector, expressed in the current UCS; can be a three-dimensional point.
to: End point of the vector, expressed in the current UCS; can be a three-dimensional point.
color: Vector's AutoCAD color number (in the range 0-255); I -1, the vector is drawn in XOR ink, which complements anything it draws over and erases itself when overdrawn.
drawHighlighted: Boolean indicates whether the vector is highlighted.

Autodesk.AutoCAD.EditorInput.Editor.Regen
Regenerates the entire drawing and recomputes the screen coordinates and view resolution for all objects.

Autodesk.AutoCAD.EditorInput.Editor.Snap(System.String,Autodesk.AutoCAD.Geometry.Point3d)
Finds a point by means of object snap.
snapMode: Mode applied by Object Snap; one or more comma-separated Object Snap identifiers, spelled as they are at the AutoCAD prompt line (abbreviations are allowed).
input: Three-dimensional reference point.
Returns: Resulting closest three-dimensional point.

Autodesk.AutoCAD.EditorInput.Editor.PromptForEntityEnding
Provides notification for entsel-style entity selection like the BREAK, TRIM, and FILLET commands, or LISP (entsel).

Autodesk.AutoCAD.EditorInput.Editor.PromptedForSelection
Provides notification for the end of an AutoCAD selection set acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptForSelectionEnding
Provides notification for the end of an AutoCAD selection set acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.SelectionRemoved
Provides notification of the removal of some entities from the selection set.

Autodesk.AutoCAD.EditorInput.Editor.SelectionAdded
Provides notification of a subselection.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForSelection
Provides notification for the start of an AutoCAD selection set acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.LeavingQuiescentState
Provides notification for the end of an AutoCAD quiescent state.

Autodesk.AutoCAD.EditorInput.Editor.EnteringQuiescentState
Provides notification for the start of an AutoCAD quiescent state.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForNestedEntity
Provides notification for the end of an AutoCAD nentsel acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForNestedEntity
Provides notification for the start of an AutoCAD nentsel acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForEntity
Provides notification for the end of an AutoCAD entity selection operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForEntity
Provides notification for the start of an AutoCAD entity selection operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForDouble
Provides notification for the end of an AutoCAD floating point value acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForDouble
Provides notification for the start of an AutoCAD floating point acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForInteger
Provides notification for the end of an AutoCAD integer acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForInteger
Provides notification for the start of an AutoCAD integer acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForKeyword
Provides notification for the end of an AutoCAD key word acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForKeyword
Provides notification for the start of an AutoCAD key word acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForString
Provides notification for the end of an AutoCAD string acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForString
Provides notification for the start of an AutoCAD string acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForCorner
Provides notification for the end of an AutoCAD corner acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForCorner
Provides notification for the start of an AutoCAD corner acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForDistance
Provides notification for the end of an AutoCAD distance acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForDistance
Provides notification for the start of an AutoCAD distance acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForAngle
Provides notification for the end of an AutoCAD angle acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForAngle
Provides notification for the start of an AutoCAD angle acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForPoint
Provides notification for the end of an AutoCAD point acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForPoint
Provides notification for the start of an AutoCAD point acquisition operation.