Autodesk.AutoCAD.Windows.PaletteSetStateEventArgs
Provides data for the PaletteSetState event.

Autodesk.AutoCAD.Windows.PaletteSetStateEventArgs.#ctor(Autodesk.AutoCAD.Windows.StateEventIndex)


Autodesk.AutoCAD.Windows.PaletteSetStateEventArgs.NewState
