Autodesk.AutoCAD.ApplicationServices.TransactionManager
Uses to start, end, or terminate transactions. In addition, it provides functionality to manage transactions and the objects within them.

Autodesk.AutoCAD.ApplicationServices.TransactionManager.TopTransaction
Gets the TopTransaction property value.

Autodesk.AutoCAD.ApplicationServices.TransactionManager.EnableGraphicsFlush(System.Boolean)
Toggles the graphics generation for AutoCAD.
doEnable: Boolean indicating whether to turn on or off graphics flush.

Autodesk.AutoCAD.ApplicationServices.TransactionManager.FlushGraphics
Flushes the graphics queue to the display.

Autodesk.AutoCAD.ApplicationServices.TransactionManager.StartTransaction
Creates a new Transaction object, adds this new transaction to the list of current transactions making it the new top transaction, then returns the new Transaction object.
Returns: The new Transaction object.

Autodesk.AutoCAD.ApplicationServices.TransactionManager.{dtor}
