Autodesk.AutoCAD.Publishing.EPlotAttributeCollection
Contains a collection of Publishing.EPlotAttribute objects.

Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.Item(System.Int32)


Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.Count


Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.SyncRoot


Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.IsSynchronized


Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.GetEnumerator


Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.CopyTo(System.Array,System.Int32)


Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.Add(Autodesk.AutoCAD.Publishing.EPlotAttribute)


Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.Clear
