Autodesk.AutoCAD.Windows.PaletteActivatedEventArgs
Provides data for the PaletteActivated event.

Autodesk.AutoCAD.Windows.PaletteActivatedEventArgs.#ctor(Autodesk.AutoCAD.Windows.Palette,Autodesk.AutoCAD.Windows.Palette)


Autodesk.AutoCAD.Windows.PaletteActivatedEventArgs.Deactivated


Autodesk.AutoCAD.Windows.PaletteActivatedEventArgs.Activated
