Autodesk.AutoCAD.Windows.ToolPalette.IPerPropertyBrowsing
It is typically used by property inspectors, such as the Properties palette, to display property pages for objects that provide them. IPerPropertyBrowsing serves two basic functions. The first is to associate a property page or other dialog box with a particular property via an ellipsis button on the Properties palette dialog box. The second is to support custom property drop-down lists in the Properties palette control.

Autodesk.AutoCAD.Windows.ToolPalette.IPerPropertyBrowsing.GetDisplayString(System.Int32,System.String@)


Autodesk.AutoCAD.Windows.ToolPalette.IPerPropertyBrowsing.MapPropertyToPage(System.Int32,System.Guid@)


Autodesk.AutoCAD.Windows.ToolPalette.IPerPropertyBrowsing.GetPredefinedStrings(System.Int32,Autodesk.AutoCAD.Windows.ToolPalette.tagCALPOLESTR@,Autodesk.AutoCAD.Windows.ToolPalette.tagCADWORD@)


Autodesk.AutoCAD.Windows.ToolPalette.IPerPropertyBrowsing.GetPredefinedValue(System.Int32,System.UInt32,System.Object@)
