Autodesk.AutoCAD.Windows.ToolPalette.ImageInfo
Container for information that is used to load an Image object's image.

Autodesk.AutoCAD.Windows.ToolPalette.ImageInfo.#ctor(System.Drawing.Size,System.String,System.String)
Constructor.
size: The resource identifier of the image if the image is a resource image.
resourceName: Name of the Configuration Section.
resourceFile: The name of the resource DLL if the image is from a resource file;URL of the image file if the image is not a resource image,the URL can be either a relative or an absolute path.

Autodesk.AutoCAD.Windows.ToolPalette.ImageInfo.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.ImageInfo.ResourceFile
Gets the name of the resource DLL if the image is from a resource file;Gets URL of the image file if the image is not a resource image,the URL can be either a relative or an absolute path.

Autodesk.AutoCAD.Windows.ToolPalette.ImageInfo.ResourceName
Gets the resource identifier of the image if the image is a resource image. Empty if the image refers to an image file.

Autodesk.AutoCAD.Windows.ToolPalette.ImageInfo.Size
Gets the size of the image.