Autodesk.AutoCAD.EditorInput.PromptStatus
These values can be directly interchanged with GetXxxx() method return statuses.

Autodesk.AutoCAD.EditorInput.PromptStatus.None
No result.

Autodesk.AutoCAD.EditorInput.PromptStatus.Cancel
User canceled the request with a CTRL-C.

Autodesk.AutoCAD.EditorInput.PromptStatus.Keyword
Keyword returned from a "get" routine.

Autodesk.AutoCAD.EditorInput.PromptStatus.Other


Autodesk.AutoCAD.EditorInput.PromptStatus.Modeless


Autodesk.AutoCAD.EditorInput.PromptStatus.OK
Request succeeded.

Autodesk.AutoCAD.EditorInput.PromptStatus.Error
Nonspecific error.