Autodesk.AutoCAD.EditorInput.PromptAngleOptions
Represents optional parameters for a prompt for an angle.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:
globalKeywords:

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.#ctor(System.String)
Constructor.
message:

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.UseAngleBase
Gets or sets whether the angle base is to be used.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.UseDefaultValue
Gets or sets whether the prompt should use the default value when the user presses ENTER without any other input. The property allowing client code to set the default value is declared by derived classes.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.DefaultValue
Gets or sets the default value to be used when the user presses ENTER without any other input.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.DoIt
Gets or sets whether the prompt accepts ENTER as sole input.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.GetDefaultValueString
