Autodesk.AutoCAD.ApplicationServices.DocumentCollectionEventArgs
Provides data for various events of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentCollectionEventArgs.Document
Gets the document that the input database belongs to.