Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.OpenGlobalSection
Opens the product's root key in the HKEY_CURRENT_USER section of the registry.
Returns: The HKEY_CURRENT_USER section of the registry.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.OpenCurrentProfile
This method attempts to open the registry section corresponding the current user profile.
Returns: The registry section corresponding the current user profile.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.OpenDialogSection(System.Object)
This method attempts to open the registry section corresponding the input dialog name in the current user profile.
dialog: Dialog name whose registry entry is to be retrieved.
Returns: The registry section corresponding the input dialog name in the current user profile.