Autodesk.AutoCAD.Windows.PaletteSetStyles
Represents palette set styles.

Autodesk.AutoCAD.Windows.PaletteSetStyles.ShowCloseButton
The palette set has a close button, which is displayed in the palette set caption.

Autodesk.AutoCAD.Windows.PaletteSetStyles.UsePaletteNameAsTitleForSingle
The palette name will be displayed in the palette set title bar instead of the palette set name when the palette set contains only one palette.

Autodesk.AutoCAD.Windows.PaletteSetStyles.ShowTabForSingle
A tab is displayed for the palette when there is only one palette in the palette set.

Autodesk.AutoCAD.Windows.PaletteSetStyles.Snappable
The palette set will snap to the edges of the application and other palette sets; palette sets will always snap to display edges, regardless of this style.

Autodesk.AutoCAD.Windows.PaletteSetStyles.NameEditable
The palette set name is editable and the default palette set implementation of renaming should be used; if this style is not set on the palette set, it is the derived class's responsibility to handle renaming if it wishes to support it.

Autodesk.AutoCAD.Windows.PaletteSetStyles.ShowPropertiesMenu
The palette set has a properties menu, whose button is displayed in the palette set caption.

Autodesk.AutoCAD.Windows.PaletteSetStyles.ShowAutoHideButton
The palette auto-rollup button is present in the palette set caption; when it is enabled, automatic window rollup is supported.