Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject
Describes an object that was selected by a window or window polygon selection. The selection window may or may not be a crossing window.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int32)
Constructor.
id: Object Id of the selected object.
method: Object selection method.
gsMarker: A value that describes what part of the object was selected.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.