Autodesk.AutoCAD.Windows.PlotStyleDialog
Represents a dialog box that allows the user to choose a plot style.

Autodesk.AutoCAD.Windows.PlotStyleDialog.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.PlotStyleDialog.PlotStyle
Gets the plotstyle that user chosen or sets the default.

Autodesk.AutoCAD.Windows.PlotStyleDialog.IncludeByBlockByLayer
Gets or sets whether meta plotstyles are to be included.

Autodesk.AutoCAD.Windows.PlotStyleDialog.ShowDialog
Starts the PlotStyle dialog box within the AutoCAD editor.
Returns: One of the DialogResult values.