Autodesk.AutoCAD.PlottingServices.SheetCancelStatus
This enumeration defines the sheet cancel states in a single-sheet plotting scenario.

Autodesk.AutoCAD.PlottingServices.SheetCancelStatus.CanceledByCaller
The plotting of a sheet was canceled by the plot pipeline.

Autodesk.AutoCAD.PlottingServices.SheetCancelStatus.CanceledByCancelAllButton
The user canceled the entire plotting process using the UI option. That is, all the sheets pending to be plotted in the current plot job process will be canceled.

Autodesk.AutoCAD.PlottingServices.SheetCancelStatus.CanceledByCancelButton
The user canceled the current sheet being plotted using the UI option.

Autodesk.AutoCAD.PlottingServices.SheetCancelStatus.Continue
The current sheet plotting process is set to continue its plotting operation.