Autodesk.AutoCAD.Windows.SaveFileDialog
Represents a dialog box that allows the user to choose a file.

Autodesk.AutoCAD.Windows.SaveFileDialog.#ctor(System.String,System.String,System.String,System.String,Autodesk.AutoCAD.Windows.SaveFileDialog.SaveFileDialogFlags)
Provides data for the PromptedForSelection event of the Editor class.
title: Dialog box caption.
defaultName: Default file name.
extension: Default file extension.
dialogName: Dialog name to use as a key in user's registry profile for persistent settings about the dialog.
flags: A bit-coded field that controls the behavior of the dialog box.

Autodesk.AutoCAD.Windows.SaveFileDialog.Filename
Gets the filename chosen by the user.

Autodesk.AutoCAD.Windows.SaveFileDialog.ShowDialog
Starts the SaveFile dialog box within the AutoCAD editor.
Returns: One of the DialogResult values.