Autodesk.AutoCAD.Windows.StatusBar
Enables customization of the AutoCAD drawing status bar.

Autodesk.AutoCAD.Windows.StatusBar.GetDefaultPane(Autodesk.AutoCAD.Windows.DefaultPane)
Returns the specified default pane or null if the specified pane is not found in the status bar.
pane: Default pane.
Returns: The specified default pane.

Autodesk.AutoCAD.Windows.StatusBar.RemoveDefaultPane(Autodesk.AutoCAD.Windows.DefaultPane)
Removes one or more default panes from the status bar.
pane: Pane or panes to remove.

Autodesk.AutoCAD.Windows.StatusBar.CloseBubbleWindows
Closes all open bubble windows associated with a tray item.