Autodesk.AutoCAD.EditorInput.PromptNumericalOptions.UseDefaultValue
Gets or sets whether the prompt should use the default value when the user presses ENTER without any other input. The property allowing client code to set the default value is declared by derived classes.