Autodesk.AutoCAD.PlottingServices.PreviewEngineFlags
Describes plot preview functionality.

Autodesk.AutoCAD.PlottingServices.PreviewEngineFlags.PreviousSheet
Allow "Previous Sheet" from preview state.

Autodesk.AutoCAD.PlottingServices.PreviewEngineFlags.NextSheet
Allow "Next Sheet" from preview state.

Autodesk.AutoCAD.PlottingServices.PreviewEngineFlags.Plot
Allow plot from preview state.