Autodesk.AutoCAD.ApplicationServices.Document
Contains information such as the filename, the current database, and the save format of the current drawing.

Autodesk.AutoCAD.ApplicationServices.Document.Name
Gets the full path and file name of the database being used by this Document.

Autodesk.AutoCAD.ApplicationServices.Document.CommandInProgress
Gets name of the innermost command currently running for the document.

Autodesk.AutoCAD.ApplicationServices.Document.StatusBar
Gets the status bar associated with this document.

Autodesk.AutoCAD.ApplicationServices.Document.Window
Gets the operating system window associated with this document.

Autodesk.AutoCAD.ApplicationServices.Document.Editor
Gets the Editor associated with this document.

Autodesk.AutoCAD.ApplicationServices.Document.IsActive
Gets true if this document is active.

Autodesk.AutoCAD.ApplicationServices.Document.IsReadOnly
Gets true if this document is readonly.

Autodesk.AutoCAD.ApplicationServices.Document.GraphicsManager
Gets the Autodesk.AutoCAD.ApplicationServices.Document.GraphicsManager object for a specified AutoCAD MDI Client View.

Autodesk.AutoCAD.ApplicationServices.Document.UserData
Gets the user data associated with this document.

Autodesk.AutoCAD.ApplicationServices.Document.AcadDocument
Gets a pointer to the COM object AcadDocument.

Autodesk.AutoCAD.ApplicationServices.Document.TransactionManager
Gets the TransactionManager object for this Document.

Autodesk.AutoCAD.ApplicationServices.Document.Database
Gets the database object (Database) being used by this Document.

Autodesk.AutoCAD.ApplicationServices.Document.Create(System.IntPtr)
Creates a new managed object from an unmanaged pointer.
unmanagedPointer: unmanaged pointer.
Returns: A new managed object.

Autodesk.AutoCAD.ApplicationServices.Document.FromAcadDocument(System.Object)
Gets the .NET Document object from the COM Document object.
acadDocument: The COM Document object.
Returns: The .NET Document object.

Autodesk.AutoCAD.ApplicationServices.Document.SendStringToExecute(System.String,System.Boolean,System.Boolean,System.Boolean)
Sends a string to the command line to be executed in the provided target document.
command: String to use as input.
activate: Boolean indicating whether to activate the target document.
wrapUpInactiveDoc: Boolean indicating whether to queue current active document to complete in the next OnIdle() when switching active documents.
echoCommand: Boolean indicating whether the sent string is echoed on the command line.

Autodesk.AutoCAD.ApplicationServices.Document.LockDocument
This overload calls LockDocument(DocLockMode.Write, null, null,true).

Autodesk.AutoCAD.ApplicationServices.Document.LockDocument(Autodesk.AutoCAD.ApplicationServices.DocumentLockMode,System.String,System.String,System.Boolean)
Is used for locking documents in order to access their resources.
lockMode: One of the locking modes from DocumentLockMode enum.
globalCommandName: Command name. Each time a document is locked, it is considered the beginning of a "command", or action in Acad. This name is passed back by the doc manager reactor as the name of the command doing the locking. It can be null.
localCommandName: Name that is displayed on the command line if or when this command is undone. It can be null.
promptIfFails: Prompt.If the document cannot be locked, due to a command already in progress in the target document, and if prompt is true, the standard prompt will be issued, and the user will be given an opportunity to complete the command in the target document and the lock will succeed. If the user chooses to cancel the lock request, or prompt is false, then the lock change will fail.

Autodesk.AutoCAD.ApplicationServices.Document.CloseAndSave(System.String)
Closes the document and saves it to fileName.
fileName: The file name.

Autodesk.AutoCAD.ApplicationServices.Document.CloseAndDiscard
Closes the document without saving it.

Autodesk.AutoCAD.ApplicationServices.Document.{dtor}


Autodesk.AutoCAD.ApplicationServices.Document.ImpliedSelectionChanged
Triggered when the pickfirst selection set has been modified, that is, for all events that add objects to or remove objects from the set. Events that change the geometry or properties of the objects within the selection set (stretching, moving, and so on) do not trigger this event.

Autodesk.AutoCAD.ApplicationServices.Document.CloseWillStart
Fired at the same time as the Document.BeginDocumentClose event.

Autodesk.AutoCAD.ApplicationServices.Document.CloseAborted
Sent after a reactor has vetoed the document closing event.

Autodesk.AutoCAD.ApplicationServices.Document.BeginDocumentClose
Fired before the Document is closed.

Autodesk.AutoCAD.ApplicationServices.Document.LispCancelled
Indicates that the AutoLISP evaluation of an expression is canceled, and relinquishes control to AutoCAD.

Autodesk.AutoCAD.ApplicationServices.Document.LispEnded
Indicates that the AutoLISP interpreter completed evaluation of an expression, and relinquishes control to AutoCAD.

Autodesk.AutoCAD.ApplicationServices.Document.LispWillStart
Indicates that the expression is about to be executed by the AutoLISP interpreter.

Autodesk.AutoCAD.ApplicationServices.Document.CommandFailed
Indicates that the command failed to complete successfully.

Autodesk.AutoCAD.ApplicationServices.Document.CommandCancelled
Indicates that the command has been canceled by the user or another application, and was unable to complete successfully.

Autodesk.AutoCAD.ApplicationServices.Document.CommandEnded
Indicates that the command has completed.

Autodesk.AutoCAD.ApplicationServices.Document.CommandWillStart
Indicates that the command is about to begin execution.

Autodesk.AutoCAD.ApplicationServices.Document.UnknownCommand
Allows applications to respond to users' attempts to execute commands that AutoCAD does not recognize.