Autodesk.AutoCAD.Windows.OpenFileDialog
Represents a dialog box that allows the user to choose a file.

Autodesk.AutoCAD.Windows.OpenFileDialog.#ctor(System.String,System.String,System.String,System.String,Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags)
Constructor.
title: Dialog box caption.
defaultName: Default file name.
extension: Default file extension.
dialogName: Dialog name to use as a key in user's registry profile for persistent settings about the dialog.
flags: A bit-coded field that controls the behavior of the dialog box.

Autodesk.AutoCAD.Windows.OpenFileDialog.Filename
Gets the filename chosen by the user.

Autodesk.AutoCAD.Windows.OpenFileDialog.ShowDialog
Prompts the user for a file name using the AutoCAD file navigation dialog box.
Returns: One of the DialogResult values.

Autodesk.AutoCAD.Windows.OpenFileDialog.GetFilenames
Gets the file names chosen by the user when multiple selection is allowed.
Returns: The file names chosen by the user.