Autodesk.AutoCAD.Windows.ToolPalette.Image
Provides functionality for loading, saving, and rendering BMP, JPG, GIF, and PNG files.

Autodesk.AutoCAD.Windows.ToolPalette.Image.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.Image.IsLoaded
Gets true if the image is currently loaded. Fails if the Image has not been successfully loaded.

Autodesk.AutoCAD.Windows.ToolPalette.Image.Type
Gets the image type value.

Autodesk.AutoCAD.Windows.ToolPalette.Image.Size
Gets the width and height of the image; fails if the image has not been loaded.

Autodesk.AutoCAD.Windows.ToolPalette.Image.Load(System.Runtime.InteropServices.ComTypes.IStream)
This method will fail if the stream contains an unsupported image. The image has to be loaded successfully before making any calls to other member functions of the class.
stream: The stream that contains the image data.

Autodesk.AutoCAD.Windows.ToolPalette.Image.Load(System.IntPtr)
This method will fail if the stream contains an unsupported image. The image has to be loaded successfully before making any calls to other member functions of the class.
bitmap: Handle to a Windows GDI bitmap.

Autodesk.AutoCAD.Windows.ToolPalette.Image.Load(System.String)
This method will fail if the stream contains an unsupported image. The image has to be loaded successfully before making any calls to other member functions of the class.
filename: Image file to load with the path.

Autodesk.AutoCAD.Windows.ToolPalette.Image.Save(System.Runtime.InteropServices.ComTypes.IStream)
This method will fail if the Image has not been loaded successfully. Before this method is called, the image must be loaded successfully. GIF images are saved in PNG format.
stream: The stream into which the image must be written.

Autodesk.AutoCAD.Windows.ToolPalette.Image.Save(System.String)
This method will fail if the Image has not been loaded successfully. Before this method is called, the image must be loaded successfully. GIF images are saved in PNG format. While saving a GIF image, the file extension of filename is not changed even though the saved format is PNG.
filename: Image file to save with path.

Autodesk.AutoCAD.Windows.ToolPalette.Image.Draw(System.Drawing.Graphics,System.Drawing.Rectangle,Autodesk.AutoCAD.Windows.ToolPalette.DrawImageOption,System.Boolean)
This method is used to render the loaded image. The image must be loaded before it can be rendered.
graphics: Device context on which to render the image.
rectangle: Dimension of destination rectangle.
drawOption: Specifies how the image is to be rendered.
transparent: If true, then the bitmap images are drawn with a transparent background, and the transparent color is assumed to be the color of the pixel at the 0,0 position; if false, then the bitmap images are drawn as opaque; the argument is ignored for all the other image types.

Autodesk.AutoCAD.Windows.ToolPalette.Image.{dtor}
