Autodesk.AutoCAD.EditorInput.SelectionFlags
This enumeration contains the flag settings for an entity selection process. The settings are used by methods that add entities to or remove entities from a SubSelectionSet.

Autodesk.AutoCAD.EditorInput.SelectionFlags.SubSelection
When set, indicates that the ":U" option was used in a call to GetSelection() and that the selection set may contain subentity information.

Autodesk.AutoCAD.EditorInput.SelectionFlags.PreviousSet
The previous selection set.

Autodesk.AutoCAD.EditorInput.SelectionFlags.PickfirstSet
Pickfirst set used.

Autodesk.AutoCAD.EditorInput.SelectionFlags.SinglePick
Force a single pick.

Autodesk.AutoCAD.EditorInput.SelectionFlags.SubEntities
Subentity selections are requested.

Autodesk.AutoCAD.EditorInput.SelectionFlags.NestedEntities
Nested entities are allowed.

Autodesk.AutoCAD.EditorInput.SelectionFlags.Duplicates
Duplicate selections are allowed.

Autodesk.AutoCAD.EditorInput.SelectionFlags.PickPoints
Real pick points are needed.

Autodesk.AutoCAD.EditorInput.SelectionFlags.Normal
Standard entity selection.