Autodesk.AutoCAD.PlottingServices.PlotToFileCapability
This enumeration describes the ability of a PlotConfig object to plot to a file.

Autodesk.AutoCAD.PlottingServices.PlotToFileCapability.MustPlotToFile
The device supports plotting only to a file.PlotConfig. IsPlotToFile always gets true.

Autodesk.AutoCAD.PlottingServices.PlotToFileCapability.PlotToFileAllowed
The device supports plotting only to a file. PlotConfig.IsPlotToFile may be used to change the current device configuration.

Autodesk.AutoCAD.PlottingServices.PlotToFileCapability.NoPlotToFile
The device does not support plotting to a file. PlotConfig.IsPlotToFile always gets false.