Autodesk.AutoCAD.Runtime.AngularUnitFormat.Surveyor


Autodesk.AutoCAD.Runtime.AngularUnitFormat.Radians


Autodesk.AutoCAD.Runtime.AngularUnitFormat.Grads


Autodesk.AutoCAD.Runtime.AngularUnitFormat.DegreesMinutesSeconds


Autodesk.AutoCAD.Runtime.AngularUnitFormat.Degrees


Autodesk.AutoCAD.Runtime.AngularUnitFormat.Current
