Autodesk.AutoCAD.PlottingServices.PlotConfigInfo
This is a lightweight class containing information about a device.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.DeviceType
Gets or sets the device type as an DeviceType enum.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.DeviceName
Gets or sets the device name or PC3 file name. Always gets or sets the file name portion of the name for a PC3 file.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.FullPath
Gets or sets the current device or PC3 file name.Always gets or sets the full path name for PC3 files. It gets or sets the entire UNC path name for system printers.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.Clone
Creates a shallow copy of the PlotConfigInfo.
Returns: A shallow copy of the PlotConfigInfo.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.{dtor}
