Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode
Describes the interface that must be implemented by the (optional) NavTree Publisher.NavTree publisher controls what will appear in the navigation tree in the Viewer.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.#ctor(System.String,System.Boolean,System.Boolean)
Constructor.
displayName: The name of the tree node.
isGroup: True if the tree node is a group.
isBlock: True if the node is grouped by block.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.IsBlock
Gets or sets true if the node is grouped by block.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.Children
Gets an array of all the children in the tree node.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.IsGroup
Gets or sets true if the tree node is a group.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.DisplayName
Gets or sets the name of the tree node.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.GetKeys
Returns the graphic identifiers included in this tree node.
Returns: The graphic identifiers included in this tree node.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.SetKeys(System.Int32[])
Array of keys.
keys: Sets the keys for this tree node.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.{dtor}
