Autodesk.AutoCAD.EditorInput.InputPointContext
Provides input parameters for the PointFilter and PointMonitor events.

Autodesk.AutoCAD.EditorInput.InputPointContext.ToolTipText
Gets final tool tip string, as determined by AutoCAD.

Autodesk.AutoCAD.EditorInput.InputPointContext.ComputedPoint
Gets point as it ends up for AutoCAD if PointComputed is true.

Autodesk.AutoCAD.EditorInput.InputPointContext.ObjectSnapOverrides
Gets ObjectSnap overrides currently active (even if they didn't participate in the calculation of the ComputedPoint).

Autodesk.AutoCAD.EditorInput.InputPointContext.ObjectSnapMask
Gets current OSNAP modes in effect.

Autodesk.AutoCAD.EditorInput.InputPointContext.ObjectSnappedPoint
Gets current OSNAP point.

Autodesk.AutoCAD.EditorInput.InputPointContext.CartesianSnappedPoint
Gets old-style snap if History has the CartSnapped bit set.

Autodesk.AutoCAD.EditorInput.InputPointContext.GrippedPoint
Gets gripped point if History has the eGripped bit set.

Autodesk.AutoCAD.EditorInput.InputPointContext.RawPoint
Gets point as tracked by the cursor position before subsequent filtering, or as entered via alternate means, which is subject to far less filtering. Valid only if PointComputed above is true.

Autodesk.AutoCAD.EditorInput.InputPointContext.LastPoint
Gets last point if History has the LastPoint bit set.

Autodesk.AutoCAD.EditorInput.InputPointContext.History
Gets integer with bit fields as defined by the PointHistory enum.

Autodesk.AutoCAD.EditorInput.InputPointContext.PointComputed
Gets true if the points below are valid, or false if they are not.

Autodesk.AutoCAD.EditorInput.InputPointContext.DrawContext
Gets view transform, pixel sizes, and other context information.

Autodesk.AutoCAD.EditorInput.InputPointContext.Document
Gets document object that this callback emanates from; this makes it easier to plant one instance on all input point managers, and determine which one is making the callback.

Autodesk.AutoCAD.EditorInput.InputPointContext.GetCustomObjectSnapModes
Gets custom OSNAP modes in effect.
Returns: Custom OSNAP modes in effect.

Autodesk.AutoCAD.EditorInput.InputPointContext.GetCustomObjectSnapOverrides
Gets custom osnap overrides currently active.
Returns: Custom osnap overrides currently active.

Autodesk.AutoCAD.EditorInput.InputPointContext.GetPickedEntities
Gets picked entity array.
Returns: Picked entity array.

Autodesk.AutoCAD.EditorInput.InputPointContext.GetKeyPointEntities
Gets entities that were responsible for the calculation of the ObjectSnappedPoint.
Returns: Entities that were responsible for the calculation of the ObjectSnappedPoint.

Autodesk.AutoCAD.EditorInput.InputPointContext.GetAlignmentPaths
Gets array that contains geometry of type Line3d (ortho and polar snap lines), LineSeg3d (extension lines), or EllipArc3d (extension arcs).
Returns: Array that contains geometry of type Line3d (ortho and polar snap lines), LineSeg3d (extension lines), or EllipArc3d (extension arcs).