Autodesk.AutoCAD.PlottingServices.RefreshCode
This enumeration defines the flags that can be specified to refresh the lists maintained by the PlotConfigManager class.

Autodesk.AutoCAD.PlottingServices.RefreshCode.RefreshPC3DevicesList
Refreshes only the cached pc3 devices list information.

Autodesk.AutoCAD.PlottingServices.RefreshCode.RefreshSystemDevicesList
Refreshes only the cached system devices list information.

Autodesk.AutoCAD.PlottingServices.RefreshCode.RefreshStyleList
Refreshes the plot style tables list only.

Autodesk.AutoCAD.PlottingServices.RefreshCode.RefreshDevicesList
Refreshes the devices list only.

Autodesk.AutoCAD.PlottingServices.RefreshCode.All
Refreshes all existing lists.