Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolContextMenu
The stock tool implements this interface if it wants to customize the context menu displayed in the palette background. This interface is queried from the IAcadStockTool interface.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolContextMenu.Customize(System.Int32,System.UInt32,System.UInt32,System.UInt32,System.Guid@)
This method gives the stock tool an opportunity to customize the context menu. It is called by the framework when the context menu is about to be displayed in the tool palette background, palette tabs, palette set caption, or palette set option button. At that time, this method is called on all registered stock tools.
contextFlag: Enum specifies the context in which the context menu is invoked.
menuHandle: Context menu handle.
idCommandFirst: Minimum value that the tool can specify for a menu item identifier.
idCommandLast: Maximum value that the handler can specify for a menu item identifier.
paletteId: If the context is ContextMenuPaletteSetTab, this contains the ID of the palette that corresponds to the tab (active or inactive); for all other contexts, this contains the ID of the active palette .
Returns: Value indicates the context menu's display state.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolContextMenu.GetMenuHelp(System.UInt32)
The framework calls this method to get the fly-by, one-line help text to be displayed for the command added to a context menu by the tool's GetContextMenu() method. This help is not used currently but may be used in future.
idCmd: ID of the command for which help text is required.
Returns: Help text for the command.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolContextMenu.InvokeMenuCommand(System.UInt32,System.Guid@,System.UInt32)
The framework calls this method when the user chooses a command that this stock tool has added to the context menu. A stock tool adds context menu commands in its Customize() method.
idCmd: Command identifier.
paletteId: ID of the palette.
windowHandle: Window handle.
Returns: Flag that can be set to force an update of the palette.