Autodesk.AutoCAD.Windows.ToolPalette.ToolAttribute
Contains a tool's name and the name of its image.

Autodesk.AutoCAD.Windows.ToolPalette.ToolAttribute.#ctor(System.String,System.String)


Autodesk.AutoCAD.Windows.ToolPalette.ToolAttribute.ToolImage


Autodesk.AutoCAD.Windows.ToolPalette.ToolAttribute.ToolName
