Autodesk.AutoCAD.PlottingServices.EndDocumentEventArgs
Encapsulates the plot-specific information required by the EndDocument event. This information includes a PlotCancelStatus flag.

Autodesk.AutoCAD.PlottingServices.EndDocumentEventArgs.#ctor(Autodesk.AutoCAD.PlottingServices.PlotCancelStatus)
Constructor.
status:

Autodesk.AutoCAD.PlottingServices.EndDocumentEventArgs.Status
