Autodesk.AutoCAD.PlottingServices.DsdEntry
Holds information specific to a sheet (in a sheet set). PlottingServices.DSDData holds a collection of PlottingServices.DSDEntry objects to configure a publish job.

Autodesk.AutoCAD.PlottingServices.DsdEntry.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.PlottingServices.DsdEntry.NpsSourceDwg
Gets or sets the path for the drawing file that contains the named page setup, which is identified by what the Nps property gets.

Autodesk.AutoCAD.PlottingServices.DsdEntry.Nps
Gets or sets the named page setup string.

Autodesk.AutoCAD.PlottingServices.DsdEntry.Title
Gets or sets the title of the DSD entry. The title is a unique section name for a DSD entry in the DSD configuration file. If two sheet entries have the same title, they will overwrite each other.

Autodesk.AutoCAD.PlottingServices.DsdEntry.Layout
Gets or sets the name of the layout in the DWG file returned by a call to DwgName property.

Autodesk.AutoCAD.PlottingServices.DsdEntry.DwgName
Gets or sets the name of the DWG file that holds the sheet to be published.

Autodesk.AutoCAD.PlottingServices.DsdEntry.Copy
Gets a copy of the PlottingServices.DsdEntry object.
Returns: A copy of the PlottingServices.DsdEntry object.

Autodesk.AutoCAD.PlottingServices.DsdEntry.{dtor}
