Autodesk.AutoCAD.Windows.ToolPalette.Package
Encapsulates the package item in the tool catalog.

Autodesk.AutoCAD.Windows.ToolPalette.Package.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.Package.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Windows.ToolPalette.Package.{dtor}
