Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions
Contains file dialog configuration options that are passed to the Editor.GetFileNameForOpen() method.

Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions.TransferRemoteFiles


Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions.SearchPath
