Autodesk.AutoCAD.PlottingServices.CustomSizeResults
This enumeration defines the return flags from the PlotInfoValidator.IsCustomSizePossible() method.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.DeviceLoadFailed
The device specified in the layout, overrides, or device override could not be loaded to determine if it supports custom paper sizes.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.WidthAndHeightMustBePositive
Page width and page height must be positive.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.PmpFileReadOnly
The PMP file is read-only. Custom sizes are not possible unless a temporary PMP file is created.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.UnknownErrPmpFile
There is an unknown error with the PMP file;custom sizes are not possible.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.UnknownErrPC3File
There is an unknown error with the PC3 file;custom sizes are not possible.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.Exception
An exception has occurred.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.SizeTooBig
The page size is too big for the device.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.PC3FileReadOnly
The PC3 file is read-only. Custom sizes are not possible unless a temporary PC3 file is created.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.UnknownErrPmpDir
There is an unknown error with the PMP directory; custom sizes are not possible.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.PmpDirMissing
The PMP directory does not exist; custom sizes are not possible.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.PmpDirReadOnly
The PMP directory is read-only; custom sizes are not possible.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.PC3DirReadOnly
The PC3 directory is read-only;custom sizes are not possible.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.RotationRequired
The size is possible, but a 90-degree rotation is required.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.MustCreatePC3
No PC3 file exists for the configuration; one must be created.

Autodesk.AutoCAD.PlottingServices.CustomSizeResults.Possible
The custom size is possible.