Autodesk.AutoCAD.EditorInput.PromptIntegerOptions
Represents optional parameters for a prompt for an integer.

Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.#ctor(System.String,System.String,System.Int32,System.Int32)


Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.#ctor(System.String,System.String)


Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.UpperLimit


Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.LowerLimit


Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.DefaultValue
Gets the default value to be used when the user presses ENTER without any other input.

Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.DoIt
