Autodesk.AutoCAD.Publishing.PublishSheetEventArgs
Provides data for the PublishSheet event.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.Dwf3dNavigationTreeNode
Gets the current root node.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PublishingTo3DDwf
Gets a value that indicates whether a 3D DWF is currently being published.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.EffectivePlotOffsetYDevice
Gets the Y coordinate of the effective plot origin in device coordinates (pixels).

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.EffectivePlotOffsetXDevice
Gets the X coordinate of the effective plot origin in device coordinates (pixels).

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.EffectivePlotOffsetY
Gets the Y coordinate of the effective plot origin in media units.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.EffectivePlotOffsetX
Gets the X coordinate of the effective plot origin in media units.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutBoundsMaxY
Gets the Y coordinate of the upper-right corner of the printable bounds.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutBoundsMaxX
Gets the X coordinate of the upper-right corner of the printable bounds.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutBoundsMinY
Gets the Y coordinate of the lower-left corner of the printable bounds.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutBoundsMinX
Gets the X coordinate of the lower-left corner of the printable bounds.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotBoundsMaxY
Gets the Y coordinate of the upper-right corner of the plot bounds.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotBoundsMaxX
Gets the X coordinate of the upper-right corner of the plot bounds.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotBoundsMinY
Gets the Y coordinate of the lower-left corner of the plot bounds.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotBoundsMinX
Gets the X coordinate of the lower-left corner of the plot bounds.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.CanonicalMediaName
Gets the canonical name of the configured media size.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotToFileName
Gets the plot-to-file file name.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotToFilePath
Gets the plot-to-file path.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.Configuration
Gets the configured device name (PC3 file or device name).

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.StepsPerInch
Gets the configured vector resolution in dots per inch.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.MaxBoundsY
Gets the height of the configured media.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.MaxBoundsX
Gets the width of the configured media.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PrintableBoundsY
Gets the height of the printable area.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PrintableBoundsX
Gets the width of the printable area.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutMarginMaxY
Gets the distance from the top edge of the paper to the top edge of the printable area.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutMarginMaxX
Gets the distance from the right edge of the paper to the right edge of the printable area.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutMarginMinY
Gets the distance from the bottom edge of the paper to the bottom edge of the printable area.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutMarginMinX
Gets the distance from the left edge of the paper to the left edge of the printable area.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.DisplayMaxY
Gets the Y coordinate of the upper-right corner of the display.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.DisplayMaxX
Gets the X coordinate of the upper-right corner of the display.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.DisplayMinY
Gets the Y coordinate of the lower-left corner of the display.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.DisplayMinX
Gets the X coordinate of the lower-left corner of the display.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.AreScalingLineWeights
Gets true if lineweights are being scaled.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.ArePlottingLineWeights
Gets true if lineweights are configured to be plotted.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.AreLinesHidden
Gets true if this plot is done with hidden line removal.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.IsScaleSpecified
Gets true if a plot scale is specified (as opposed to scale to fit).

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.ViewPlotted
Gets the name of the view being plotted.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotWindowMaxY
Gets the Y coordinate of the upper-right corner of the plot window.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotWindowMaxX
Gets the X coordinate of the upper-right corner of the plot window.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotWindowMinY
Gets the Y coordinate of the lower-left corner of the plot window.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotWindowMinX
Gets the X coordinate of the lower-left corner of the plot window.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.OriginY
Gets the Y coordinate of the plot origin, in media units, from the corner of the paper.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.OriginX
Gets the X coordinate of the plot origin, in media units, from the corner of the paper.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.DrawingScale
Gets the drawing scale as a double-precision number.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PaperScale
Gets the paper scale as a double-precision number.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotPaperUnit
Gets the configured plot media units.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotRotation
Gets the configured plot rotation (camera rotation).

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotType


Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.IsModelLayout
Gets true if this is the Model tab.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotLayoutId
Gets the object ID for this layout.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.UniqueLayoutId
Gets the GUID assigned the first time this layout was published, which is reused on republish.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.IsPlotJobCancelled
Gets true if the job has been canceled or aborted.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.Database
Gets the database being plotted.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotLogger


Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.AddPagePropertyRange(Autodesk.AutoCAD.Publishing.EPlotProperty[])
Allows clients to add a list of properties to the DWF file, to be associated with this page but not associated with any particular entity. These properties are added to the page descriptor.
properties: EPlotProperty objects.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.AddPageResourceRange(Autodesk.AutoCAD.Publishing.EPlotResource[])
Allows clients to add a list of resources (files) to the DWF file, to be associated with this page but not associated with any particular entity.
resources: EPlotResource objects,which include a mime type, a role, and a full path to the resource to be added.