Autodesk.AutoCAD.Windows.PaletteSet
Contains a set of one or more palette windows(Palette objects).

Autodesk.AutoCAD.Windows.PaletteSet.#ctor(System.String,System.Guid)


Autodesk.AutoCAD.Windows.PaletteSet.#ctor(System.String)


Autodesk.AutoCAD.Windows.PaletteSet.Anchored
Gets or sets true if the palette set is anchored.

Autodesk.AutoCAD.Windows.PaletteSet.MinimumSize
Gets or sets minimum dimensions of the palette set.

Autodesk.AutoCAD.Windows.PaletteSet.Location
Gets or sets the point that corresponds to the lower-left corner of the palette set.

Autodesk.AutoCAD.Windows.PaletteSet.Size
Gets or sets the size of the palette set.

Autodesk.AutoCAD.Windows.PaletteSet.Visible
Gets or sets true if the palette set is visible.

Autodesk.AutoCAD.Windows.PaletteSet.Dock
Gets or sets where the palette set should be docked.

Autodesk.AutoCAD.Windows.PaletteSet.TitleBarLocation
Gets or sets the current location of the palette set title bar.

Autodesk.AutoCAD.Windows.PaletteSet.Opacity
Gets or sets the current opacity for the palette set.Valid values are in the range 0 to 100, where 0 is completely transparent and 100 is completely opaque.

Autodesk.AutoCAD.Windows.PaletteSet.Count
Gets the number of palettes in the palette set.

Autodesk.AutoCAD.Windows.PaletteSet.Name
Gets or sets the name of the palette set.

Autodesk.AutoCAD.Windows.PaletteSet.Item(System.Int32)


Autodesk.AutoCAD.Windows.PaletteSet.RolledUp
Gets or sets true if the palette set is rolled up.

Autodesk.AutoCAD.Windows.PaletteSet.AutoRollUp
Gets or sets true if auto rollup is enabled;false if it is disabled or if the the auto-rollup style is not set for the palette set.

Autodesk.AutoCAD.Windows.PaletteSet.Style
Gets or sets the palette set style.

Autodesk.AutoCAD.Windows.PaletteSet.Activate(System.Int32)
Sets the palette specified by index to be the currently active palette.
index: Palette tab index of the palette to be activated.

Autodesk.AutoCAD.Windows.PaletteSet.Add(System.String,System.Windows.Forms.Control)
Appends the specified palette to the end of the palette set.
name: The name of the palette.
control: The palette to add.
Returns: Zero-based index in the palette set or -1 if the palette was not added.

Autodesk.AutoCAD.Windows.PaletteSet.Remove(System.Int32)
Removes the palette specified by index from the palette set.
index: Zero-based tab index of the palette to remove.

Autodesk.AutoCAD.Windows.PaletteSet.CopyTo(Autodesk.AutoCAD.Windows.Palette[],System.Int32)
Copies the palette in this palette set to the array starting from the specified index.
array: Target array.
index: First index to copy elements to.

Autodesk.AutoCAD.Windows.PaletteSet.GetEnumerator
Provides an enumerator to access elements of the collection.
Returns: The IEnumerator interface to enumerate the elements of the collection.

Autodesk.AutoCAD.Windows.PaletteSet.{dtor}


Autodesk.AutoCAD.Windows.PaletteSet.PaletteActivated
Occurs when a detail of the palette set's is activated.