Autodesk.AutoCAD.Runtime.LispDataType.T_atom


Autodesk.AutoCAD.Runtime.LispDataType.Nil


Autodesk.AutoCAD.Runtime.LispDataType.DottedPair


Autodesk.AutoCAD.Runtime.LispDataType.ListEnd


Autodesk.AutoCAD.Runtime.LispDataType.ListBegin


Autodesk.AutoCAD.Runtime.LispDataType.None


Autodesk.AutoCAD.Runtime.LispDataType.Point3d


Autodesk.AutoCAD.Runtime.LispDataType.ObjectId


Autodesk.AutoCAD.Runtime.LispDataType.Angle


Autodesk.AutoCAD.Runtime.LispDataType.Point2d


Autodesk.AutoCAD.Runtime.LispDataType.Void


Autodesk.AutoCAD.Runtime.LispDataType.Int32


Autodesk.AutoCAD.Runtime.LispDataType.Text


Autodesk.AutoCAD.Runtime.LispDataType.Int16


Autodesk.AutoCAD.Runtime.LispDataType.Double


Autodesk.AutoCAD.Runtime.LispDataType.Orientation


Autodesk.AutoCAD.Runtime.LispDataType.SelectionSet
