Autodesk.AutoCAD.Windows.TrayItemBubbleWindow
Supports the bubble notification window that is displayed for a tray item in the tray icon area of the status bar.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.Text2
Gets or sets the descriptive text that is displayed below the hypertext( if there is any) in the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.HyperLink
Gets or sets the URL string that is invoked when the user selects the hyperlink text in the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.HyperText
Gets or sets the hyperlink text that is displayed in the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.Text
Gets or sets the descriptive text that is displayed in the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.Title
Gets or sets the title string that is displayed in the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.IconType
Gets or sets the bubble window icon type.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.{dtor}


Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.Closed
Occurs when the bubble window is closed.