Autodesk.AutoCAD.Publishing.EPlotPropertyBag
This class is a lightweight proxy for the DWF EPlotProperties class, which is used by the DMM (DWF Metadata Manager) API to allow clients to associate entity properties with DWF geometry without linking to the DWF toolkit. This class contains the data but not the behavior of the corresponding DWF toolkit object.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.#ctor(System.String,System.String,System.String)
Constructor.
id: The ID attribute.
namespaceUrl: Namespace Url.
namespaceLocation: Namespace Location.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.#ctor
Default constructor.Constructs an empty EPlotPropertyBag object.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.Properties
Gets the internal vector of EPlotProperty objects contained by this object.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.References
Gets the vector of Unicode string identifications of referenced EPlotPropertyBag objects.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.NamespaceLocation
Gets or sets the namespace location of the EPlotPropertyBag objects.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.NamespaceUrl
Gets or sets the namespace url of the EPlotPropertyBag objects.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.Id
Gets or sets the Unicode string that is the unique identifier assigned by the client to this EPlotPropertyBag object.