Autodesk.AutoCAD.EditorInput.PointHistoryBits
Represent bits in a history value that indicates what point filters had an effect on the point on a particular system event.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.Ortho
Ortho on.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.NotInteractive
Coordinate came from a script, menu macro expansion, an AutoLISP (command) call.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.FromKeyboard
Coordinate has been typed in by the user.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.CoordinatePending
Mask for preceding pending coordinate bits.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.ZPending
Z coordinate pending.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.YPending
Y coordinate pending.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.XPending
X coordinate pending.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.PickAborted
If picking of the apertureEntities has been aborted because of outstanding mouse move messages in the AutoCAD message queue.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.UsedObjectSnapBox
"Forced picking" used OSNAP box.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.UsedPickBox
"Forced picking" used Pick box;used as enum within.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.DidNotPick
No picking was done.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.PickMask
AND mask to strip out "pick mode" bitse.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.ForcedPick
"Forced Picking" is enabled.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.AppFiltered
If a point filter is registered (only monitors will get this bit).

Autodesk.AutoCAD.EditorInput.PointHistoryBits.Aligned
AutoAlign did something.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.PolarAngle
Polar Snap on.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.ObjectSnapped
Osnap did something.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.CyclingPoint
Indicates caller is "cycling" so this is not the necessarily the best osnap/alignment computation.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.CartSnapped
Snap mode on ("old" cartesian snap).

Autodesk.AutoCAD.EditorInput.PointHistoryBits.Gripped
Fell into grip gravity.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.LastPoint
Indicates lastPoint is valid.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.NotDigitizer
Implies rawPoint was typed at keyboard, or fed by program, script, menu macro expansion, or digitizer pick event; anything but digitizer motion.

Autodesk.AutoCAD.EditorInput.PointHistoryBits.Tablet
Tablet implies window cursor tracking, as opposed to tablet mode.