Autodesk.AutoCAD.Windows.Menu
Base class for various menu-like types.

Autodesk.AutoCAD.Windows.Menu.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.Menu.MenuItems
Gets the MenuItems contained in this Menu.