Autodesk.AutoCAD.Windows.TrayItem
Represents an individual tray item in the tray icon area of the status bar. A tray item is represented by an icon.

Autodesk.AutoCAD.Windows.TrayItem.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.TrayItem.ShowBubbleWindow(Autodesk.AutoCAD.Windows.TrayItemBubbleWindow)
Displays a bubble notification window next to the tray item icon in the tray icon area of the status bar. The bubble window base point is centered on the tray item icon.
bubble: The tray item's TrayItemBubbleWindow object.

Autodesk.AutoCAD.Windows.TrayItem.CloseBubbleWindows
Closes all open bubble windows associated with a tray item.

Autodesk.AutoCAD.Windows.TrayItem.{dtor}
