Autodesk.AutoCAD.PlottingServices.BeginPageEventArgs
Encapsulates the plot-specific information required by the BeginPage event. This information includes a PlotInfo object,a PlotPageInfo object,last page flag .

Autodesk.AutoCAD.PlottingServices.BeginPageEventArgs.#ctor(Autodesk.AutoCAD.PlottingServices.PlotPageInfo,Autodesk.AutoCAD.PlottingServices.PlotInfo,System.Boolean)


Autodesk.AutoCAD.PlottingServices.BeginPageEventArgs.LastPage


Autodesk.AutoCAD.PlottingServices.BeginPageEventArgs.PlotPageInfo


Autodesk.AutoCAD.PlottingServices.BeginPageEventArgs.PlotInfo
