Autodesk.AutoCAD.Windows.ToolPalette.IOPMPropertyExtension
Contains a variety of Properties window-specific functionality.

Autodesk.AutoCAD.Windows.ToolPalette.IOPMPropertyExtension.GetDisplayName(System.Int32,System.String@)
Returns an alternate or localized name for the property specified by dispatchId.
dispatchId: Dispatch identifier of the property whose display name is requested.
propertyName: String contains the display name for the property identified with DISPID.

Autodesk.AutoCAD.Windows.ToolPalette.IOPMPropertyExtension.Editable(System.Int32,System.Int32@)
This method allows properties which are not read-only in the type information to be displayed as read-only (in other words, grayed out) in the Properties window. This allows the developer to disable certain properties at run-time. This is useful if certain properties should not be editable or don't make sense based on the value of another property.
dispatchId: Dispatch identifier of the property whose editable flag is being overridden.
value: Value contains the editable flag.

Autodesk.AutoCAD.Windows.ToolPalette.IOPMPropertyExtension.ShowProperty(System.Int32,System.Int32@)
This method allows properties to be removed entirely from the property list for a particular object. This allows the developer to remove certain properties at run-time. This is useful if certain properties should not be visible or don't make sense based on the value of another property.
dispatchId: Dispatch identifier of the property whose showable flag is being overridden.
show: Value contains the showable flag.