Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs
Encapsulates the plot-specific information required by the BeginDocument event. This information includes a PlotInfo object,document name,number of copies,plot-to-file flag and  filename.

Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs.#ctor(Autodesk.AutoCAD.PlottingServices.PlotInfo,System.String,System.Int32,System.Boolean,System.String)


Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs.FileName


Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs.PlotToFile


Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs.Copies


Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs.DocumentName


Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs.PlotInfo
