Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase
This abstract class defines a general custom tool that can be used to implement any type of tool supported by tool palettes. It aggregates the various tool interfaces and provides extensive boilerplate implementations that simplify the creation of custom tools.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.EditMode


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CurrentShapeId


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.FlayoutPackageID


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ToolImage


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ToolName


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ToolGuid


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Finalize


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Dispose(System.Boolean)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Dispose


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ExecuteCallback


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.DropCallback(Autodesk.AutoCAD.DatabaseServices.Entity)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateStockTool(System.String)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreatePalette(Autodesk.AutoCAD.Windows.ToolPalette.Catalog,System.String)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateTool


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateTool(Autodesk.AutoCAD.Windows.ToolPalette.Package,System.String,Autodesk.AutoCAD.Windows.ToolPalette.ImageInfo)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateCommandTool(Autodesk.AutoCAD.Windows.ToolPalette.Package,System.String,Autodesk.AutoCAD.Windows.ToolPalette.ImageInfo,System.String)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateFlyoutTool(Autodesk.AutoCAD.Windows.ToolPalette.Package,Autodesk.AutoCAD.Windows.ToolPalette.Package,System.String)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateShapeCatalog(System.String)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetStockTool


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.SetToolProperties(System.Object)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Load(System.Object)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Save(System.Object)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Execute(System.Int32,System.UInt32,System.UInt32,System.UInt32)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetData(System.Object@,System.Object@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.BeginEdit


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Edit(System.Object,System.Int32,System.Boolean@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.EndEdit(System.Boolean)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.New


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetDropTarget


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetContextMenu(System.Int32,System.UInt32,System.UInt32,System.UInt32)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetCommandString(System.UInt32)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.InvokeCommand(System.UInt32,System.UInt32)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetDragDropContextInfo(System.Object,System.String@,System.UInt32@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Dropped(System.String)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Refreshed(System.String)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.SetEditorWindow(System.Int32,System.Object)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ValidateEditChanges


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetToolProperties


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.BeginMultipleEdit(System.Object,System.Object)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.EndMultipleEdit(System.Object,System.Object,System.Boolean)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.MultipleEdit(System.Object,System.Object,System.Int32,System.Boolean@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.DragEnter(System.Windows.Forms.IDataObject,System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL,System.UInt32@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.DragOver(System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL,System.UInt32@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.DragLeave


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Drop(System.Windows.Forms.IDataObject,System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL,System.UInt32@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.IsValueUnspecified(System.Object,System.Boolean@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.SetUnspecified(System.Object,System.Boolean)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.IsUnspecifiedAllowed(System.Object,System.Boolean@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetUnspecifiedString(System.Object)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetCustomPropertyCtrl(System.Object,System.UInt32,System.String@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetPropertyIcon(System.Object,System.Object@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetPropTextColor(System.Object,System.UInt32@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.IsFullView(System.Object,System.Boolean@,System.UInt32@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetPropertyWeight(System.Object,System.Int32@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetDisplayName(System.Int32,System.String@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Editable(System.Int32,System.Int32@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ShowProperty(System.Int32,System.Int32@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.Customize(System.Int32,System.UInt32,System.UInt32,System.UInt32,System.Guid@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetMenuHelp(System.UInt32)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.InvokeMenuCommand(System.UInt32,System.Guid@,System.UInt32)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetDisplayString(System.Int32,System.String@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetPredefinedStrings(System.Int32,Autodesk.AutoCAD.Windows.ToolPalette.tagCALPOLESTR@,Autodesk.AutoCAD.Windows.ToolPalette.tagCADWORD@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetPredefinedValue(System.Int32,System.UInt32,System.Object@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.MapPropertyToPage(System.Int32,System.Guid@)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.DoModal(System.String@,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)


Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.SetFlyoutTools(System.Object)
