Autodesk.AutoCAD.Windows.Palette
Represents a palette window.

Autodesk.AutoCAD.Windows.Palette.PaletteSet
Gets the PaletteSet for this Palette.

Autodesk.AutoCAD.Windows.Palette.Name
Gets or sets the name of the palette.