Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension
Contains information necessary to extend a tabbed dialog.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,Autodesk.AutoCAD.ApplicationServices.TabbedDialogAction,Autodesk.AutoCAD.ApplicationServices.TabbedDialogAction,Autodesk.AutoCAD.ApplicationServices.TabbedDialogAction,Autodesk.AutoCAD.ApplicationServices.TabbedDialogAction)
Constructor. Assigns the action specified by onOK as the OK button handler. Assigns the action specified by onCancel as the Cancel button handler. Assigns the action specified by onHelp as the Help button handler. Assigns the action specified by onApply as the Apply button handler.
control: The control that fills the client area of the tab.
onOK: OK button handler.
onCancel: Cancel button handler.
onHelp: Help button handler.
onApply: Apply button handler.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,Autodesk.AutoCAD.ApplicationServices.TabbedDialogAction,Autodesk.AutoCAD.ApplicationServices.TabbedDialogAction,Autodesk.AutoCAD.ApplicationServices.TabbedDialogAction)
Constructor. Assigns the action specified by onOK as the OK button handler. Assigns the action specified by onCancel as the Cancel button handler. Assigns the action specified by onHelp as the Help button handler.
control: The control that fills the client area of the tab.
onOK: OK button handler.
onCancel: Cancel button handler.
onHelp: Help button handler.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,Autodesk.AutoCAD.ApplicationServices.TabbedDialogAction,Autodesk.AutoCAD.ApplicationServices.TabbedDialogAction)
Constructor. Assigns the action specified by onOK as the OK button handler. Assigns the action specified by onCancel as the Cancel button handler.
control: The control that fills the client area of the tab.
onOK: OK button handler.
onCancel: Cancel button handler.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,Autodesk.AutoCAD.ApplicationServices.TabbedDialogAction)
Constructor. Assigns the action specified by onOK as the OK button handler.
control: The control that fills the client area of the tab.
onOK: OK button handler.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.OnApply
Gets event handler that is called when the user clicks the Apply button in the main dialog to apply changes.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.OnHelp
Gets event handler that is called when the user clicks the Help button in the main dialog to apply changes.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.OnCancel
Gets event handler that is called when the user clicks the Cancel button in the main dialog to apply changes.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.OnOk
Gets event handler that is called when the user clicks the Ok button in the main dialog to apply changes.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.Control
Gets the control that fills the client area of the tab.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.SetDirty(System.Windows.Forms.Control,System.Boolean)
Sets or clears the dirty bit.
control: The control that fills the client area of the tab.
dirty: True to set dirty, False otherwise.