Autodesk.AutoCAD.EditorInput.PickPointSelectedObject
Describes an object that was selected by a single pick.

Autodesk.AutoCAD.EditorInput.PickPointSelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int32,Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
Constructor.
id: Object Id of the selected object.
method: AutoCAD object selection methods.
gsMarker: A value that describes what part of the object was selected.
descriptor: Describes the shape of a pick point.

Autodesk.AutoCAD.EditorInput.PickPointSelectedObject.PickPoint
Gets a PickPointDescriptor that provides details about the pick point.

Autodesk.AutoCAD.EditorInput.PickPointSelectedObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PickPointSelectedObject.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.