Autodesk.AutoCAD.Windows.MenuItem
Holds information related to a menu item.

Autodesk.AutoCAD.Windows.MenuItem.#ctor(System.String,System.Drawing.Icon)
Constructor.
value: The text displayed by the MenuItem.
icon: The icon of the MenuItem.

Autodesk.AutoCAD.Windows.MenuItem.#ctor(System.String)
Constructor.
value: The text displayed by the MenuItem.

Autodesk.AutoCAD.Windows.MenuItem.Icon
Gets or sets the icon of the MenuItem.

Autodesk.AutoCAD.Windows.MenuItem.Checked
Gets or sets whether the MenuItem shows a check mark next to the text.

Autodesk.AutoCAD.Windows.MenuItem.Visible
Gets or sets whether the MenuItem is visible.

Autodesk.AutoCAD.Windows.MenuItem.Enabled
Gets or sets whether the MenuItem is enabled.

Autodesk.AutoCAD.Windows.MenuItem.Text
Gets or sets the text displayed by the MenuItem.