Autodesk.AutoCAD.PlottingServices.HostAppServices
Defines an interface that plot host applications must implement to provide basic plotting services at runtime. Applications derive from this interface and provide an implementation of the methods listed.

Autodesk.AutoCAD.PlottingServices.HostAppServices.PlotLogger
Gets a PlotLogger object.

Autodesk.AutoCAD.PlottingServices.HostAppServices.UpdatePlotJobStatus(Autodesk.AutoCAD.PlottingServices.AppPlotStatus,System.String)
Applications implement this method to communicate plotting events, conditions, and results to the host application. The host application accordingly updates different user interface elements to give visual feedback to the user about the state of the plot job.
status: PlotStatus reflecting the state of the plot.
message: String for a plot message or DWF file name.