Autodesk.AutoCAD.EditorInput.FenceSelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int32,Autodesk.AutoCAD.EditorInput.PickPointDescriptor[])
Constructor.
path: Subentitiy path.
method: Selection method.
gsMarker: Index for the part of the object that was selected.
descriptors: Describes the shape of a pick point.

Autodesk.AutoCAD.EditorInput.FenceSelectedSubObject.GetIntersectionPoints
Returns the point descriptor array.
Returns: The point descriptor array.

Autodesk.AutoCAD.EditorInput.FenceSelectedSubObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.FenceSelectedSubObject.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.