Autodesk.AutoCAD.EditorInput.PromptDistanceOptions
Represents optional parameters for a distance prompt.

Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.#ctor(System.String,System.String)


Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.DefaultValue
Gets or sets the default value to be used when the user presses ENTER without any other input.

Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.DoIt


Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.GetDefaultValueString
