Autodesk.AutoCAD.Windows.ToolPalette.IAcadStockTool
This interface is defined by the framework. Tool writers implement this interface in a COM object. Each stock tool is implemented in a separate COM object. The framework creates the COM object using information stored in the stock tool file, gets the IAcadStockTool interface, and then calls the interface object's CreateTool() method to create the tools.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadStockTool.CreateTool
Create the COM object which implements the IAcadTool interface if the IAcadStockTool interface is implemented in a separate COM object.