Autodesk.AutoCAD.PlottingServices.ProcessPlotState
Assigns values that describe the current plot process.

Autodesk.AutoCAD.PlottingServices.ProcessPlotState.BackgroundPlotting
Plot is in progress in a background process; this process is the foreground process.

Autodesk.AutoCAD.PlottingServices.ProcessPlotState.ForegroundPlotting
Plot is in progress in the current process.

Autodesk.AutoCAD.PlottingServices.ProcessPlotState.NotPlotting
No plot is in progress.