Autodesk.AutoCAD.Windows.TrayItemCollection
Represents a collection of TrayItem objects.

Autodesk.AutoCAD.Windows.TrayItemCollection.Item(System.Int32)


Autodesk.AutoCAD.Windows.TrayItemCollection.IsReadOnly
Gets a value indicating whether the TrayItemCollection is read-only.

Autodesk.AutoCAD.Windows.TrayItemCollection.IsFixedSize
Gets a value indicating whether the TrayItemCollection has a fixed size.

Autodesk.AutoCAD.Windows.TrayItemCollection.Count
Gets or sets the number of elements contained in this collection.

Autodesk.AutoCAD.Windows.TrayItemCollection.GetEnumerator


Autodesk.AutoCAD.Windows.TrayItemCollection.RemoveAt(System.Int32)


Autodesk.AutoCAD.Windows.TrayItemCollection.Clear


Autodesk.AutoCAD.Windows.TrayItemCollection.CopyTo(Autodesk.AutoCAD.Windows.TrayItem[],System.Int32)


Autodesk.AutoCAD.Windows.TrayItemCollection.Insert(System.Int32,Autodesk.AutoCAD.Windows.TrayItem)


Autodesk.AutoCAD.Windows.TrayItemCollection.Remove(Autodesk.AutoCAD.Windows.TrayItem)


Autodesk.AutoCAD.Windows.TrayItemCollection.Contains(Autodesk.AutoCAD.Windows.TrayItem)


Autodesk.AutoCAD.Windows.TrayItemCollection.IndexOf(Autodesk.AutoCAD.Windows.TrayItem)


Autodesk.AutoCAD.Windows.TrayItemCollection.Add(Autodesk.AutoCAD.Windows.TrayItem)
