Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions
Contains file dialog configuration options that are passed to the Editor.GetFileNameForSave() method.

Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions.#ctor(System.String)
