Autodesk.AutoCAD.Windows.ToolPalette.Catalog
Encapsulates the catalog item in the tool catalog.

Autodesk.AutoCAD.Windows.ToolPalette.Catalog.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.Catalog.{dtor}
