Autodesk.AutoCAD.Windows.ToolPalette.ContextMenuMode.ContextMenuPaletteSetOptionButton


Autodesk.AutoCAD.Windows.ToolPalette.ContextMenuMode.ContextMenuPaletteSetCaption


Autodesk.AutoCAD.Windows.ToolPalette.ContextMenuMode.ContextMenuPaletteSetTab


Autodesk.AutoCAD.Windows.ToolPalette.ContextMenuMode.ContextMenuPaletteBackground


Autodesk.AutoCAD.Windows.ToolPalette.ContextMenuMode.ContextMenuEditorImage


Autodesk.AutoCAD.Windows.ToolPalette.ContextMenuMode.ContextMenuPaletteTool


Autodesk.AutoCAD.Windows.ToolPalette.ContextMenuMode.ContextNone
