Autodesk.AutoCAD.ApplicationServices.ExecuteInApplicationContextCallback
This delegate lets an application determine which method is invoked by a call to the Autodesk.AutoCAD.ApplicationServices.DocumentCollection.ExecuteInApplicationContext method.