Autodesk.AutoCAD.Windows.ToolPalette.ReturnStatus.ContextMenuUpdatePalette


Autodesk.AutoCAD.Windows.ToolPalette.ReturnStatus.ExecutionCancelRejected


Autodesk.AutoCAD.Windows.ToolPalette.ReturnStatus.ExecutionCanceled


Autodesk.AutoCAD.Windows.ToolPalette.ReturnStatus.ContextMenuHide


Autodesk.AutoCAD.Windows.ToolPalette.ReturnStatus.ContextMenuShow
