Autodesk.AutoCAD.PlottingServices.EndPlotEventArgs
Encapsulates the plot-specific information required by the EndPlot event. This information includes a PlotCancelStatus flag.

Autodesk.AutoCAD.PlottingServices.EndPlotEventArgs.#ctor(Autodesk.AutoCAD.PlottingServices.PlotCancelStatus)


Autodesk.AutoCAD.PlottingServices.EndPlotEventArgs.Status
