Autodesk.AutoCAD.Windows.MenuItemCollection.#ctor(Autodesk.AutoCAD.Windows.Menu)
Constructor.
owner: Name of the Configuration Section.

Autodesk.AutoCAD.Windows.MenuItemCollection.Item(System.Int32)


Autodesk.AutoCAD.Windows.MenuItemCollection.Count
Gets the number of elements actually contained in the MenuItemCollection.

Autodesk.AutoCAD.Windows.MenuItemCollection.GetEnumerator
Returns an enumerator object for this collection.
Returns: An enumerator object for this collection.

Autodesk.AutoCAD.Windows.MenuItemCollection.RemoveAt(System.Int32)
Removes the first occurrence of a specific object from the collection.
value: MenuItem to remove from the collection;the value can be a null reference (Nothing in Visual Basic).

Autodesk.AutoCAD.Windows.MenuItemCollection.CopyTo(Autodesk.AutoCAD.Windows.MenuItem[],System.Int32)
Copies this collection or a portion of it to a one-dimensional array.
array: One-dimensional array that is the destination of the elements copied from this collection; the array must have zero-based indexing.
index: The zero-based index in array at which copying begins.

Autodesk.AutoCAD.Windows.MenuItemCollection.Insert(System.Int32,Autodesk.AutoCAD.Windows.MenuItem)
Inserts an element into the MenuItemCollection at the specified index.
index: The zero-based index at which value should be inserted.
value: The MenuItem to insert. The value can be a null reference (Nothing in Visual Basic).

Autodesk.AutoCAD.Windows.MenuItemCollection.Remove(Autodesk.AutoCAD.Windows.MenuItem)
Removes the first occurrence of a specific object from the collection.
value: MenuItem to remove from the collection; the value can be a null reference (Nothing in Visual Basic).

Autodesk.AutoCAD.Windows.MenuItemCollection.Contains(Autodesk.AutoCAD.Windows.MenuItem)
Determines whether an element is in the MenuItemCollection.
value: MenuItem to locate in this collection; the value can be a null reference (Nothing in Visual Basic).
Returns: True if value is found in the MenuItemCollection.

Autodesk.AutoCAD.Windows.MenuItemCollection.IndexOf(Autodesk.AutoCAD.Windows.MenuItem)
Searches for the specified MenuItem and returns Searches for the specified MenuItem and returns the zero-based index of the first occurrence of value within the entire collection, if found; otherwise, returns -1, if found; otherwise, returns -1.
value: MenuItem to locate in the collection; the value can be a null reference (Nothing in Visual Basic).
Returns: The zero-based index of the first occurrence of value within the entire collection, if found; otherwise, returns -1.

Autodesk.AutoCAD.Windows.MenuItemCollection.Add(Autodesk.AutoCAD.Windows.MenuItem)
Adds an object to the end of the MenuItemCollection.
value: The MenuItem to be added to the end of this collection; the value can be a null reference (Nothing in Visual Basic).
Returns: The MenuItemCollection index at which the value has been added.