Autodesk.AutoCAD.PlottingServices.PlotEngine
Applications use an PlotEngine to plot one or more documents to a device or a file,to collect plot information for a background plot, or to preview the plot of a single page.

Autodesk.AutoCAD.PlottingServices.PlotEngine.IsBackgroundPackaging
Gets whether the engine is packaging for a background plot.

Autodesk.AutoCAD.PlottingServices.PlotEngine.BeginPlot(Autodesk.AutoCAD.PlottingServices.PlotProgress,System.Object)
Call this method when not already plotting.Close by calling EndPlot().
plotProgress: PlotProgress object,or null.
parameters: Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.EndPlot(System.Object)
Closes a call to BeginPlot().
parameters: a PreviewEndPlotInfo object.

Autodesk.AutoCAD.PlottingServices.PlotEngine.BeginDocument(Autodesk.AutoCAD.PlottingServices.PlotInfo,System.String,System.Object,System.Int32,System.Boolean,System.String)
Call this method when plotting but not already in a document.Close by calling EndDocument().
plotInfo: A validated PlotInfo template for the document.
documentName: Document name.
parameters: Reserved for future use.
copies: Number of copies desired;1 if plotting to a file.
plotToFile: Indicating whether to plot to a file or a device.
fileName: Full path and file name,if plotting to a file.

Autodesk.AutoCAD.PlottingServices.PlotEngine.EndDocument(System.Object)
Closes a call to BeginDocument().
parameters: Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.BeginPage(Autodesk.AutoCAD.PlottingServices.PlotPageInfo,Autodesk.AutoCAD.PlottingServices.PlotInfo,System.Boolean,System.Object)
Call this method when plotting a document but not already in a page. Close by calling EndPage().
pageInfo: Page information, modified in this call to reflect the pre-scan of the page.
plotInfo: The validated PlotInfo for this page.
lastPage: Indicating whether this is the last page in the document.
parameters: Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.EndPage(System.Object)
Closes a call to BeginPage().
parameters: Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.BeginGenerateGraphics(System.Object)
Closes a call to BeginPage().
parameters: Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.EndGenerateGraphics(System.Object)
Call this method when plotting a page but not already generating graphics. Close by calling EndGenerateGraphics().
parameters: Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.{dtor}
