Autodesk.AutoCAD.Windows.PaletteSetTitleBarLocation
Represents values indicating the title bar location for a palette set.

Autodesk.AutoCAD.Windows.PaletteSetTitleBarLocation.Right


Autodesk.AutoCAD.Windows.PaletteSetTitleBarLocation.Left
