Autodesk.AutoCAD.GraphicsSystem.LinePattern


Autodesk.AutoCAD.GraphicsSystem.LinePattern.Solid


Autodesk.AutoCAD.GraphicsSystem.LinePattern.DefaultLinePattern


Autodesk.AutoCAD.GraphicsSystem.LinePattern.SparseDot


Autodesk.AutoCAD.GraphicsSystem.LinePattern.MediumDashDotShortDashDot


Autodesk.AutoCAD.GraphicsSystem.LinePattern.LongDashDot


Autodesk.AutoCAD.GraphicsSystem.LinePattern.LongDashDotDot


Autodesk.AutoCAD.GraphicsSystem.LinePattern.LongDashShortDash


Autodesk.AutoCAD.GraphicsSystem.LinePattern.MediumDashShortDashShortDash


Autodesk.AutoCAD.GraphicsSystem.LinePattern.MediumLongDash


Autodesk.AutoCAD.GraphicsSystem.LinePattern.DoubleLongDash


Autodesk.AutoCAD.GraphicsSystem.LinePattern.DoubleMediumDash


Autodesk.AutoCAD.GraphicsSystem.LinePattern.DoubleShortDash


Autodesk.AutoCAD.GraphicsSystem.LinePattern.LongDash


Autodesk.AutoCAD.GraphicsSystem.LinePattern.MediumDash


Autodesk.AutoCAD.GraphicsSystem.LinePattern.ShortDash


Autodesk.AutoCAD.GraphicsSystem.LinePattern.DashDot


Autodesk.AutoCAD.GraphicsSystem.LinePattern.Dotted


Autodesk.AutoCAD.GraphicsSystem.LinePattern.Dashed
