Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangeVetoedEventArgs
Provides data for the DocumentLockModeChangeVetoed event of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangeVetoedEventArgs.GlobalCommandName
Gets the name of the command that was requesting the change.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangeVetoedEventArgs.Document
Gets the document that was requesting the change.