Autodesk.AutoCAD.PlottingServices.DsdData
Reads and writes DSD files. It holds an array of PlottingServices.DSDEntry objects in addition to DSD sheet set information.

Autodesk.AutoCAD.PlottingServices.DsdData.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.PlottingServices.DsdData.Dwf3dOptions
Gets the 3D DWF options object.

Autodesk.AutoCAD.PlottingServices.DsdData.LogFilePath
Gets or sets the path to the file to which the publish operation logs errors. This field is serialized in the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.CategoryName
Gets or sets the category name of the publish job operation.

Autodesk.AutoCAD.PlottingServices.DsdData.SelectionSetName
Gets or sets the name of a named selection set. This property is valid only if plotting a sheet set or a selection set from the Sheet Set Manager.

Autodesk.AutoCAD.PlottingServices.DsdData.PlotStampOn
Gets or sets a Boolean indicating whether plot stamping is on.

Autodesk.AutoCAD.PlottingServices.DsdData.IsHomogeneous
Gets or sets a Boolean indicating whether all the sheets in the sheet set are homogenous (in other words, are plotting to similar devices).

Autodesk.AutoCAD.PlottingServices.DsdData.IsSheetSet
Gets or sets a Boolean indicating whether the DSD data is sheet set information.This field is stored in the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.NoOfCopies
Gets or sets the quantity of each sheet or layout to be plotted.

Autodesk.AutoCAD.PlottingServices.DsdData.SheetSetName
Gets or sets the sheet set name, which will be valid only if a sheet set is being published.

Autodesk.AutoCAD.PlottingServices.DsdData.MinorVersion
Gets or sets the minor version number of the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.MajorVersion
Gets or sets the major version number of the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.UnrecognizedDataSections
Gets an array of character data contained in each unrecognized section.

Autodesk.AutoCAD.PlottingServices.DsdData.UnrecognizedDataSectionNames
Gets an array of unrecognized section headings.

Autodesk.AutoCAD.PlottingServices.DsdData.Password
Gets or sets the password or phrase used to protect the contents of the output DWF file.

Autodesk.AutoCAD.PlottingServices.DsdData.SheetType
Gets or sets the sheet type field, which is stored in the DSD file and indicates whether the publish operation is configured for multi-sheet DWF plotting, for individual (per-sheet) DWF plotting, or for plotting to the original device configured in the sheet.

Autodesk.AutoCAD.PlottingServices.DsdData.DestinationName
Gets or sets the output DWF file path.

Autodesk.AutoCAD.PlottingServices.DsdData.ProjectPath
Gets or sets the output folder name. This field is relevant only for plotting to a file.

Autodesk.AutoCAD.PlottingServices.DsdData.GetDsdEntryCollection
All the sheets configured for publishing are returned as individual entries in the array of DSD sheet entry objects.
Returns: Array of DSD sheet entries.

Autodesk.AutoCAD.PlottingServices.DsdData.SetDsdEntryCollection(Autodesk.AutoCAD.PlottingServices.DsdEntryCollection)
Sets the array of sheets configured for publishing, which is stored in the DSD file.
entries: Array of sheet entries.

Autodesk.AutoCAD.PlottingServices.DsdData.SetUnrecognizedData(System.Collections.Specialized.StringCollection,System.Collections.Specialized.StringCollection)
When a DSD file is read, sections that are not understood are collected as "unrecognized" data. This method allows users of PlottingServices.DSDData objects to store an array of customized DSD sections and data.
sectionNames: Array of customized (unrecognized) section data.
sectionData: Array of customized (unrecognized) section data.

Autodesk.AutoCAD.PlottingServices.DsdData.SetUnrecognizedData(System.String,System.String)
When a DSD file is read, sections that are not understood are collected as "unrecognized" data. This method allows users of PlottingServices.DSDData objects to store a customized DSD section and data.
sectionNames: Array of customized (unrecognized) section headings.
sectionData: Array of customized (unrecognized) section data.

Autodesk.AutoCAD.PlottingServices.DsdData.ReadDsd(System.String)
Reads a DSD file.
fileName: Path and file name of DSD file.
Returns: A Boolean indicating whether the read operation was successful.

Autodesk.AutoCAD.PlottingServices.DsdData.WriteDsd(System.String)
Writes information to a DSD file.
fileName: Path and file name of DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.Copy
Gets a copy of the PlottingServices.DsdData object.
Returns: A copy of the PlottingServices.DsdData object.

Autodesk.AutoCAD.PlottingServices.DsdData.{dtor}
