Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.IsReadOnly
Gets the IsReadOnly property value.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.CreateSubsection(System.String)
Creates a configuration subsection named name.
name: Subsection name.
Returns: A configuration subsection named name.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.OpenSubsection(System.String)
This method should be implemented to open the configuration subsection named name.
name: Subsection name.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.ContainsSubsection(System.String)
This method should be implemented to verify whether the configuration section contains a subsection named name.
name: Subsection name.
Returns: True if the configuration section contains a subsection named name.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.DeleteSubsection(System.String)
This method should be implemented to delete the configuration subsection named name.
name: Subsection name.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.ReadProperty(System.String,System.Object)
This method should be implemented to return the value of a property named name. It should return defaultValue if name does not exist.
name: Property name.
defaultValue: Default Value of the property name.
Returns: The value of a property named name.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.WriteProperty(System.String,System.Object)
This method should be implemented to assign the value value to the property named name.
name: Property name.
value: Property value.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.Contains(System.String)
Returns a value indicating whether the collection contains an object that matches name.
name: Name of the value.
Returns: A value indicating whether the collection contains an object that matches value.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.Delete(System.String)
This method should be implemented to delete the value named name in the configuration section.
name: Name of the value.