Autodesk.AutoCAD.EditorInput.PromptSelectionOptions
Provides optional parameters to a selection set prompt.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.RejectPaperspaceViewport


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.RejectObjectsFromNonCurrentSpace


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.RejectObjectsOnLockedLayers


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.ForceSubSelections


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.AllowSubSelections


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.SingleOnly


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.PrepareOptionalDetails


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.Keywords


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.SelectEverythingInAperture


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.AllowDuplicates


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.SinglePickInSpace


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.MessageForRemoval


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.MessageForAdding


Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.SetKeywords(System.String,System.String)
Sets the display keywords to keywords and the global keywords to globalKeywords.
keywords: The display keywords.
globalKeywords: The global keywords.