Autodesk.AutoCAD.Windows.ColorDialog
Represents a dialog box that allows the user to choose a color.

Autodesk.AutoCAD.Windows.ColorDialog.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ColorDialog.Color
Gets or sets the color that user chosen or sets the default.

Autodesk.AutoCAD.Windows.ColorDialog.ShowDialog
Starts the Set Color dialog box within the AutoCAD editor.
Returns: One of the DialogResult values.

Autodesk.AutoCAD.Windows.ColorDialog.SetDialogTabs(Autodesk.AutoCAD.Windows.ColorDialog.ColorTabs)
Sets which Color Tabs are displayed in this Color dialog.
value: Color Tabs.