Autodesk.AutoCAD.Windows.ToolPalette.tagCADWORD
This .NET struct wraps the CADWORD struct of the Windows API.

Autodesk.AutoCAD.Windows.ToolPalette.tagCADWORD.cElems


Autodesk.AutoCAD.Windows.ToolPalette.tagCADWORD.pElems
