Autodesk.AutoCAD.ApplicationServices.DocumentBeginCloseEventArgs
Provides data for the BeginDocumentClose event of the Document.

Autodesk.AutoCAD.ApplicationServices.DocumentBeginCloseEventArgs.#ctor
Initializes a new instance of the  class.