Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags
This enumeration represents configuration settings for the OpenFileDialog class.

Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags.AllowMultiple
The dialog allows the selection of multiple file.

Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags.AllowFoldersOnly
The dialog displays only folders and allows the selection of a folder only.

Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags.NoShellExtensions
Do not enable shell namespace extension items.

Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags.NoFtpSites
The FTP sites item is not present and cannot be browsed.

Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags.ForceDefaultFolder
Force the initial directory to be the one specified.

Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags.NoUrls
Do not allow URLs at all.

Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags.DoNotTransferRemoteFiles
Do not transfer remote file when user specifies a URL.

Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags.DefaultIsFolder
Displays the path in the Directory text line, leaves the File edit box blank, and disables the Default button.

Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags.AllowAnyExtension
Enables the user to enter an arbitrary file name extension.

Autodesk.AutoCAD.Windows.OpenFileDialog.OpenFileDialogFlags.SearchPath
Performs a library search for the file name entered.