Autodesk.AutoCAD.Publishing.EPlotProperty
This class is a lightweight proxy for the DWF EPlotProperty object. It allows clients of the DMM (DWF Metadata Manager) API to add properties to an EPlotPropertyCollection object, which in turn is used to associate properties with an entity in a DWF file without linking to the DWF toolkit.

Autodesk.AutoCAD.Publishing.EPlotProperty.#ctor(System.String,System.String)
Constructs an EPlotProperty wrapping a name and value.
name: Unicode string supplying the name of the property.
val: Unicode string supplying a value for the property;this must not exceed 8192 bytes after XML encoding.

Autodesk.AutoCAD.Publishing.EPlotProperty.#ctor
Default constructor.Initializes data members to an empty state.

Autodesk.AutoCAD.Publishing.EPlotProperty.Attributes
Gets or sets an object to the internal vector of XML Attributes.

Autodesk.AutoCAD.Publishing.EPlotProperty.Value
Gets or sets the required property value attribute.

Autodesk.AutoCAD.Publishing.EPlotProperty.Name
Gets or sets the required property name attribute.

Autodesk.AutoCAD.Publishing.EPlotProperty.Category
Gets or sets the optional category attribute.

Autodesk.AutoCAD.Publishing.EPlotProperty.Units
Gets or sets the optional units attribute.

Autodesk.AutoCAD.Publishing.EPlotProperty.Type
Gets or sets the optional type attribute.

Autodesk.AutoCAD.Publishing.EPlotProperty.AddEplotAttribute(Autodesk.AutoCAD.Publishing.EPlotAttribute)
Adds a new Attribute object to the internal vector of XML Attributes.
att: The XML attribute object to be added to the XML attributes vector.

Autodesk.AutoCAD.Publishing.EPlotProperty.AddEPlotAttribute(System.String,System.String,System.String,System.String)
Creates and adds a new Attribute object to the internal vector of XML Attributes.
ns: Namespace name.
nsUrl: The attribute's namespace location.
attName: Attribute name.
attValue: Attribute value.