Autodesk.AutoCAD.Publishing.EPlotPropertyCollection
Contains a collection of EPlotPropertyobjects. An EPlotPropertyCollection object is returned by the EPlotPropertyBag.Properties property.

Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.Item(System.Int32)


Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.Count


Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.SyncRoot


Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.IsSynchronized


Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.GetEnumerator


Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.CopyTo(System.Array,System.Int32)


Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.Add(Autodesk.AutoCAD.Publishing.EPlotProperty)


Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.Clear
