Autodesk.AutoCAD.Windows.ToolPalette.TargetProductInfo
Defines data needed by entries in a CatalogItem object's target product list.

Autodesk.AutoCAD.Windows.ToolPalette.TargetProductInfo.#ctor(System.String,System.String,System.Version,System.Version)


Autodesk.AutoCAD.Windows.ToolPalette.TargetProductInfo.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.TargetProductInfo.MaximumVersion
Major version is in HIWORD. Minor version is in LOWORD. Zero if not specified.

Autodesk.AutoCAD.Windows.ToolPalette.TargetProductInfo.MinimumVersion
Major version is in HIWORD. Minor version is in LOWORD. Zero if not specified.

Autodesk.AutoCAD.Windows.ToolPalette.TargetProductInfo.LocaleId
Locale IDs. May include multiple IDs separated by commas. Empty string if not specified.

Autodesk.AutoCAD.Windows.ToolPalette.TargetProductInfo.ProductName
Product name, or an empty string if not specified.