Autodesk.AutoCAD.Windows.ToolPalette.StockTool
Represents a registered stock tool.

Autodesk.AutoCAD.Windows.ToolPalette.StockTool.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.StockTool.ModuleInstallArguments
Gets or sets the command line options of msiexec.exe that are used during the installation of the stock tool MSI file.

Autodesk.AutoCAD.Windows.ToolPalette.StockTool.ModuleInstallUrl
Gets or sets the URL of the MSI file that installs the stocktool binary.

Autodesk.AutoCAD.Windows.ToolPalette.StockTool.ModuleFileName
Gets or sets the file name (with the relative or full path) of the DLL that contains the COM object implementing the stock tool.

Autodesk.AutoCAD.Windows.ToolPalette.StockTool.ComClassID
Gets or sets the class ID of the COM class that implements the stock tool by implementing the IAcadStockTool interface. This class ID can be used to create the COM object and get the IAcadStockTool interface.

Autodesk.AutoCAD.Windows.ToolPalette.StockTool.CreateTool
Creates the tool object.
Returns: The newly created ToolPalette.Tool.

Autodesk.AutoCAD.Windows.ToolPalette.StockTool.CreateTool(System.Boolean)
Creates the tool object.
setDefaults: If true, sets the default properties of the tool by copying the stock tool's properties; if false, does not set the tool properties.
Returns: The newly created ToolPalette.Tool.

Autodesk.AutoCAD.Windows.ToolPalette.StockTool.CreateAcadStockTool
Creates the COM object which implements the IAcadTool interface.
Returns: The COM object that implements the IAcadTool interface.

Autodesk.AutoCAD.Windows.ToolPalette.StockTool.CreateAcadTool
Creates the COM object that implements the IAcadStockTool interface.
Returns: The COM object that implements the IAcadStockTool interface.

Autodesk.AutoCAD.Windows.ToolPalette.StockTool.{dtor}
