Autodesk.AutoCAD.EditorInput.PromptOptions.#ctor(System.String,System.String)


Autodesk.AutoCAD.EditorInput.PromptOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.PromptOptions.AppendKeywordsToMessage


Autodesk.AutoCAD.EditorInput.PromptOptions.FormatPrompt


Autodesk.AutoCAD.EditorInput.PromptOptions.GetDefaultValueString


Autodesk.AutoCAD.EditorInput.PromptOptions.DoIt


Autodesk.AutoCAD.EditorInput.PromptOptions.SetMessageAndKeywords(System.String,System.String)
Sets the prompt message to the first part of the messageAndKeywords string and sets the display keywords to the latter part of the same string.
messageAndKeywords: The prompt message.
globalKeywords: