Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs
Provides data for the DocumentLockModeWillChange event of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs.GlobalCommandName
Gets the name of the command that is requesting the change.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs.CurrentMode
Gets the current lock mode of the document.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs.MyCurrentMode
Gets the current locks that this fiber has on the document.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs.MyNewMode
Gets the new lock mode being requested.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs.Document
Gets the document that is requesting the change.