Autodesk.AutoCAD.EditorInput.PromptSelectionOptionsEventArgs
Provides data for the PromptingForSelection event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptionsEventArgs.GetPoints
Gets the array of points associated with this selection operation.
Returns: The array of points associated with this selection operation.