Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions


Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions.#ctor(System.String,System.String)


Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions.DefaultValue


Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions.GetDefaultValueString
