Autodesk.AutoCAD.PlottingServices.PlotInfoValidator
Merges plot settings from a layout object,a PlotSettings object(settings overrides),and an output device override into a new plot settings object.The validator returns a set of codes indicating any problems found during the merge operation.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.MediaMatchingThreshold
Gets or sets the current media matching threshold, which is the maximum total of error values allowed when matching media sizes.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.SheetDimensionalWeight
Gets or sets the current sheet dimensional weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.DimensionalWeight
Gets or sets the current dimensional weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.PrintableBoundsWeight
Gets or sets the current printable bounds weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.MediaBoundsWeight
Gets or sets the current media bounds weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.SheetMediaGroupWeight
Gets or sets the current sheet dimensional weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.MediaGroupWeight
Gets or sets the current media group weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.MediaMatchingPolicy
Gets or sets the current the current media matching policy used by the validator for validating media sizes.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.Validate(Autodesk.AutoCAD.PlottingServices.PlotInfo)
The validator performs validation of the layout,plot settings overrides,and plot device overrides on a PlotInfo object.
info: PlotInfo object to validate.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.IsCustomPossible(Autodesk.AutoCAD.PlottingServices.PlotInfo)
Checks to see if the validator can create a custom media size using the specified PlotInfo object.
info: PlotInfo object containing the layout, overrides, and device override with which to perform the custom paper size check.
Returns: A value containing coded bitwise OR flags of the CustomSizeResult enum,indicating what (if any) problems would be encountered creating a custom paper size for the device.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.{dtor}
