Autodesk.AutoCAD.EditorInput.Keyword
Represents a keyword in a prompt.

Autodesk.AutoCAD.EditorInput.Keyword.Enabled
Gets or sets whether the keyword is currently enabled. When a a keyword is disabled it isn't accepted as user input.

Autodesk.AutoCAD.EditorInput.Keyword.Visible
Gets or sets whether the keyword should be shows to the user.

Autodesk.AutoCAD.EditorInput.Keyword.DisplayName
Gets or sets the display name of the keyword. This is shown on the command line. Usually the same as localName.

Autodesk.AutoCAD.EditorInput.Keyword.GlobalName
Gets or sets the local name of the keyword. This is entered by the user to choose the keyword.

Autodesk.AutoCAD.EditorInput.Keyword.LocalName
Gets or sets the global name of the keyword. This is never displayed and can be used by programs to access keywords without knowing the local translation.