Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs
Provides data for the AboutToBeginPublishing event.

Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs.PlotLogger
Gets access to the plot logger object.Clients don't need to create or destroy this object.

Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs.JobWillPublishInBackground
Gets a Boolean indicating whether the job will publish in the background.

Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs.DsdData
Gets the DSD object for this publish job.

Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs.ReadPrivateSection(System.String)
Provides read-write access to the client's private DSD data.
sectionName: Name that the client assigned to its private DSD data section as a null-terminated mbcs string.
Returns: Object with name-value pairs for the section requested.

Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs.WritePrivateSection(System.String,System.Collections.IDictionaryEnumerator)
Replaces a section of the same name.Fails if it attempts to replace a recognized section of standard DSD data.
sectionName: Name the client assigned to its private DSD data section as a null-terminated mbcs string.
data: Name-value pairs to update in the client section of the DSD file.