Autodesk.AutoCAD.Windows.DropTarget
Applications derive from this class to implement custom drag-and-drop behavior in AutoCAD. See the Microsoft documentation for the IDropTarget interface for detailed information.

Autodesk.AutoCAD.Windows.DropTarget.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.DropTarget.OnDrop(System.Windows.Forms.DragEventArgs)


Autodesk.AutoCAD.Windows.DropTarget.OnDragOver(System.Windows.Forms.DragEventArgs)


Autodesk.AutoCAD.Windows.DropTarget.OnDragLeave


Autodesk.AutoCAD.Windows.DropTarget.OnDragEnter(System.Windows.Forms.DragEventArgs)
