Autodesk.AutoCAD.Windows.ToolPalette.ImageList
Used to manage the images associated with a catalog item.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.Count
Gets the number of images.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.GetImageInfo(System.Int32)
Copies the information of the image at the specified index to the ImageInfo structure.
index: Zero-based index of the image; the index should be in the range of zero to one less than the number of images.
Returns: Receives information of the image stored at the specified index.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.SetImageInfo(System.Int32,Autodesk.AutoCAD.Windows.ToolPalette.ImageInfo)
Copies the information that is passed to the corresponding image at the specified index.
index: Zero-based index of the image; the index should be in the range of zero to one less than the number of images.
info: An ImageInfo structure contains the information that needs to be set at the specified index.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.GetImage(System.Int32)
Returns the image at the specified index.
index: Zro-based index of the image; the index should be in the range of zero to one less than the number of images.
Returns: The image at the specified index.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.SetImage(System.Int32,Autodesk.AutoCAD.Windows.ToolPalette.Image)
Replaces an image with a new one at the specified index.
index: Zero-based index of the image; the index should be in the range of zero to one less than the number of images.
image: An Image object that needs to be set at the specified index.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.Add(Autodesk.AutoCAD.Windows.ToolPalette.ImageInfo)
Makes a copy of the image information and appends it to the image list.
info: An ImageInfo object contains the information that needs to be added to the list.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.Add(Autodesk.AutoCAD.Windows.ToolPalette.Image)
Appends the new image as the last image of the list.
image: An Image object that needs to be added.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.UpdateImage(Autodesk.AutoCAD.Windows.ToolPalette.Image)
Checks the image list for the image with the same size as the passed image and, if it finds it, replaces it with the passed image. If there is no image with the same size as the passed image, then the passed image is added to the image list. If the image list has multiple images of the same size, the first image with the size is updated.
image: An Image object that needs to replace the image of the same size.
Returns: The zero-based index of the updated or added image if successful, and returns -1 if it fails.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.Delete(System.Int32)
Deletes the image at the specified index.
index: Zero-based index of the image; the index should be in the range of zero to one less than the number of images.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.DeleteAllImages
Deletes all of the images in the image list.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.LoadImageW(System.Int32)


Autodesk.AutoCAD.Windows.ToolPalette.ImageList.GetImageIndex(System.Drawing.Size,System.Boolean)
If exactMatch is false, and if the image with the same size is not found, then the index of the image with the next highest size is returned. If the next highest size is not available, then the index of the image with the next lowest size is returned.
size: Size of the image; only width is used and height is ignored.
exactMatch: If true, then the index of the image matching the exact size is returned; if false, then the index of the image matching the next highest size is returned.
Returns: The zero-based index of the new image if successful.

Autodesk.AutoCAD.Windows.ToolPalette.ImageList.{dtor}
