Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute
Encapsulates properties of IPerPropertyBrowsing objects implemented for a tool palette.

Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.#ctor(System.Int32,System.String,System.String,System.Int32,System.String,System.Int32,System.Int32,System.Boolean,System.Int32,System.Int32)


Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.Weight


Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.IntegralHeight


Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.IsFullView


Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.TextColor


Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.EllipsisBmpType


Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.EllipsisBmpResource


Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.LeftIconType


Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.LefIconResource


Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.ProgId


Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.DispId
