Autodesk.AutoCAD.Windows.ToolPalette.SchemeCollection
Encapsulates the schemes currently owned by the ToolPaletteManager object.

Autodesk.AutoCAD.Windows.ToolPalette.SchemeCollection.Item(System.Int32)


Autodesk.AutoCAD.Windows.ToolPalette.SchemeCollection.Count


Autodesk.AutoCAD.Windows.ToolPalette.SchemeCollection.GetEnumerator


Autodesk.AutoCAD.Windows.ToolPalette.SchemeCollection.CopyTo(Autodesk.AutoCAD.Windows.ToolPalette.Scheme[],System.Int32)


Autodesk.AutoCAD.Windows.ToolPalette.SchemeCollection.Add(System.String)


Autodesk.AutoCAD.Windows.ToolPalette.SchemeCollection.Remove(Autodesk.AutoCAD.Windows.ToolPalette.Scheme)


Autodesk.AutoCAD.Windows.ToolPalette.SchemeCollection.Remove(System.String)


Autodesk.AutoCAD.Windows.ToolPalette.SchemeCollection.Find(System.String)
