Autodesk.AutoCAD.Windows.StatusBarMouseDownEventArgs
Provides event parameters related to the mouse-down events in the status bar area.

Autodesk.AutoCAD.Windows.StatusBarMouseDownEventArgs.Button
Gets a bitwise combination of the MouseButtons enumeration values.

Autodesk.AutoCAD.Windows.StatusBarMouseDownEventArgs.DoubleClick
Gets true if the mouse event is a double click.

Autodesk.AutoCAD.Windows.StatusBarMouseDownEventArgs.Y
Gets Y mouse screen coordinate.

Autodesk.AutoCAD.Windows.StatusBarMouseDownEventArgs.X
Gets X mouse screen coordinate.