Autodesk.AutoCAD.PlottingServices.PreviewEndPlotStatus
Status values for PreviewEndPlotInfo object.

Autodesk.AutoCAD.PlottingServices.PreviewEndPlotStatus.Cancel
The preview has terminated abnormally. The user or the host application has requested that the entire plotting operation be terminated and control should be returned to the host application. (For example, if the preview occurred because of a custom AutoCAD command, the command should be terminated and control returned to AutoCAD.).

Autodesk.AutoCAD.PlottingServices.PreviewEndPlotStatus.Previous
The user has exited the preview state by clicking on the Previous Sheet preview state toolbar button.

Autodesk.AutoCAD.PlottingServices.PreviewEndPlotStatus.Next
The user has exited the preview state by clicking on the Next Sheet preview state toolbar button.

Autodesk.AutoCAD.PlottingServices.PreviewEndPlotStatus.Plot
The preview has terminated normally, and the user has requested a plot operation directly from the preview user interface. Client applications should proceed with a plot using the same PlotInfo object that was used to generate the preview.

Autodesk.AutoCAD.PlottingServices.PreviewEndPlotStatus.Normal
The preview has terminated normally, and the user has not requested a plot operation directly from the plot preview user interface.