Autodesk.AutoCAD.Windows.Visuals
Represents various reusable visuals of the AutoCAD editor.

Autodesk.AutoCAD.Windows.Visuals.PickBitmap
Gets the pick point icon.

Autodesk.AutoCAD.Windows.Visuals.PickSetBitmap
Gets the pick objects icon.

Autodesk.AutoCAD.Windows.Visuals.ApplicationIcon
Gets the AutoCAD application icon.