Autodesk.AutoCAD.EditorInput.PromptNestedEntityResult
Holds the result of a prompt that returns a nested entity as its primary result.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityResult.GetContainers
Gets an array of containers in which this entity is nested.
Returns: An array of object IDs representing the containers of this nested entity.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityResult.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.