Autodesk.AutoCAD.EditorInput.PromptFileNameResult
Contains the result returned from prompts that request a file name, such as the Editor.GetFileNameForSave() and Editor.GetFileNameForOpen() methods.

Autodesk.AutoCAD.EditorInput.PromptFileNameResult.ReadOnly


Autodesk.AutoCAD.EditorInput.PromptFileNameResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptFileNameResult.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.