Autodesk.AutoCAD.Windows.ToolPalette.tagCALPOLESTR
This .NET struct wraps the CALPOLESTR struct of the Windows API.

Autodesk.AutoCAD.Windows.ToolPalette.tagCALPOLESTR.cElems


Autodesk.AutoCAD.Windows.ToolPalette.tagCALPOLESTR.pElems
