Autodesk.AutoCAD.Windows.LineWeightDialog
Represents a dialog box that allows the user to choose a lineweight.

Autodesk.AutoCAD.Windows.LineWeightDialog.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.LineWeightDialog.LineWeight
Gets the lineweight that user chosen or sets the default.

Autodesk.AutoCAD.Windows.LineWeightDialog.IncludeByBlockByLayer
Gets or sets whether meta lineweights are to be included.

Autodesk.AutoCAD.Windows.LineWeightDialog.ShowDialog
Starts the Set lineweight dialog box within the AutoCAD editor.
Returns: One of the DialogResult values.