Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyDisplay
Objects and commands implement this interface to customize display properties on a per-property basis.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyDisplay.GetCustomPropertyCtrl(System.Object,System.UInt32,System.String@)
Supplies a custom ActiveX control for property display/edit on a per-property basis.
id: For static properties, the DISPID of the method/property for which an object/command wishes to supply custom ActiveX control for display/edit ; for dynamic properties, the object/command to get the progId of the custom ActiveX control in the programId output parameter.
lcid: Local language identifier.
programId: string contains the ProgId of supplied custom ActiveX control.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyDisplay.GetPropertyIcon(System.Object,System.Object@)
Enables objects to supply custom left property icons on a per-property basis.
id: Static properties: DISPD; Dynamic properties: the object.
icon: Output from which the IPicture interface will be queried for the left property icon display.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyDisplay.GetPropTextColor(System.Object,System.UInt32@)
Defines a custom label text color for a property.
id: Static properties: DISPD; Dynamic properties: the object.
textColor: Value used for property label text display in the Property Inspector.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyDisplay.IsFullView(System.Object,System.Boolean@,System.UInt32@)
Increases the width and height with which an ActiveX control is displayed for property display/edits.
id: Static properties: DISPD; Dynamic properties: the object.
visible: True if the property label is hidden from display and the property display/edit control is displayed in the entire property row space in the Property Inspector control's display.
integralHeight: Integral height, in number of rows, in which the edit control is displayed by the Property Inspector.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyDisplay.GetPropertyWeight(System.Object,System.Int32@)
Specifies a relative weight used by the Property Inspector to order the display of categories and properties at a given level.
id: Static properties: DISPD; Dynamic properties: the object.
propertyWeight: Property weight.