Autodesk.AutoCAD.GraphicsSystem.Manager
Provides services that helps to hide the details of connecting AutoCAD and ARX applications to the graphics system (GS).

Autodesk.AutoCAD.GraphicsSystem.Manager.#ctor(System.IntPtr)


Autodesk.AutoCAD.GraphicsSystem.Manager.DisplaySize


Autodesk.AutoCAD.GraphicsSystem.Manager.DeleteUnmanagedObject


Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADModel
Creates a GraphicsSystem.Model object with the RenderType.Main RenderType (which is a hint to the graphics system that the geometry in this model should be rasterized into its main frame buffer).
Returns: An Autodesk.AutoCAD.GraphicsSystem.Model object.

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADViewport(Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord)
Creates a View object.The Drawable added to the View object corresponds to the specified ViewportTableRecord.
vp: ViewportTableRecord.
Returns: A View object.

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADView(Autodesk.AutoCAD.GraphicsInterface.Drawable)
Creates a View object.The Manager adds the Drawable passed in to this View object along with the Model associated with the Database.
vp: Drawable.
Returns: A View object.

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADDevice(System.IntPtr)
Creates a GraphicsSystem.Device object. The window handle passed in to this method is the display surface onto which the graphics system draws. The Manager also configures this Autodesk.AutoCAD.GraphicsSystem.Device object with the ACI logical palette.
hwnd: Window handle.
Returns: A GraphicsSystem.Device object.

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADOffScreenDevice
Constructs a GraphicsSystem.Device object that supports off-screen rendering.The Manager also configures this Autodesk.AutoCAD.GraphicsSystem.Device object with the ACI logical palette and sets the device's background color.
Returns: A GraphicsSystem.Device object.

Autodesk.AutoCAD.GraphicsSystem.Manager.GetDBModel
Returns the Model associated with the Database.
Returns: The Model associated with the Database.

Autodesk.AutoCAD.GraphicsSystem.Manager.GetGUIDevice
Returns the Device associated with the AutoCAD display window.
Returns: The Device associated with the AutoCAD display window.

Autodesk.AutoCAD.GraphicsSystem.Manager.SetViewportFromView(System.Int32,Autodesk.AutoCAD.GraphicsSystem.View,System.Boolean,System.Boolean,System.Boolean)
Sets the view parameters for the indicated viewport.
viewportNumber: View number.
view: View parameters.
regenRequired: Argument to cause a 2D regen.
rescaleRequired: Argument to cause a 2D rescale.
syncRequired: Boolean indicating whether or not to sync the 2D view parameters with the new parameters.

Autodesk.AutoCAD.GraphicsSystem.Manager.SetViewportFromView(System.Int32,Autodesk.AutoCAD.GraphicsSystem.View)
Sets the view parameters for the indicated viewport.
viewportNumber: View number.
view: View parameters.

Autodesk.AutoCAD.GraphicsSystem.Manager.SetViewFromViewport(Autodesk.AutoCAD.GraphicsSystem.View,System.Int32)
Sets the view parameters for the indicated viewport.
view: View parameters.
viewportNumber: View number.

Autodesk.AutoCAD.GraphicsSystem.Manager.GetGsView(System.Int32,System.Boolean)
Retrieves the persistently shaded View associated with the specified viewport.
viewportNumber: View number.
createIfNone: Flag to create a persistent view if none is present.
Returns: The persistently shaded View associated with the specified viewport.

Autodesk.AutoCAD.GraphicsSystem.Manager.{dtor}


Autodesk.AutoCAD.GraphicsSystem.Manager.GsToBeUnloaded
Occurs when the GS is about to be unloaded.

Autodesk.AutoCAD.GraphicsSystem.Manager.ViewToBeDestroyed
Occurs when the specified view is just about to be destroyed.

Autodesk.AutoCAD.GraphicsSystem.Manager.ViewWasCreated
Occurs when the specified view has just been created.