Autodesk.AutoCAD.EditorInput.PromptResult.StringResult
Gets the optional string result of the prompt operation. This value is set when Status is PromptStatus.Keyword or a prompt that returns a string as its primary result.

Autodesk.AutoCAD.EditorInput.PromptResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptResult.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.