Autodesk.AutoCAD.Publishing.AboutToBeginBackgroundPublishingEventArgs
Pprovides data for the AboutToBeginBackgroundPublishing event.

Autodesk.AutoCAD.Publishing.AboutToBeginBackgroundPublishingEventArgs.JobWillPublishInBackground
Gets a Boolean indicating whether the job will publish in the background.

Autodesk.AutoCAD.Publishing.AboutToBeginBackgroundPublishingEventArgs.DsdData
Gets the DSD object for this publish job.

Autodesk.AutoCAD.Publishing.AboutToBeginBackgroundPublishingEventArgs.ReadPrivateSection(System.String)
Provides read access to the client's private DSD data.
sectionName: Name that the client assigned to its private DSD data section as a null-terminated mbcs string.
Returns: An empty IDictionaryEnumerator if the section is not found. Otherwise, returns a IDictionaryEnumerator object with name-value pairs for the section requested.

Autodesk.AutoCAD.Publishing.AboutToBeginBackgroundPublishingEventArgs.WritePrivateSection(System.String,System.Collections.IDictionaryEnumerator)
Replaces a section of the same name.
sectionName: Name the client assigned to its private DSD data section as a null-terminated mbcs string.
data: Name-value pairs to update in the client section of the DSD file.