Autodesk.AutoCAD.Windows.PaneCollection
Represents a collection of panes.

Autodesk.AutoCAD.Windows.PaneCollection.Item(System.Int32)


Autodesk.AutoCAD.Windows.PaneCollection.GetEnumerator


Autodesk.AutoCAD.Windows.PaneCollection.RemoveAt(System.Int32)


Autodesk.AutoCAD.Windows.PaneCollection.Clear


Autodesk.AutoCAD.Windows.PaneCollection.CopyTo(Autodesk.AutoCAD.Windows.Pane[],System.Int32)


Autodesk.AutoCAD.Windows.PaneCollection.Insert(System.Int32,Autodesk.AutoCAD.Windows.Pane)


Autodesk.AutoCAD.Windows.PaneCollection.Remove(Autodesk.AutoCAD.Windows.Pane)


Autodesk.AutoCAD.Windows.PaneCollection.Contains(Autodesk.AutoCAD.Windows.Pane)


Autodesk.AutoCAD.Windows.PaneCollection.IndexOf(Autodesk.AutoCAD.Windows.Pane)


Autodesk.AutoCAD.Windows.PaneCollection.Add(Autodesk.AutoCAD.Windows.Pane)
