Autodesk.AutoCAD.Publishing.DwfNode
Contains information associated with a node in a DWF structure.

Autodesk.AutoCAD.Publishing.DwfNode.#ctor(System.Int32,System.String)
Constructs a node from a name and number.
nodeId: Integer node number.
nodeName: Unicode string defining the node name.

Autodesk.AutoCAD.Publishing.DwfNode.#ctor
Default constructor.Creates an empty node with number 0.

Autodesk.AutoCAD.Publishing.DwfNode.NodeName
Gets or sets Unicode node name string.

Autodesk.AutoCAD.Publishing.DwfNode.NodeId
Gets or sets the integer node number.