Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags
Enumerates types of tool catalogs.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags.ShapeCatalog
Shape catalog.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags.StockToolCatalog
Stock tool catalog.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags.Catalog
Tool catalog.