Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs
Provides data for the SelectionAdded event of the Editor class.

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.AddedObjects
Gets a SelectionSet object represent the object that were added to the selection set programmatically.

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.Selection
Gets a SelectionSet object representing the objects currently selected.

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.Add(Autodesk.AutoCAD.EditorInput.SelectedObject)
Adds entity to the final SelectionSet array.
value: The entity to be added.

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.AddSubEntity(Autodesk.AutoCAD.EditorInput.SelectedSubObject)
Adds a subentity to the selection set.
value: The subentity to be added to the selection set.

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.Remove(System.Int32)
Removes entities from the final selection set array.
index: Index of entry to remove.

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.RemoveSubEntity(System.Int32,System.Int32)
Removes a subentity from a selection set.
entityIndex: The index of the selection set entry containing the subentity to remove.
subEntityIndex: The index of the subentity in the subentity selection set array.

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.Highlight(System.Int32,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Highlights an entry partially.
subSelectionIndex: Zero-based index into the subselection set array indicating the entry to highlight.
path: Subentity containing the entry to highlight.