Autodesk.AutoCAD.PlottingServices.MergeStatus
This enumeration describes the differences between validated plot settings and plot settings on the layout object after PlotInfoValidator.Validate() has successfully executed.

Autodesk.AutoCAD.PlottingServices.MergeStatus.Scale
The plot scales are different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotType
The plot type is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.ShadePlotResLevel
The shade plot resolution level is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotRotation
The plot rotation is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.DrawViewportsFirst
The draw viewports first setting is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PrintLineWeights
The print line weights setting is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.ScaleLineWeights
The scale line weights setting is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.CurrentStyleSheet
The current style sheet is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotViewName
The plot area is View, but the view name is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotWindowArea
The plot area is Window, but the window is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.ShadePlotCustomDpi
The shade plot DPI setting is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.ShadePlot
The shade plot setting is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotHidden
The plot hidden setting is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotCentered
The center the plot setting is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.ShowPlotStyles
The show plot styles setting is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotPlotStyles
The plot with plot styles setting is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotViewportBorders
The plot viewport borders setting is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotPaperUnits
The plot paper units are different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotOrigin
The plot origin is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.CanonicalMediaName
The canonical media name is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotPaperSize
The paper size is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotPaperMargins
The margins are different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.PlotConfigurationName
The plot configuration name is different.

Autodesk.AutoCAD.PlottingServices.MergeStatus.NoChanges
There are no differences between the layout and the validated plot settings.