Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager
The tool manager, contains and manages stock tool and workspace catalogs. Stock tools are stored in stock tool files (as either one stock tool per file or multiple stock tools in a catalog file). Stock tool files are stored in the stock tool catalog directory.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.Schemes
Gets schemes currently in the manager.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.ShapeCatalog
Gets or sets the singleton shape catalog, which contains the shape packages.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.ShapeCatalogFile
Gets or sets the shape catalog file name and path.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.StockToolCatalogPath
Gets or sets the absolute path of the location where the product's stock tool catalog files are stored. This can contain multiple paths separated by a semicolon.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.CatalogPath
Gets or sets the absolute paths where the product's workspace catalog files are stored. This can contain multiple paths separated by semicolons.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.Catalogs
Gets or sets workspace catalogs.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.StockToolCatalogs
Gets or sets stock tool catalogs.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.Manager
Gets the singleton Manager object.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.GetShapePackage(System.String)
Returns the shape package stored in the shape catalog whose name matches value.
value: Name of package.
Returns: The shape package stored in the shape catalog whose name matches value.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.LoadCatalogs
Loads the workspace catalogs and stock tool catalogs. The currently loaded catalogs are discarded.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.LoadCatalogs(Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags,Autodesk.AutoCAD.Windows.ToolPalette.LoadFlags)
Loads the workspace catalogs and stock tool catalogs. The currently loaded catalogs are discarded.
flags: Catalog type to load.
options: Load option.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.UnloadCatalogs
Unloads the workspace catalogs and stock tool catalogs.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.UnloadCatalogs(Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags)
Unloads the workspace catalogs and stock tool catalogs.
flags: Catalog type to unload.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.SaveCatalogs
Saves the workspace catalogs and stock tool catalogs.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.SaveCatalogs(Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags,Autodesk.AutoCAD.Windows.ToolPalette.SaveFlags)
Saves the workspace catalogs and stock tool catalogs.
flags: Catalog type to save.
flags: Save option.

Autodesk.AutoCAD.Windows.ToolPalette.ToolPaletteManager.{dtor}
