Autodesk.AutoCAD.Windows.ToolPalette.DrawImageOption
This enum defines possible styles that can be used to render an image in a tool palette.

Autodesk.AutoCAD.Windows.ToolPalette.DrawImageOption.Normal
Rendered as is.

Autodesk.AutoCAD.Windows.ToolPalette.DrawImageOption.Shadow
A drop shadow for the image is drawn.

Autodesk.AutoCAD.Windows.ToolPalette.DrawImageOption.Halo
A halo is drawn around the image.

Autodesk.AutoCAD.Windows.ToolPalette.DrawImageOption.Selected
Image is drawn, blending 50 percent with the system highlight color, which is useful for showing the image in the selection state.