Autodesk.AutoCAD.Windows.DefaultPane
This enumeration contains the default panes for the application status bar.

Autodesk.AutoCAD.Windows.DefaultPane.ViewportMaximize
Maximize or minimize current viewport.

Autodesk.AutoCAD.Windows.DefaultPane.ViewportMaximizePrevious
Maximize previous viewport.

Autodesk.AutoCAD.Windows.DefaultPane.Spacer
Empty,unselectable spacer.

Autodesk.AutoCAD.Windows.DefaultPane.Table
Tablet pane.

Autodesk.AutoCAD.Windows.DefaultPane.Float
Float pane.

Autodesk.AutoCAD.Windows.DefaultPane.ObjectSnap
Osnap pane.

Autodesk.AutoCAD.Windows.DefaultPane.Model
For internal use.

Autodesk.AutoCAD.Windows.DefaultPane.Paper
For internal use.

Autodesk.AutoCAD.Windows.DefaultPane.PaperModel
Paper/Model pane.

Autodesk.AutoCAD.Windows.DefaultPane.LineWeight
Lineweight pane.

Autodesk.AutoCAD.Windows.DefaultPane.ObjectTrack
Otrack pane.

Autodesk.AutoCAD.Windows.DefaultPane.Polar
Polar pane.

Autodesk.AutoCAD.Windows.DefaultPane.Ortho
Ortho pane.

Autodesk.AutoCAD.Windows.DefaultPane.Grid
Grid pane.

Autodesk.AutoCAD.Windows.DefaultPane.Snap
Snap pane.

Autodesk.AutoCAD.Windows.DefaultPane.CursorCoordinates
Cursor coordinates pane.

Autodesk.AutoCAD.Windows.DefaultPane.ModeMacro
Modemacro pane.

Autodesk.AutoCAD.Windows.DefaultPane.LayoutMoreIcon
Multiple layouts icon.

Autodesk.AutoCAD.Windows.DefaultPane.LayoutIcon
Layout space icon.

Autodesk.AutoCAD.Windows.DefaultPane.ModelIcon
Model space icon.

Autodesk.AutoCAD.Windows.DefaultPane.LayoutModelIcons
Model space and Layout space icons.

Autodesk.AutoCAD.Windows.DefaultPane.DynamicUcs
Dynamic UCS pane.

Autodesk.AutoCAD.Windows.DefaultPane.DynamicInput
Dynamic input status bar button.

Autodesk.AutoCAD.Windows.DefaultPane.ViewportMaximizeNext
Maximize next viewport.

Autodesk.AutoCAD.Windows.DefaultPane.All
All default panes of the application status bar(not including the message or the progress meter panes).