Autodesk.AutoCAD.PlottingServices.PlotMessageIndex
This enumeration defines the UI aspects of the plot progress dialog.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.DialogTitle
Title of the plot progress dialog.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.MessageCount
Total count of the enum entries.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.CancelJobButtonMessage
Plot job cancel button message string.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.CancelSheetButtonMessage
Sheet cancel button message string.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.MessageCancelingCurrent
Sheet plot cancel message.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.MessageCanceling
Plot job cancel message.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.SheetSetProgressCaption
Caption of the sheet set progress bar.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.SheetProgressCaption
Caption of the sheet progress bar.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.SheetNameToolTip
The tooltip that should appear on mouse over for the sheet name string display.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.SheetName
Name of the sheet being plotted.

Autodesk.AutoCAD.PlottingServices.PlotMessageIndex.Status
Plot status of the sheet being plotted.