Autodesk.AutoCAD.Windows.ToolPalette.Tool
Encapsulates the tool item in the tool catalog.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.ToolData
Gets the XML node that contains the tool's custom data.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.CurrentShapeGuid
Gets or sets the current shape selected in the shape palette.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.CurrentShape
Gets or sets the current shape selected in the shape palette.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.ShapePackage
Gets or sets the shape package associated with the flyout tool.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.IsFlyoutEnabled
Gets true if the flyout tool is enabled.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.ToolType
Gets or sets the tool type.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.StockToolFileUrl
Gets or sets the stock tool file URL for downloading the stock tool file.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.StockToolId
Gets or sets the ID of the stock tool associated to the tool.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.StockTool
Gets or sets the StockTool pointer associated with the tool.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.Execute(System.Int32,System.Windows.Forms.IWin32Window,System.Drawing.Point,System.Int32)
Executes the tool, by creating the COM object that implements the IAcadTool interface and calling IAcadTool.Execute.
flag: Execution context flag.
window: Window handle in which the tool was dropped, if the tool was executed by dragging and dropping into the drawing window.
point: Point at which the tool was dropped, if the tool was executed by dragging and dropping into the drawing window; the point is in the client coordinates of the window specified in window.
keyState: state of the modifier keys if the tool was executed by dragging and dropping into the drawing window.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.CreateAcadTool(System.Boolean)
Creates the COM object that implements IAcadTool.
loadData: value that, if true, loads the tool's custom data.
Returns: The newly created IAcadTool object.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.EnableFlyout(System.Boolean)
Enables or disables a flyout tool.
useFlyout: Boolean indicates whether to use a flyout.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.GetActiveShapes
Gets the shape tools that are currently visible in the shape palette.
Returns: The shape tools that are currently visible in the shape palette.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.SetActiveShapes(Autodesk.AutoCAD.Windows.ToolPalette.Tool[])
Sets the shapes that are visible in the shape palette.
activeShapes: Array containing the tools that should be visible in the shape palette.

Autodesk.AutoCAD.Windows.ToolPalette.Tool.{dtor}
