Autodesk.AutoCAD.PlottingServices.Dwf3dOptions
3D DWF options for publishing.

Autodesk.AutoCAD.PlottingServices.Dwf3dOptions.PublishWithMaterials


Autodesk.AutoCAD.PlottingServices.Dwf3dOptions.GroupByXrefHierarchy
