Autodesk.AutoCAD.Windows.ToolPalette.RefreshFlags
Specifies options for refreshing tool catalog items.

Autodesk.AutoCAD.Windows.ToolPalette.RefreshFlags.RefreshShowProgress
Displays a progress dialog while refreshing, with a button to cancel the Refresh.

Autodesk.AutoCAD.Windows.ToolPalette.RefreshFlags.RefreshAll
Refreshes the item, linked item, image, stock tool, and children; combines the first five options.

Autodesk.AutoCAD.Windows.ToolPalette.RefreshFlags.RefreshChildren
Recursively applies the refresh option to the children.

Autodesk.AutoCAD.Windows.ToolPalette.RefreshFlags.RefreshStockTool
Refreshes the stock tool referenced by the tool for tool items.

Autodesk.AutoCAD.Windows.ToolPalette.RefreshFlags.RefreshImage
Refreshes item's image.

Autodesk.AutoCAD.Windows.ToolPalette.RefreshFlags.RefreshLinkedItem
Refreshes the linked item.

Autodesk.AutoCAD.Windows.ToolPalette.RefreshFlags.RefreshItem
Refreshes the item.