Autodesk.AutoCAD.EditorInput.PromptStringResultEventArgs
Provides data for the PromptedForString event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptStringResultEventArgs.Result
Provides data for the PromptedForString event of the Editor class.