Autodesk.AutoCAD.ApplicationServices.TabbedDialogEventArgs
Contains parameters and operations related to tabbed dialog related events.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogEventArgs.AddTab(System.String,Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension)
Add user defined page to the tabbed dialog firing this event.
name: Name of the newly created tab.
extension: A TabeddedDialogExtension that is responsible for the client area of the new tab.