Autodesk.AutoCAD.EditorInput.ObjectSnapMasks


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Node


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Middle


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.NoneOverride


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.RelativePolar


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.RelativeCartesian


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.DisablePerpendicular


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.AllowTangent


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.ApparentIntersection


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Quick


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Near


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Tangent


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Perpendicular


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Insertion


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Intersection


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Quadrant


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.End


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Immediate


Autodesk.AutoCAD.EditorInput.ObjectSnapMasks.Center
