Autodesk.AutoCAD.Windows.ContextMenuExtension
]
This type allows users to extend various context (shortcut) menus in AutoCAD.

Autodesk.AutoCAD.Windows.ContextMenuExtension.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ContextMenuExtension.Title
Gets or sets the title of the submenu that this ContextMenuExtension creates.

Autodesk.AutoCAD.Windows.ContextMenuExtension.Finalize


Autodesk.AutoCAD.Windows.ContextMenuExtension.{dtor}
