Autodesk.AutoCAD.ApplicationServices.DocumentCollection
Is the container for all the document objects (there is one document object for each drawing that is open and being edited).

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.IsApplicationContext
Gets if it is executing in the application context.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentActivationEnabled
Gets or sets whether document activation is enabled.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.MdiActiveDocument
Gets or sets the MDI active document.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.Count
Gets the number of documents currently open.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.GetEnumerator
Returns an enumerator object for this collection.
Returns: An enumerator object for this collection.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.Open(System.String,System.Boolean,System.String)
Opens the specified drawing.
fileName: The name of the drawing file to open.
forReadOnly: Bool determines whether the drawing file is opened as readonly.
password: The password of the drawing file.
Returns: A Document object representing the open drawing.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.Open(System.String,System.Boolean)
Opens the specified drawing.
fileName: The name of the drawing file to open.
forReadOnly: Bool determines whether the drawing file is opened as readonly.
Returns: A Document object representing the open drawing.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.Open(System.String)
Opens the specified drawing.
fileName: The name of the drawing file to open.
Returns: A Document object representing the open drawing.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.Add(System.String)
Opens the specified drawing.
fileName: The name of the drawing file to open.
Returns: A Document object representing the open drawing.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.CloseAll
Closes all the documents.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.CopyTo(Autodesk.AutoCAD.ApplicationServices.Document[],System.Int32)
Copies the DocumentCollection to a one-dimensional array.
array: The one-dimensional array that is the destination of the elements copied from DocumentCollection. The array must have zero-based indexing.
index: The zero-based index in array at which copying begins.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.ExecuteInApplicationContext(Autodesk.AutoCAD.ApplicationServices.ExecuteInApplicationContextCallback,System.Object)
Allows a void method to be called from the application context.
callback: Method pointer.
data: Any data that should be used for the function call.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.GetDocument(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the document that the input database belongs to.
db: A Database object.
Returns: The document that the input database belongs to.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentLockModeChanged
Fired every time a lock is established or removed on a document.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentLockModeChangeVetoed
Fired when requests to established locks on a document can be vetoed by events receiving the DocumentLockModeChanged callback.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentLockModeWillChange
Fired before all lock changes are made on documents. It cannot be vetoed.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentActivated
This event is sent once a document has been activated and its context has been successfully switched.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentActivationChanged
This event is sent for changes caused by DocumentToBeDeactivated or DocumentActivated events.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentToBeDeactivated
This event is sent when a document is about to be deactivated.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentToBeActivated
This event is sent when a document is about to be activated.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentBecameCurrent
This event is sent whenever the current document changes. It should not be confused with a document getting focus, or becoming active. It is possible for the same document to go in and out of focus, or become active and inactive. This event is only sent when a document becomes active, and is different than the last active document.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentCreationCanceled
This event is sent when a user action has cancelled a document's creation. This event is only sent in MDI mode and after a DocumentCreateStarted event.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentDestroyed
This event is sent when a document is completely destroyed and the underlying database corresponding to this document has also been deleted.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentToBeDestroyed
This event is sent at the beginning of document destruction.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentCreated
This event is sent when a new Document has been constructed.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentCreateStarted
This event is sent when a document is first instantiated and no database is yet available.