Autodesk.AutoCAD.EditorInput.PromptSelectionResult
Represents the result of a prompt for a selection of objects.

Autodesk.AutoCAD.EditorInput.PromptSelectionResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptSelectionResult.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.