Autodesk.AutoCAD.ApplicationServices.CommandEventArgs
Provides data for various events of the Document.

Autodesk.AutoCAD.ApplicationServices.CommandEventArgs.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.ApplicationServices.CommandEventArgs.GlobalCommandName
Gets the name of the command that raised this event.