Autodesk.AutoCAD.GraphicsSystem.ViewEventArgs
This is a container for the GraphicsSystem.View object.

Autodesk.AutoCAD.GraphicsSystem.ViewEventArgs.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.GraphicsSystem.ViewEventArgs.View
Gets the GraphicsSystem.View object contained in this class.