Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs
Provides data for the BeginAggregation event.

Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs.DwfPassword
Gets the password, if any, needed to open the DWF file.

Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs.DwfFileName
Gets the full path to the final DWF file.

Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs.PlotLogger
Gets access to the plot logger object.Clients do not need to create or destroy this object.

Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs.AddGlobalPropertyRange(Autodesk.AutoCAD.Publishing.EPlotProperty[])
Allows clients to add a list of global properties to the DWF file's EPlot global section.
properties: EPlotProperty objects.

Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs.AddGlobalResourceRange(Autodesk.AutoCAD.Publishing.EPlotResource[])
Allows clients to add a list of global resources (files) to the DWF file.
properties: EPlotResource objects, which include a mime type, a role, and a full path to the resource to be added.