Autodesk.AutoCAD.Windows.ToolPalette.ToolType
Enumerates possible tool types.

Autodesk.AutoCAD.Windows.ToolPalette.ToolType.Normal
Normal tool.

Autodesk.AutoCAD.Windows.ToolPalette.ToolType.Flyout
Flyout tool.