Autodesk.AutoCAD.Runtime.CommandMethodAttribute
Marks an instance or static function as a command. Command methods may be defined only in a class that is marked with the CommandClass attribute.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String)
Constructor.
globalName: Input command global name.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,Autodesk.AutoCAD.Runtime.CommandFlags)
Constructor.
globalName: Input command global name.
flags: Input command flags.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,System.String,Autodesk.AutoCAD.Runtime.CommandFlags)
Constructor.
groupName: Input command group name.
globalName: Input command global name.
flags: Input command flags.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,System.String,System.String,Autodesk.AutoCAD.Runtime.CommandFlags)
Constructor.
groupName: Input command group name.
globalName: Input command global name.
localizedNameId: Input command locaized name Id.
flags: Input command flags.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,System.String,System.String,Autodesk.AutoCAD.Runtime.CommandFlags,System.Type)
Constructor.
groupName: Input command group name.
globalName: Input command global name.
localizedNameId: Input command locaized name Id.
flags: Input command flags.
contextMenuExtensionType: Input context menu flags.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,System.String,System.String,Autodesk.AutoCAD.Runtime.CommandFlags,System.String)
Constructor.
groupName: Input command group name.
globalName: Input command global name.
localizedNameId: Input command locaized name Id.
flags: Input command flags.
helpTopic: Input help topic string.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,System.String,System.String,Autodesk.AutoCAD.Runtime.CommandFlags,System.Type,System.String,System.String)
Constructor.
groupName: Input command group name.
globalName: Input command global name.
localizedNameId: Input command locaized name Id.
flags: Input command flags.
contextMenuExtensionType: Input context menu flags.
helpFileName: Input help file name.
helpTopic: Input help topic string.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.HelpTopic
Gets help file name.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.HelpFileName
Gets help topic string.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.ContextMenuExtensionType
Gets context menu flags.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.Flags
Gets command flags.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.GroupName
Gets command group name.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.LocalizedNameId
Gets command locaized name Id.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.GlobalName
Gets command group name.