Autodesk.AutoCAD.EditorInput.SelectionDetails
Represents additional details about the selection.

Autodesk.AutoCAD.EditorInput.SelectionDetails.GetContainers
Gets an array of containers in which this entity is nested.
Returns: An array of object IDs representing the containers of this nested entity.

Autodesk.AutoCAD.EditorInput.SelectionDetails.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.SelectionDetails.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.