Autodesk.AutoCAD.Publishing.PublishEventArgs
Provides data for the Publish event.

Autodesk.AutoCAD.Publishing.PublishEventArgs.IsMultiSheetDwf
Gets the password, if any, needed to open the DWF file.

Autodesk.AutoCAD.Publishing.PublishEventArgs.DwfPassword
Gets true if this job is being published to a multisheet DWF.

Autodesk.AutoCAD.Publishing.PublishEventArgs.TemporaryDwfFileName
Gets the full path to the temporary DWF file for this page.

Autodesk.AutoCAD.Publishing.PublishEventArgs.DwfFileName
Gets the full path to the final DWF file.