Autodesk.AutoCAD.PlottingServices.PlotProgress
Defines the behaviors that a plot progress dialog must implement.

Autodesk.AutoCAD.PlottingServices.PlotProgress.StatusMsgString
Gets or sets the status string of the sheet currently being plotted.

Autodesk.AutoCAD.PlottingServices.PlotProgress.IsVisible
Gets or sets true if the plot progress dialog is visible.

Autodesk.AutoCAD.PlottingServices.PlotProgress.SheetProgressPos
Gets or sets the current sheet progress position,which typically falls within the sheet progress range.

Autodesk.AutoCAD.PlottingServices.PlotProgress.UpperSheetProgressRange
Gets or sets the upper limits of the plot progress range in a multi-sheet scenario.

Autodesk.AutoCAD.PlottingServices.PlotProgress.LowerSheetProgressRange
Gets or sets the lower limits of the plot progress range in a multi-sheet scenario.

Autodesk.AutoCAD.PlottingServices.PlotProgress.SheetCancelStatus
Gets or sets SheetCancelStatus enum value indicating the cancel status of the current sheet plot operation.

Autodesk.AutoCAD.PlottingServices.PlotProgress.IsSheetCancelled
Gets a Boolean indicating whether the current sheet plot process was canceled.

Autodesk.AutoCAD.PlottingServices.PlotProgress.PlotProgressPos
Gets or sets the current plot progress position.

Autodesk.AutoCAD.PlottingServices.PlotProgress.UpperPlotProgressRange
Gets or sets the upper limits of the plot progress range in a multi-sheet scenario.

Autodesk.AutoCAD.PlottingServices.PlotProgress.LowerPlotProgressRange
Gets or sets the lower limits of the plot progress range in a multi-sheet scenario.

Autodesk.AutoCAD.PlottingServices.PlotProgress.PlotCancelStatus
Gets or sets PlotCancelStatus enum value indicating the cancel status of the current plot job operation.

Autodesk.AutoCAD.PlottingServices.PlotProgress.IsPlotCancelled
Gets a Boolean indicating whether the entire plot job process was canceled.

Autodesk.AutoCAD.PlottingServices.PlotProgress.DeleteUnmanagedObject


Autodesk.AutoCAD.PlottingServices.PlotProgress.{dtor}
