Autodesk.AutoCAD.Publishing.EPlotResource
Describes a resource to be added to the DWF page or global section. The resource is an existing file that will be added to the ZIP file and listed in the page descriptor as a page resource or added to the EPlot global section as a global resource.

Autodesk.AutoCAD.Publishing.EPlotResource.#ctor(System.String,System.String,System.String)
Creates an EPlotResource object from three Unicode strings.
role: Unicode string to assign to the role attribute; this string describes the resource; for example, thumbnail, font, and so on.
mime: Unicode string to assign to the mime type attribute.
path: Unicode string containing the full path to the resource file.

Autodesk.AutoCAD.Publishing.EPlotResource.#ctor
Default constructor.Creates an empty object.

Autodesk.AutoCAD.Publishing.EPlotResource.Path
Gets or sets the path to the resource file.

Autodesk.AutoCAD.Publishing.EPlotResource.Mime
Gets or sets Unicode mime type string.

Autodesk.AutoCAD.Publishing.EPlotResource.Role
Gets or sets Unicode role string.