Autodesk.AutoCAD.PlottingServices.PlotLogger
This class is used by the application to journal the normal progress of a plot job.

Autodesk.AutoCAD.PlottingServices.PlotLogger.WarningHasHappenedInJob
Gets a boolean indicates that a warning occurred between the call to StartJob() and the call to EndJob().

Autodesk.AutoCAD.PlottingServices.PlotLogger.ErrorHasHappenedInJob
Gets a boolean indicates that an error occurred between the call to StartJob() and the call to EndJob().

Autodesk.AutoCAD.PlottingServices.PlotLogger.WarningHasHappenedInSheet
Gets a boolean indicates that a warning occurred between the call to StartSheet() and the call to EndSheet().

Autodesk.AutoCAD.PlottingServices.PlotLogger.ErrorHasHappenedInSheet
Gets a boolean indicates that an error occurred between the call to StartSheet() and the call to EndSheet().

Autodesk.AutoCAD.PlottingServices.PlotLogger.StartJob
Indicates to the PlotLogger that the plot job has started.It is the responsibility of the plot application to call this method.

Autodesk.AutoCAD.PlottingServices.PlotLogger.EndJob
Indicates to the PlotLogger that the entire job has been completed.It is the responsibility of the plot application to call this method.

Autodesk.AutoCAD.PlottingServices.PlotLogger.StartSheet
Indicates to the PlotLogger that an individual sheet within a job has started.It is the responsibility of the plot application to call this method.

Autodesk.AutoCAD.PlottingServices.PlotLogger.EndSheet
Indicates to the PlotLogger that an individual sheet within a job has been completed.It is the responsibility of the plot application to call this method.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogTerminalError(System.String)
While a terminal error is assumed to end the plot job, EndSheet() and EndJob() should still be called, as appropriate.
message: A formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogAbortRetryIgnoreError(System.String)
While an abort error is assumed to end the plot job, EndSheet() and EndJob() should still be called, as appropriate.
message: A formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogSevereError(System.String)
While a severe error is assumed to end the plot job, EndSheet() and EndJob() should still be called, as appropriate.
message: A formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogError(System.String)
This method may be called directly by the application or by some part of the plot engine through error handlers.
message: A formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogWarning(System.String)
This method may be called directly by the application or by some part of the plot engine through error handlers.
message: A formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogMessage(System.String)
This method may be called directly by the application or by some part of the plot engine through error handlers.
message: A formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogInformation(System.String)
This method typically is called directly by the application.
message: A formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.{dtor}
