Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions
Represents optional parameters for a prompt for a nested entity.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions.#ctor(System.String,System.String)


Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions.DoIt
