Autodesk.AutoCAD.PlottingServices.PlotFactory
Creates plot engines for use by applications. Only one engine can exist at a time, so applications should create engines just before they are needed and destroy them (by calling PlotEngine.Destroy()) when they are no longer needed.

Autodesk.AutoCAD.PlottingServices.PlotFactory.ProcessPlotState
Gets the current state of the plotting subsystem. Indicates whether plotting is currently underway in either the current process or a background process.

Autodesk.AutoCAD.PlottingServices.PlotFactory.CreatePublishEngine
Creates an engine for plotting to a device(or to a file).The plotting pipeline is locked until the engine has been destroyed.
Returns: A new plot engine.

Autodesk.AutoCAD.PlottingServices.PlotFactory.CreatePreviewEngine(System.Int32)
Creates an engine for plotting to a preview window. The plotting pipeline is locked until the engine has been destroyed.
previewFlags: Flags that define the behavior of the preview state when AutoCAD previews the layout.
Returns: A new preview engine.