Autodesk.AutoCAD.EditorInput.PromptForEntityEndingEventArgs
Provides data for the PromptForEntityEnding event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptForEntityEndingEventArgs.Result
Gets the result of the prompt operation.

Autodesk.AutoCAD.EditorInput.PromptForEntityEndingEventArgs.RemoveSelectedObject


Autodesk.AutoCAD.EditorInput.PromptForEntityEndingEventArgs.ReplaceSelectedObject(Autodesk.AutoCAD.EditorInput.SelectedObject)
