Autodesk.AutoCAD.Windows.ToolPalette.DownloadFlags
Options for downloading catalog items.

Autodesk.AutoCAD.Windows.ToolPalette.DownloadFlags.Image
Downloads the item's image.

Autodesk.AutoCAD.Windows.ToolPalette.DownloadFlags.ShowProgress
Displays a progress dialog while downloading, with a button to cancel the download.

Autodesk.AutoCAD.Windows.ToolPalette.DownloadFlags.All
Downloads the item, linked item, image, stock tool, and children; combines the first five options.

Autodesk.AutoCAD.Windows.ToolPalette.DownloadFlags.Children
Recursively downloads the items' children; applies the download option to the children.

Autodesk.AutoCAD.Windows.ToolPalette.DownloadFlags.StockTool
Downloads the stock tool referenced by the tool for tool items.

Autodesk.AutoCAD.Windows.ToolPalette.DownloadFlags.LinkedItem
]
Downloads the linked file into this item if this is a linked item.

Autodesk.AutoCAD.Windows.ToolPalette.DownloadFlags.Item
Downloads the item.