Autodesk.AutoCAD.PlottingServices.MatchingPolicy
This enumeration defines the supported media-matching policies on the PlotInfoValidator class.

Autodesk.AutoCAD.PlottingServices.MatchingPolicy.MatchEnabledTemporaryCustom
Media matching is enabled. If no matching media is found, a custom size is created and saved in a temporary PC3/PMP file, which is deleted when the validated PlotInfo object is destroyed.

Autodesk.AutoCAD.PlottingServices.MatchingPolicy.MatchEnabledCustom
Media matching is enabled. If no matching media is found, a custom size is created and saved to disk.

Autodesk.AutoCAD.PlottingServices.MatchingPolicy.MatchEnabled
Media matching is enabled.

Autodesk.AutoCAD.PlottingServices.MatchingPolicy.MatchDisabled
Media matching is disabled.