Autodesk.AutoCAD.Publishing.EPlotAttribute.#ctor(System.String,System.String,System.String,System.String)


Autodesk.AutoCAD.Publishing.EPlotAttribute.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Publishing.EPlotAttribute.Value


Autodesk.AutoCAD.Publishing.EPlotAttribute.Name


Autodesk.AutoCAD.Publishing.EPlotAttribute.NsUrl


Autodesk.AutoCAD.Publishing.EPlotAttribute.Ns
