Autodesk.AutoCAD.PlottingServices.EndPageEventArgs
Encapsulates the plot-specific information required by the EndPage event. This information includes a SheetCancelStatus flag.

Autodesk.AutoCAD.PlottingServices.EndPageEventArgs.#ctor(Autodesk.AutoCAD.PlottingServices.SheetCancelStatus)


Autodesk.AutoCAD.PlottingServices.EndPageEventArgs.Status
