Autodesk.AutoCAD.ApplicationServices.SystemVariableChangedEventArgs.Changed
Gets boolean to indicate if the system variable has been changed successfully.

Autodesk.AutoCAD.ApplicationServices.SystemVariableChangedEventArgs.Name
Gets system variable name being change.