Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDragSource
A stock tool implements this interface to receive notification when the tools belonging to the stock tool are dragged and dropped.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDragSource.BeginDrag(System.Object@,System.Object@,System.Guid@,System.Windows.Forms.IDataObject,System.UInt32)
The framework calls this method when single or multiple tools belonging to a stock tool are about to be dragged.
toolIds: IDs of the tools being dragged.
allStockToolIds: IDs of all the stock tools to which the tools being dragged belong.
currentStockToolId: GUID of this stock tool.
data: IDataObject instance in which the tool can set its data.
keyState: Value indicates the state of the modifier keys.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDragSource.DragInProgress(System.UInt32)
Called frequently when a drag-and-drop operation is in progress. This method is called only if the BeginDrag() method.
dropEffect: Value returned by the most recent call to the drop target.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDragSource.EndDrag(System.UInt32)
Called after a tool's drag-and-drop operation is finished.
dropEffect: Contains the current DROPEFFECT value.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDragSource.DragEnterDrawing(System.Windows.Forms.IDataObject,System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL)
The framework calls this method when the dragged tools enter the drawing window.
data: An IDataObject instance.
keyState: Indicates the state of the modifier keys.
point: Eexpresses the current cursor coordinates in screen coordinates.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDragSource.DragOverDrawing(System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL)
The framework calls this method when tools are dragged over the drawing window.
keyState: Contains the state of the modifier keys.
point: Eexpresses the current cursor coordinates in screen coordinates.
Returns: Value receive the drop effect.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDragSource.DragLeaveDrawing
The framework calls this method when dragged tools leave the drawing window.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDragSource.DropInDrawing(System.Windows.Forms.IDataObject,System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL)
The framework calls this method if the dragged tools are dropped in the drawing window.
data: An IDataObject instance.
keyState: Contains the state of the modifier keys.
pt: Eexpresses the current cursor coordinates in screen coordinates.