Autodesk.AutoCAD.EditorInput.PointFilterResult
Provides output data for the PointFilter event.

Autodesk.AutoCAD.EditorInput.PointFilterResult.ToolTipText
Gets final tool tip string, as determined by AutoCAD.

Autodesk.AutoCAD.EditorInput.PointFilterResult.DisplayObjectSnapGlyph
Gets true, AutoCAD will display the osnap glyph, even in the case the computed point has been changed by the application.

Autodesk.AutoCAD.EditorInput.PointFilterResult.NewPoint
Gets the new point.

Autodesk.AutoCAD.EditorInput.PointFilterResult.Retry
Gets a Boolean indicating whether to force the user to try again.