Autodesk.AutoCAD.PlottingServices.BeginPlotEventArgs
Encapsulates the plot-specific information required by the BeginPlot event. This information includes a PlotProgress object and a PlotType object .

Autodesk.AutoCAD.PlottingServices.BeginPlotEventArgs.#ctor(Autodesk.AutoCAD.PlottingServices.PlotProgress,Autodesk.AutoCAD.PlottingServices.PlotType)


Autodesk.AutoCAD.PlottingServices.BeginPlotEventArgs.PlotType


Autodesk.AutoCAD.PlottingServices.BeginPlotEventArgs.PlotProgress
