Autodesk.AutoCAD.PlottingServices.PlotConfig
Represent a single device or PC3 file installed on the system.PlotConfig exposes utility methods for media size list, description fields, paper size matching, custom paper size creation, and persistence.

Autodesk.AutoCAD.PlottingServices.PlotConfig.PlotToFileCapability
Gets the ability of a PlotConfig object to plot to a file.

Autodesk.AutoCAD.PlottingServices.PlotConfig.DefaultFileExtension
Gets a character string containing the default file extensions for plot files created by this device(for example,".DWF").The leading "." is always included in the returned string.

Autodesk.AutoCAD.PlottingServices.PlotConfig.IsPlotToFile
Gets or setstrue if the device is currently configured to plot to a file.

Autodesk.AutoCAD.PlottingServices.PlotConfig.CanonicalMediaNames
Gets a list of media sizes that are supported for the current device or the PC3 files.

Autodesk.AutoCAD.PlottingServices.PlotConfig.MaximumDeviceDotsPerInch
Gets the maximum number of dots per inch supported by the device; may be zero.

Autodesk.AutoCAD.PlottingServices.PlotConfig.DeviceType
Gets the device type as a DeviceType enum value.

Autodesk.AutoCAD.PlottingServices.PlotConfig.FullPath
Gets the current device or PC3 file name. Always gets the full path name for PC3 files. It gets the entire UNC path name for system printers.

Autodesk.AutoCAD.PlottingServices.PlotConfig.DeviceName
Gets the device name or PC3 file name.Always gets the file name portion for a PC3 file.

Autodesk.AutoCAD.PlottingServices.PlotConfig.TagLine


Autodesk.AutoCAD.PlottingServices.PlotConfig.ServerName


Autodesk.AutoCAD.PlottingServices.PlotConfig.PortName


Autodesk.AutoCAD.PlottingServices.PlotConfig.Comment


Autodesk.AutoCAD.PlottingServices.PlotConfig.LocationName


Autodesk.AutoCAD.PlottingServices.PlotConfig.DriverName


Autodesk.AutoCAD.PlottingServices.PlotConfig.SaveToPC3(System.String)
Saves the current plotter configuration to the specified PC3 file name.
name: Fully qualified path name of the PC3 file to save.

Autodesk.AutoCAD.PlottingServices.PlotConfig.GetMediaBounds(System.String)
Returns the media bounds (page size and printable bounds) corresponding to a canonical media name.
canonicalMediaName: Name of the driver for the device or PC3 file.
Returns: The media bounds (page size and printable bounds).

Autodesk.AutoCAD.PlottingServices.PlotConfig.GetLocalMediaName(System.String)
Returns the localized media name for the canonical media name that is passed in.
canonicalMediaName: Canonical name of the media size whose localized name is being requested.
Returns: Local name of the media.

Autodesk.AutoCAD.PlottingServices.PlotConfig.{dtor}
