Autodesk.AutoCAD.Windows.ToolPalette.Category
Encapsulates the category item in the tool catalog.

Autodesk.AutoCAD.Windows.ToolPalette.Category.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.Category.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Windows.ToolPalette.Category.{dtor}
