Autodesk.AutoCAD.EditorInput.SelectionMethod.SubEntity


Autodesk.AutoCAD.EditorInput.SelectionMethod.Fence


Autodesk.AutoCAD.EditorInput.SelectionMethod.Crossing


Autodesk.AutoCAD.EditorInput.SelectionMethod.Window


Autodesk.AutoCAD.EditorInput.SelectionMethod.PickPoint


Autodesk.AutoCAD.EditorInput.SelectionMethod.NonGraphical


Autodesk.AutoCAD.EditorInput.SelectionMethod.Unavailable
