Autodesk.AutoCAD.Windows.SaveFileDialog.SaveFileDialogFlags
This enumeration represents configuration settings for the SaveFileDialog class.

Autodesk.AutoCAD.Windows.SaveFileDialog.SaveFileDialogFlags.NoShellExtensions
This enumeration represents configuration settings for the SaveFileDialog class.

Autodesk.AutoCAD.Windows.SaveFileDialog.SaveFileDialogFlags.NoFtpSites
Do not enable FTP sites.

Autodesk.AutoCAD.Windows.SaveFileDialog.SaveFileDialogFlags.ForceDefaultFolder
Force the initial directory to be the one specified.

Autodesk.AutoCAD.Windows.SaveFileDialog.SaveFileDialogFlags.NoUrls
Do not allow URLs at all.

Autodesk.AutoCAD.Windows.SaveFileDialog.SaveFileDialogFlags.DoNotTransferRemoteFiles
Do not transfer remote file when user specifies a URL.

Autodesk.AutoCAD.Windows.SaveFileDialog.SaveFileDialogFlags.DoNotWarnIfFileExist
Inhibits display of the alert box, which warns that a file exists when a new file of the same name is opened.

Autodesk.AutoCAD.Windows.SaveFileDialog.SaveFileDialogFlags.DefaultIsFolder
Navigation-only folders; allow selection of a folder only.

Autodesk.AutoCAD.Windows.SaveFileDialog.SaveFileDialogFlags.AllowAnyExtension
Enables the user to enter an arbitrary file name extension.