Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool
This interface provides the primary communication channel between the tool palette framework and tools implemented by tool writers. It is defined by the framework, which uses tools through this interface.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.EditMode
Gets IAcadTool.EditMode enum flag specifying who should handle the tool editing, and if it can be edited.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.GetStockTool
Gets the IAcadStockTool interface of the stock tool to which this tool belongs.
Returns: The IAcadStockTool interface of the stock tool to which this tool belongs.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.SetToolProperties(System.Object)
The framework calls this method immediately after creating the COM object for IAcadTool, passing in an interface to the display properties of the tool. The display properties of the tool are maintained by the framework. The tool can cache this interface and use it to get/set the tool display properties.
toolProperties: The IAcadToolProperties object for the tool.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.Load(System.Object)
Loads the tool data from the XML node in xmlElement.
xmlElement: The XML DOM node.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.Save(System.Object)
Saves the tool's data to the XML node.
xmlElement: The XML DOM node.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.Execute(System.Int32,System.UInt32,System.UInt32,System.UInt32)
Executes the tool. The tool implementation code can do anything in this method: start a command, create an object, set object state, and so on. This method is modal. When the method returns, the framework assumes that execution is finished.
flag: Value provides context information.
window: Windows handle.
point: Point where the tool was dropped.
keyState: Value contains the state of the modifier keys.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.GetData(System.Object@,System.Object@)
If the framework has to handle tool editing by using the property inspector control in a modal dialog, it calls this method to get the COM interfaces the property inspector needs to edit the tool.
properties: Variant array.
dynamicsProperties: Variant of arrays.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.BeginEdit
This method is called by the framework before displaying the dialog to edit the tool properties.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.Edit(System.Object,System.Int32,System.Boolean@)
The framework calls this method if the tool prefers to handle the editing of tool properties.
propertyToEdit: Interface pointer from which IAcadToolProperties can be obtained.
parentWindow: Handle of the application window that can be used as the parent of the editor dialog.
success: Output boolean indicating editing success or failure.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.EndEdit(System.Boolean)
This method is called by the framework after it edits the tool properties in the tool properties editor.
editCancelled: BOOL indicates whether edits should be saved.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.New
The framework calls this method to create a new tool. The tool uses this call to initialize the tool data members.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.GetDropTarget
The framework calls this method to get the IDropTarget interface from the tool. If the tool wishes to support drag-and-drop objects, it must implement this interface and pass it to the framework through this method.
Returns: Interface pointer from which IDropTarget can be obtained.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.GetContextMenu(System.Int32,System.UInt32,System.UInt32,System.UInt32)
This method is called by the framework when the context menu for a tool is about to be displayed in the tool palette or tool editor.
contextFlag: Enum flag specifies the context in which the context menu is invoked.
menu: Handle of the context menu.
idCommandFirst: Minimum value that the tool can specify for a menu item identifier.
idCommandLast: Maximum value that the handler can specify for a menu item identifier.
Returns: Enum flag value.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.GetCommandString(System.UInt32)
The framework calls this method to get the one-line help text to be displayed for a command added to a context menu in GetContextMenu(). This help facility is not used currently, but may be used in the future.
idCommand: ID of the command for which help text is required.
Returns: String containing help text for the command.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.InvokeCommand(System.UInt32,System.UInt32)
The framework calls this method when the user chooses a command that a tool has added to the context menu in GetContextMenu().
idCommand: ID of one of the context menu commands.
window: Window handle to be used in any message box displayed by the tool.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.GetDragDropContextInfo(System.Object,System.String@,System.UInt32@)
This method is called by the framework during a right mouse button drag when a dragged object can be handled by more than one tool. The framework calls this method on all tools that can handle the object after it is dropped.
data: The data object being dragged.
toolName: Output text to display in the drop context menu.
flag: Flag value (currently not used).

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.Dropped(System.String)
This method is called by the framework after this tool is dragged and dropped through custom drag-and-drop or IDrop.
url: String contains the tool's source URL.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.Refreshed(System.String)
This method is called by the framework after a tool is refreshed. This call indicates that the tool's loaded data also is refreshed.
url: URL from which the tool was refreshed.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.SetEditorWindow(System.Int32,System.Object)
This method is called by the framework just before it displays the tool properties editor dialog.It passes the editor window handle and property inspector pointer to the tool. The tool can cache these values for use during the editing process.
editorWindow: Handle of the tool properties editor window.
propertyInspector: The IAcPiPropertyInspector instance in which the tool's properties are edited.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.ValidateEditChanges
This method is called by the framework when a tool is edited in the framework's default tool properties editor and the user presses OK.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.GetToolProperties
Gets the IAcadToolProperties.
Returns: The interface of IAcadToolProperties.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.BeginMultipleEdit(System.Object,System.Object)


Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.EndMultipleEdit(System.Object,System.Object,System.Boolean)


Autodesk.AutoCAD.Windows.ToolPalette.IAcadTool.MultipleEdit(System.Object,System.Object,System.Int32,System.Boolean@)
