Autodesk.AutoCAD.EditorInput.PointMonitorEventArgs
Provides data for the PointMonitor event.

Autodesk.AutoCAD.EditorInput.PointMonitorEventArgs.Context
Gets an InputPointContext object that holds the input data for this event.

Autodesk.AutoCAD.EditorInput.PointMonitorEventArgs.AppendToolTipText(System.String)
Appends final tool tip string.
value: A string object.