Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemCollection
Provides a container for catalog items.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemCollection.Item(System.Int32)


Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemCollection.Count


Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemCollection.GetEnumerator


Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemCollection.CopyTo(Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem[],System.Int32)


Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemCollection.Add(Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem)


Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemCollection.Remove(Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem)


Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemCollection.Remove(System.Guid)


Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemCollection.Find(System.Guid)
