Autodesk.AutoCAD.EditorInput.JigPrompts
Provides a collection of sampling functions for Jig data acquisition.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireString(System.String,System.String)
Prompts the user to enter a string.
messageAndKeywords:
globalKeywords:
Returns: The string entered by the user.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireString(System.String)
Prompts the user to enter a string.
message:
Returns: The string entered by the user.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireString(Autodesk.AutoCAD.EditorInput.JigPromptStringOptions)
Prompts the user to enter a string.
options:
Returns: The string entered by the user.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireString
Prompts the user to enter a string.
Returns: The string entered by the user.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireAngle(System.String,System.String)
Prompts the user to enter an angle.
messageAndKeywords:
globalKeywords:
Returns: The acquired angle value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireAngle(System.String)
Prompts the user to enter an angle.
message:
Returns: The acquired angle value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireAngle(Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions)
Prompts the user to enter an angle.
options:
Returns: The acquired angle value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireAngle
Prompts the user to enter an angle.
Returns: The acquired angle value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireDistance(System.String,System.String)
Prompts the user to enter a distance.
messageAndKeywords:
globalKeywords:
Returns: The acquired distance value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireDistance(System.String)
Prompts the user to enter a distance.
message:
Returns: The acquired distance value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireDistance(Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions)
Prompts the user to enter a distance.
options:
Returns: The acquired distance value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireDistance
Prompts the user to enter a distance.
Returns: The acquired distance value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquirePoint(System.String,System.String)
Prompts the user to enter a point.
messageAndKeywords:
globalKeywords:
Returns: The acquired point value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquirePoint(System.String)
Prompts the user to enter a point.
message:
Returns: The acquired point value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquirePoint(Autodesk.AutoCAD.EditorInput.JigPromptPointOptions)
Prompts the user to enter a point.
options:
Returns: The acquired point value.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquirePoint
Prompts the user to enter a point.
Returns: The acquired point value.