Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject
Encapsulates a subobject that is selected by the pick point selection method.

Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int32,Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
Constructor.
path: Subobject path.Uniquely identifies a subobject within a particular entity in a drawing.
method: Subobject selection methods.
gsMarker: A value that describes what part of the subobject was selected.
descriptor: Describes the shape of a pick point.

Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject.PickPoint
Gets a PickPointDescriptor that provides details about the pick point.

Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.