Autodesk.AutoCAD.EditorInput.PromptEntityOptions
Represents optional parameters for a prompt for an entity.

Autodesk.AutoCAD.EditorInput.PromptEntityOptions.#ctor(System.String,System.String)


Autodesk.AutoCAD.EditorInput.PromptEntityOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.PromptEntityOptions.AllowObjectOnLockedLayer


Autodesk.AutoCAD.EditorInput.PromptEntityOptions.DoIt


Autodesk.AutoCAD.EditorInput.PromptEntityOptions.SetRejectMessage(System.String)


Autodesk.AutoCAD.EditorInput.PromptEntityOptions.AddAllowedClass(System.Type,System.Boolean)


Autodesk.AutoCAD.EditorInput.PromptEntityOptions.RemoveAllowedClass(System.Type)
