Autodesk.AutoCAD.PlottingServices.PlotPageInfo
Returns information about the objects contained on a plotted page. Applications can use this information as a starting point for estimating the time required to plot the page (or, more precisely, to determine whether to warn the user that the page will take a long time to plot). An object of this type is returned by the PlotEngine,StartPage() method.

Autodesk.AutoCAD.PlottingServices.PlotPageInfo.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.PlottingServices.PlotPageInfo.ShadedViewportType
Gets nonzero if shaded or rendered viewports are on the plotted page.

Autodesk.AutoCAD.PlottingServices.PlotPageInfo.GradientCount
Gets an approximation of the number of gradient entities on the plotted page.

Autodesk.AutoCAD.PlottingServices.PlotPageInfo.OleObjectCount
Gets an approximation of the number of OLE objects on the plotted page.

Autodesk.AutoCAD.PlottingServices.PlotPageInfo.RasterCount
Gets an approximation of the number of raster entities on the plotted.

Autodesk.AutoCAD.PlottingServices.PlotPageInfo.EntityCount
Gets an approximation of the number of entities on the plotted page.

Autodesk.AutoCAD.PlottingServices.PlotPageInfo.{dtor}
