Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions


Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions.#ctor(System.String,System.String)


Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions.UseBasePoint


Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions.BasePoint
