Autodesk.AutoCAD.Runtime.LispFunctionAttribute
This class extends the Attribute and ICommandLine interfaces. It defines the attributes for a Lisp callable function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.#ctor(System.String,System.String,System.String)
Constructor.
globalName: Input global name of the Lisp function.
localizedNameId: Input pointer to the localized name of the Lisp function.
helpTopic: Input help topic string for this function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.#ctor(System.String,System.String,System.String,System.String)
Constructor.
globalName: Input global name of the Lisp function.
localizedNameId: Input pointer to the localized name of the Lisp function.
helpFileName: Specify the full path and file name of your Help file.
helpTopic: Input help topic string for this function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.#ctor(System.String,System.String)
Constructor.
globalName: Input global name of the Lisp function.
localizedNameId: Input pointer to the localized name of the Lisp function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.#ctor(System.String)
Constructor.
globalName: Input global name of the Lisp function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.HelpTopic
Gets help topic string for this function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.HelpFileName
Gets the full path and file name of your Help file.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.LocalizedNameId
Gets pointer to the localized name of the Lisp function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.GlobalName
Gets global name of the Lisp function.