Autodesk.AutoCAD.Windows.ToolPalette.IDropTarget


Autodesk.AutoCAD.Windows.ToolPalette.IDropTarget.DragEnter(System.Windows.Forms.IDataObject,System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL,System.UInt32@)


Autodesk.AutoCAD.Windows.ToolPalette.IDropTarget.DragOver(System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL,System.UInt32@)


Autodesk.AutoCAD.Windows.ToolPalette.IDropTarget.DragLeave


Autodesk.AutoCAD.Windows.ToolPalette.IDropTarget.Drop(System.Windows.Forms.IDataObject,System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL,System.UInt32@)
