Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs
Provides data for the SelectionRemoved event of the Editor class.

Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs.RemovedObjects
Gets a SelectionSet object represent the object that were removed from the selection set programmatically.

Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs.Selection
Gets a SelectionSet object representing the objects currently selected.

Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs.Remove(System.Int32)
Removes the object at the specified index from the selection.
index: Index of entry to remove.

Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs.RemoveSubentity(System.Int32,System.Int32)
Removes the subentity at subentityIndex, in the entity at the specified index, from this selection.
index: The index of the selection set entry containing the subentity to remove.
subentityIndex: The index of the subentity in the subentity selection set array.