Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet
Stores and manages a collection of catalogs. The catalogs are loaded from a semicolon-delimited list of paths set in the catalog set.This class cannot be instantiated by external applications.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.CatalogPath
Gets or sets the absolute paths where the product's workspace catalog files are stored. This list can contain multiple paths separated by semicolons.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.Catalogs
Gets the catalogs from the paths set in the catalog set.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.Scheme
Gets the scheme to which this catalog set belongs.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.DeleteUnmanagedObject


Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.LoadCatalogs
Loads the catalogs from the paths set in the catalog set. Before calling this method, the catalog paths should be set using CatalogPath property.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.LoadCatalogs(Autodesk.AutoCAD.Windows.ToolPalette.LoadFlags)
Loads the catalogs from the paths set in the catalog set. Before calling this method, the catalog paths should be set using CatalogPath property.
options: Load option, which can be one or more of the ToolPalette.LoadFlags enum values (multiple values can be combined with bitwise OR).

Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.UnloadCatalogs
Unloads the catalogs in the catalog set.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.SaveCatalogs
Saves the catalogs in the catalog set.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.SaveCatalogs(Autodesk.AutoCAD.Windows.ToolPalette.SaveFlags)
Saves the catalogs in the catalog set.
flags: Save option, which can be one or more of the ToolPalette.SaveFlags enum values (multiple values can be combined with bitwise OR).

Autodesk.AutoCAD.Windows.ToolPalette.CatalogSet.{dtor}
