Autodesk.AutoCAD.Runtime.ICommandLineCallable
This interface defines commands that can be called on a command line.

Autodesk.AutoCAD.Runtime.ICommandLineCallable.ContextMenuExtensionType


Autodesk.AutoCAD.Runtime.ICommandLineCallable.HelpTopic


Autodesk.AutoCAD.Runtime.ICommandLineCallable.HelpFileName


Autodesk.AutoCAD.Runtime.ICommandLineCallable.Flags


Autodesk.AutoCAD.Runtime.ICommandLineCallable.GroupName


Autodesk.AutoCAD.Runtime.ICommandLineCallable.LocalizedNameId


Autodesk.AutoCAD.Runtime.ICommandLineCallable.GlobalName
