Autodesk.AutoCAD.Windows.StatusBarItem
Represents an item in the status bar.The item can be a pane or a tray item.

Autodesk.AutoCAD.Windows.StatusBarItem.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Windows.StatusBarItem.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.StatusBarItem.Visible
Gets or sets true to display the item in the status bar; false to hide it.

Autodesk.AutoCAD.Windows.StatusBarItem.Enabled
Gets or sets true if the pane or tray item is enabled.

Autodesk.AutoCAD.Windows.StatusBarItem.ToolTipText
Gets or sets the pane's or tray item's tooltip text.

Autodesk.AutoCAD.Windows.StatusBarItem.Icon
Gets or sets the icon object for the icon to be displayed in the status bar to represent the pane or tray item.

Autodesk.AutoCAD.Windows.StatusBarItem.PointToClient(System.Drawing.Point)
Converts the screen coordinates of a specified point on the screen to client-area coordinates. The new coordinates are relative to the upper-left corner of the status bar control window client area.
p: A System.Drawing.Point object that contains the screen coordinates to be converted.
Returns: Point with client-area coordinates.

Autodesk.AutoCAD.Windows.StatusBarItem.PointToScreen(System.Drawing.Point)
Converts the specified client-area coordinates to screen coordinates.
p: A System.Drawing.Point object that contains the client coordinates to be converted.
Returns: Point with screen coordinates.

Autodesk.AutoCAD.Windows.StatusBarItem.DeleteUnmanagedObject


Autodesk.AutoCAD.Windows.StatusBarItem.{dtor}


Autodesk.AutoCAD.Windows.StatusBarItem.Deleted
Occurs when a pane or tray item is removed from the status bar.

Autodesk.AutoCAD.Windows.StatusBarItem.MouseDown
Occurs when the user clicks the left or right mouse button on the pane or tray item,or double-clicks the left mouse button on the pane or tray item.