Autodesk.AutoCAD.Windows.ToolPalette.Palette
Encapsulates the palette item in the tool catalog.

Autodesk.AutoCAD.Windows.ToolPalette.Palette.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.Palette.{dtor}
