Autodesk.AutoCAD.Publishing.BeginPublishingSheetEventArgs
Provides data for the BeginPublishingSheet event.

Autodesk.AutoCAD.Publishing.BeginPublishingSheetEventArgs.PlotLogger
Provides data for the BeginPublishingSheet event.

Autodesk.AutoCAD.Publishing.BeginPublishingSheetEventArgs.UniqueId
Gets the unique sheet ID (GUID) string for this sheet.

Autodesk.AutoCAD.Publishing.BeginPublishingSheetEventArgs.DsdEntry
Gets a DSD entry object describing the sheet.