Autodesk.AutoCAD.Runtime.CommandFlags
This members of this enumeration represent values that can be passed as the commandFlags argument.

Autodesk.AutoCAD.Runtime.CommandFlags.NoBlockEditor
The command is blocked during a bedit session.

Autodesk.AutoCAD.Runtime.CommandFlags.NoUndoMarker
The command and its undo markers will not be added to the undo file. This is intended for commands that don't modify the database, and therefore should not show up in the undo file.

Autodesk.AutoCAD.Runtime.CommandFlags.NoHistory
The command will not be added to AutoCAD's repeat-last-command furnctionality.

Autodesk.AutoCAD.Runtime.CommandFlags.Interruptible
The command may be interrupted when prompting for user input while it is calling any of the Getxxx methods.

Autodesk.AutoCAD.Runtime.CommandFlags.Session
The command will be run in the application execution context rather than the current document context, with the different capabilities and limitations that entails. It should be used sparingly.

Autodesk.AutoCAD.Runtime.CommandFlags.DocExclusiveLock
Document will be exclusively locked when command is invoked. If this bit is not set, then the document will be share locked when the command is invoked.

Autodesk.AutoCAD.Runtime.CommandFlags.DocReadLock
Document will be read locked when command is invoked. If this bit is not set, then the document will be write locked when the command is invoked.

Autodesk.AutoCAD.Runtime.CommandFlags.NoInternalLock


Autodesk.AutoCAD.Runtime.CommandFlags.NoNewStack


Autodesk.AutoCAD.Runtime.CommandFlags.Defun
This flag can only be set by the Visual LISP engine. Command can be invoked as a LISP function and can therefore use acedGetArgs() to receive arguments from LISP and can use the methods to return values to LISP.

Autodesk.AutoCAD.Runtime.CommandFlags.InProgress


Autodesk.AutoCAD.Runtime.CommandFlags.Undefined
Command can only be invoked via the cmdGroupName.cmdGlobalName syntax.

Autodesk.AutoCAD.Runtime.CommandFlags.NoOem


Autodesk.AutoCAD.Runtime.CommandFlags.PlotOnly


Autodesk.AutoCAD.Runtime.CommandFlags.NoPaperSpace
Command cannot be invoked when in paperspace.

Autodesk.AutoCAD.Runtime.CommandFlags.NoTileMode
Command cannot be invoked when TILEMODE == 1.

Autodesk.AutoCAD.Runtime.CommandFlags.NoMultiple


Autodesk.AutoCAD.Runtime.CommandFlags.NoPerspective
Command cannot be invoked while the current viewport is in perspective mode.

Autodesk.AutoCAD.Runtime.CommandFlags.Redraw
When the pickfirst set or grip set are retrieved, they are not cleared within AutoCAD.Command can retrieve the pickfirst set and the grip set by using the GetFirst method.Objects in these sets are redrawn with the proper grip handles and highlighting upon completion of the command.

Autodesk.AutoCAD.Runtime.CommandFlags.UsePickSet
When the pickfirst set is retrieved, it is cleared within AutoCAD.Command is able to retrieve the pickfirst set via the method Getfirst().

Autodesk.AutoCAD.Runtime.CommandFlags.Transparent
Command can be invoked while another command is active.

Autodesk.AutoCAD.Runtime.CommandFlags.Modal
Command cannot be invoked while another command is active.