Autodesk.AutoCAD.EditorInput.PromptPointResult
Holds the result of a prompt that returns a point as its primary result.

Autodesk.AutoCAD.EditorInput.PromptPointResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptPointResult.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.