Autodesk.AutoCAD.EditorInput.SelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectedSubObject[])


Autodesk.AutoCAD.EditorInput.SelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int32)


Autodesk.AutoCAD.EditorInput.SelectedObject.GraphicsSystemMarker
Gets a unique integer index for the part of the object that was selected.

Autodesk.AutoCAD.EditorInput.SelectedObject.SelectionMethod
Gets a SelectionMethod value that describes how the object was selected.

Autodesk.AutoCAD.EditorInput.SelectedObject.OptionalDetails
Gets a SelectionDetails object with additional details about the selection.

Autodesk.AutoCAD.EditorInput.SelectedObject.GetSubentities
Returns the subentities of the selected object in a SelectedSubObject array.
Returns: The subentities of the selected object in a SelectedSubObject array.

Autodesk.AutoCAD.EditorInput.SelectedObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.SelectedObject.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.