Autodesk.AutoCAD.PlottingServices.DeviceType
This enumeration defines the device type represented by a PlottingServices.PlotConfig object.

Autodesk.AutoCAD.PlottingServices.DeviceType.Uninitialized
For internal use only.

Autodesk.AutoCAD.PlottingServices.DeviceType.OneOffConfig
For internal use only.

Autodesk.AutoCAD.PlottingServices.DeviceType.PC3File
A device defined and configured using an AutoCAD PC3 file.

Autodesk.AutoCAD.PlottingServices.DeviceType.SystemPrinter
A device defined and configured using the Windows Printers application.