Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyUnspecified
This interface is implemented by a property that can have a "No Default" value specified in the Property Inspector list control.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyUnspecified.IsValueUnspecified(System.Object,System.Boolean@)
Reports whether the value of the property is unspecified.
varId: For static properties, the DISPID of the property; for dynamic properties, the object.
returnVal: Output true if the value is unspecified.
Returns: True if the value is unspecified.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyUnspecified.SetUnspecified(System.Object,System.Boolean)
Sets the value of the property as unspecified or not unspecified.
varId: For static properties, the DISPID of the property; for dynamic properties, the object.
isUnspecified: True sets the value to unspecified.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyUnspecified.IsUnspecifiedAllowed(System.Object,System.Boolean@)
Reports whether the property allows its value to be unspecified.
varId: For static properties, the DISPID of the property; for dynamic properties, the object.
returnVal: Output true if the value is unspecified.
Returns: True if the value is unspecified.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiPropertyUnspecified.GetUnspecifiedString(System.Object)
