Autodesk.AutoCAD.Publishing.PublishEntityEventArgs
Provides data for the PublishEntity event.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.EffectiveBlockLayerId
Gets ObjectId of the effective layer.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.Entity
Gets the current entity.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.UniqueEntityId
Gets a unique entity ID string.The entity ID string consists of the DWG GUID plus the ASCII handles in the xref path plus the object ASCII handle.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.IsCancelled
Gets the current plot status to determine whether the plot is being canceled.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.PlotLogger
Gets the plot logger object.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.Flush
Forces the graphic pipeline to be flushed, to ensure synchronization. When control returns, all geometry has been pushed down to the driver.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.GetCurrentEntityNode(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Determines if this entity has already been assigned a node.
objIds: Array of object IDs for each block that encloses this entity;an empty array if this entity is not part of a block.
Returns: The entity's node, if any.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.GetNextAvailableNode
Returns the next unused integer node number.
Returns: The next unused integer node number.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.GetEntityNode(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Looks up any entity ID in the map of ID-to-node to determine whether the node has already been assigned to a particular entity.
entityId: ObjectId to look up.
objIds: Array of object IDs for each block that encloses this entity; may be an empty array if this entity is not part of a block.
Returns: The node ID for this entity, if one has already been assigned.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.GetNode(System.Int32)
Finds a node given its ID.
nodeId: Integer ID of the node for which to search,which must be greater than 0.
Returns: The node,or null if the node is not found.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.SetCurrentNode(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Determines which node is assigned to the current entity.
nodeId: Node ID to assign.
objIds: Array of object IDs for each block that encloses this entity;an empty array if this entity is not part of a block.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.SetNodeName(System.Int32,System.String)
Allows a client to change the node name but not the node number.
nodeId: Node number on which to operate, which should exist in the map and should be greater than 0.
nodeName: Node name to assign to the specified node.
Returns: true if successful,or false if the node doesn't exist.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.AddPropertyBag(Autodesk.AutoCAD.Publishing.EPlotPropertyBag)
Allows a client to add free-floating EPlotPropertyBag objects.Each of these has a unique ID and may reference other EPlotPropertyBag objects by ID.
properties: An EPlotPropertyBag object.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.AddPropertiesIds(Autodesk.AutoCAD.Publishing.EPlotPropertyBag,Autodesk.AutoCAD.Publishing.DwfNode)
Assigns EPlotPropertyBag object IDs to a node.
properties: EPlotPropertyBag object to associate with the specified node.
node: The node with which properties should be associated; should be in the map of entities to node IDs.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.AddNodeToMap(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32)
Assigns a node ID to any entity ID.
entityId: ObjectId of the entity whose node ID is to be assigned.
objIds: Array of object IDs for each block that encloses this entity;an empty array if this entity is not part of a block.
nodeId: The integer node ID to be assigned to the specified entity;should be greater than 0.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.Add3DDwfProperty(System.String,System.String,System.String)
Call this method to add 3D DWF properties to entities.You can call this n times to add n number of properties.
category: Name of the category to which you want to add the property.
name: Property name.
value: Property value.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.GetGraphicIDs
Returns an array of graphic node IDs associated with this entity.
Returns: An array of graphic node IDs associated with this entity.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.getEntityBlockRefPath
Returns the block ref path for the current entity.
Returns: The block ref path for the current entity.