Autodesk.AutoCAD.Windows.TrayItemBubbleWindowCloseReason
Provides data for the value of TrayItemBubbleWindowClosedEventArgs.CloseReason.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindowCloseReason.DocumentDeactivated
Indicates that a drawing status bar's tray item bubble window is closed because its drawing is no longer the current drawing.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindowCloseReason.HyperlinkClicked
The user has closed the bubble window by clicking the hyperlink text.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindowCloseReason.TimedOut
The bubble window has closed because the display time has expired.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindowCloseReason.ClosedByUser
The user has closed the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindowCloseReason.NoNotifications
The user has turned off tray area notifications and the bubble window could not be shown.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindowCloseReason.NoIcons
The tray icon area is not visible because the drawing is inactive, or because the user has turned off the tray icon area; therefore, the bubble window could not be shown.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindowCloseReason.FailedToCreate
The bubble window could not be created.