Autodesk.AutoCAD.PlottingServices.MediaBounds
Provides properties that describe the boundaries of the media in terms of page size, lower left printable area, and upper right printable area.

Autodesk.AutoCAD.PlottingServices.MediaBounds.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)


Autodesk.AutoCAD.PlottingServices.MediaBounds.UpperRightPrintableArea


Autodesk.AutoCAD.PlottingServices.MediaBounds.LowerLeftPrintableArea


Autodesk.AutoCAD.PlottingServices.MediaBounds.PageSize


Autodesk.AutoCAD.PlottingServices.MediaBounds.ToString


Autodesk.AutoCAD.PlottingServices.MediaBounds.ToString(System.IFormatProvider)


Autodesk.AutoCAD.PlottingServices.MediaBounds.Equals(System.Object)


Autodesk.AutoCAD.PlottingServices.MediaBounds.IsEqualTo(Autodesk.AutoCAD.PlottingServices.MediaBounds)


Autodesk.AutoCAD.PlottingServices.MediaBounds.IsEqualTo(Autodesk.AutoCAD.PlottingServices.MediaBounds,Autodesk.AutoCAD.Geometry.Tolerance)


Autodesk.AutoCAD.PlottingServices.MediaBounds.GetHashCode


Autodesk.AutoCAD.PlottingServices.MediaBounds.op_Inequality(Autodesk.AutoCAD.PlottingServices.MediaBounds,Autodesk.AutoCAD.PlottingServices.MediaBounds)


Autodesk.AutoCAD.PlottingServices.MediaBounds.op_Equality(Autodesk.AutoCAD.PlottingServices.MediaBounds,Autodesk.AutoCAD.PlottingServices.MediaBounds)
