Autodesk.AutoCAD.Windows.ToolPalette.SaveFlags
Enumerates options for saving catalog item data.

Autodesk.AutoCAD.Windows.ToolPalette.SaveFlags.SaveImages
Saves all images, including those that have not changed. If this option is not specified, saves only those images that have been modified and those whose destination files differ from their source files. Use this option only to force saving of all the images.

Autodesk.AutoCAD.Windows.ToolPalette.SaveFlags.SaveLinksAsEmbedded
Embed all linked items in this item and save them to the specified archive. Linked items become embedded items. Linked items are saved if either SaveFlags.SaveLinksAsLinks or SaveFlags.SaveLinksAsEmbedded is specified.

Autodesk.AutoCAD.Windows.ToolPalette.SaveFlags.SaveLinksAsLinks
Save linked items into their own linked files, thus preserving the links. Linked items are saved if either SaveFlags.SaveLinksAsLinks or SaveFlags.SaveLinksAsEmbedded is specified.