Autodesk.AutoCAD.EditorInput.SelectionTextInputEventArgs
Provides data for UnknownInput and KeywordInput events of a PromptSelectionOptions object.

Autodesk.AutoCAD.EditorInput.SelectionTextInputEventArgs.Input
Gets a string representing the input entered by the user.

Autodesk.AutoCAD.EditorInput.SelectionTextInputEventArgs.SetErrorMessage(System.String)
Sets the error message that the selection prompt should display to the user.
errorMessage: The error message text.

Autodesk.AutoCAD.EditorInput.SelectionTextInputEventArgs.AddObjects(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Adds objects to the selection set.
ids: An array of object IDs to be added to the selection set.