Autodesk.AutoCAD.ApplicationServices.DocumentActivationChangedEventArgs
Provides data for the DocumentActivationChanged event of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentActivationChangedEventArgs.NewValue
Gets whether the document is activated or deactivated.