Autodesk.AutoCAD.Windows.IconType
Bubble window icon types.

Autodesk.AutoCAD.Windows.IconType.Warning
Bubble window alerts the user to a situation that requires user input.

Autodesk.AutoCAD.Windows.IconType.Critical
Bubble window informs the user of a critical condition that requires intervention or correction before work can continue.

Autodesk.AutoCAD.Windows.IconType.Information
Bubble window provides information to the user.

Autodesk.AutoCAD.Windows.IconType.None
No icon is displayed in the bubble window.