Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions
Provides a container for command line options that can be passed to the JigPrompts.AcquireAngle() method.

Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions.#ctor(System.String,System.String)


Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions.DefaultValue


Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions.GetDefaultValueString
