Autodesk.AutoCAD.Windows.LinetypeDialog
Represents a dialog box that allows the user to choose a linetype.

Autodesk.AutoCAD.Windows.LinetypeDialog.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.LinetypeDialog.Linetype
Gets the linetype that user chosen or sets the default.

Autodesk.AutoCAD.Windows.LinetypeDialog.IncludeByBlockByLayer
Gets or sets whether meta linetypes are to be included.

Autodesk.AutoCAD.Windows.LinetypeDialog.ShowDialog
Starts the Set linetype dialog box within the AutoCAD editor.
Returns: One of the DialogResult values.