Autodesk.AutoCAD.PlottingServices.PlotCancelStatus
This enumeration defines the plot cancel states in a multi-sheet scenario.

Autodesk.AutoCAD.PlottingServices.PlotCancelStatus.CanceledByCancelAllButton
The user canceled the entire plotting process using the UI option. That is, all the sheets pending to be plotted in the current plot job process will be canceled.

Autodesk.AutoCAD.PlottingServices.PlotCancelStatus.CanceledByCaller
The plot job process was canceled by the plot pipeline/engine.

Autodesk.AutoCAD.PlottingServices.PlotCancelStatus.Continue
The current plot job process is set to continue its plotting operation.