Autodesk.AutoCAD.PlottingServices.DsdEntryCollection
Provides a container for collections of PlottingServices.DSDEntry objects.

Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.Item(System.Int32)


Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.Count


Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.GetEnumerator


Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.CopyTo(Autodesk.AutoCAD.PlottingServices.DsdEntry[],System.Int32)


Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.Add(Autodesk.AutoCAD.PlottingServices.DsdEntry)


Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.Clear


Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.Insert(System.Int32,Autodesk.AutoCAD.PlottingServices.DsdEntry)


Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.RemoveAt(System.Int32)


Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.{dtor}
