Autodesk.AutoCAD.Windows.PaneStyles
Provides the possible values returned by the Pane.Style property.

Autodesk.AutoCAD.Windows.PaneStyles.Normal
No stretch, borders, or pop-out.

Autodesk.AutoCAD.Windows.PaneStyles.Stretch
Stretches pane to fill unused space.

Autodesk.AutoCAD.Windows.PaneStyles.PopUp
Reverses border so that text pops out.

Autodesk.AutoCAD.Windows.PaneStyles.Command
This pane is initially displayed as a borderless pane. When the user moves the mouse over the pane, the pane will do one of the following: 1.By default (or if the PaneStyles.Normal style is set for the pane), the pane will be drawn like the PaneStyles.Normal style pane above. 2.If the PaneStyles.PopUp style has been set for the pane, the pane will be drawn like thePaneStyles.PopUp style pane above.If the user right-clicks, left-clicks, or left-double-clicks on the pane, or moves the mouse away from the pane, the pane borders will no longer be displayed.

Autodesk.AutoCAD.Windows.PaneStyles.PopOut
This pane is initially displayed as a borderless pane. When the user moves the mouse over the pane, the pane will be drawn like the PaneStyles.PopOut style pane above. If the user right-clicks, left-clicks, or left-double-clicks on the pane, or moves the mouse away from the pane, the pane borders will no longer be displayed.

Autodesk.AutoCAD.Windows.PaneStyles.NoBorders
No 3-D border around the pane.