Autodesk.AutoCAD.Windows.ToolPalette.IAcPiCategorizeProperties
Objects and commands implement this interface to categorize static and dynamic properties for display in the Property Inspector. This extends the existing ICategorizeProperties interface.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiCategorizeProperties.MapPropertyToCategory(System.Int32,System.Int32@)
This method is invoked for every property of an active object or command. The Property Inspector uses it to associate every static and dynamic property with a parent category. If no parent category is specified, the corresponding property is grouped under the General category.
dispatchId: DISPID of the property.
categoryId: Output category ID that categorizes the property identified by the dispatchId parameter.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiCategorizeProperties.GetCategoryName(System.Int32,System.UInt32,System.String@)
Specifies a category name on per-category basis.
categoryId: Cateogry ID of the category for which the name string is queried.The returned category name is used by the Property Inspector control as a category label in the category row.
lcid: Local language identifier.
categoryName: String contains the category name.
Returns: Category name.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiCategorizeProperties.GetCategoryDescription(System.Int32,System.UInt32,System.String@)
Customizes the category description display on a per-category basis.
categoryId: Category ID of the category for which the description string is queried.
lcid: Local language identifier.
categoryDescription: String contains the category description.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiCategorizeProperties.GetCategoryWeight(System.Int32,System.Int32@)
The Property Inspector calls this method to get the attached weight of a category.
categoryId: Category ID of the category whose weight is being queried.
categoryWeight: Output category weight.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiCategorizeProperties.GetParentCategory(System.Int32,System.Int32@)
Gets the parent category of the specified category.
categoryId: Category ID of the cateogry whose parent is being queried.
parentCategoryId: Output category ID of the parent category of the category specified by CatID; if zero, CATID represents a root category.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiCategorizeProperties.GetUniqueID(System.String@)
Gets a unique ID for the category.
value: The unique ID to associate with the category.

Autodesk.AutoCAD.Windows.ToolPalette.IAcPiCategorizeProperties.GetCommandButtons(System.Int32,System.Object@)
Gets the command buttons that appear in a category row in the Property Inspector.
categoryId: Category ID whose "What's this Help" is being queried.
commandButtons: Output value holding an Array of objects that implement the IAcPiCommandButton interface.