Autodesk.AutoCAD.EditorInput.PromptCornerOptions
Represents optional parameters for a corner prompt.

Autodesk.AutoCAD.EditorInput.PromptCornerOptions.#ctor(System.String,System.String,Autodesk.AutoCAD.Geometry.Point3d)
Constructor.
messageAndKeywords:
globalKeywords:
basePoint: The base point to be used by the prompt.

Autodesk.AutoCAD.EditorInput.PromptCornerOptions.#ctor(System.String,Autodesk.AutoCAD.Geometry.Point3d)
Constructor.
message:
basePoint: The base point to be used by the prompt.

Autodesk.AutoCAD.EditorInput.PromptCornerOptions.DoIt
