Autodesk.AutoCAD.EditorInput.PromptDoubleOptions
Represents optional parameters for a prompt for a double.

Autodesk.AutoCAD.EditorInput.PromptDoubleOptions.#ctor(System.String,System.String)


Autodesk.AutoCAD.EditorInput.PromptDoubleOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.PromptDoubleOptions.DefaultValue
Gets the default value to be used when the user presses ENTER without any other input.

Autodesk.AutoCAD.EditorInput.PromptDoubleOptions.DoIt


Autodesk.AutoCAD.EditorInput.PromptDoubleOptions.GetDefaultValueString
