Autodesk.AutoCAD.EditorInput.FenceSelectedObject
This class describes an object that was selected by fence selection.

Autodesk.AutoCAD.EditorInput.FenceSelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int32,Autodesk.AutoCAD.EditorInput.PickPointDescriptor[])
Constructor.
id: Object Id of the s elected object.
method: AutoCAD object selection methods.
gsMarker: Index for the part of the object that was selected.
descriptors: Describes the shape of a pick point.

Autodesk.AutoCAD.EditorInput.FenceSelectedObject.GetIntersectionPoints
Gets an array of pick points used to select the object.
Returns: An array of pick points.

Autodesk.AutoCAD.EditorInput.FenceSelectedObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.FenceSelectedObject.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.