Autodesk.AutoCAD.EditorInput.PickPointDescriptor
Describes the shape of a pick point.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.#ctor(Autodesk.AutoCAD.EditorInput.PickPointKind,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)


Autodesk.AutoCAD.EditorInput.PickPointDescriptor.PointOnLine
Gets a point on the line, ray or line segment that represents the pick point. For a ray or line segment "shapes" this is the first point.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj: The argument object.
Returns: True if this object is identical to the argument object.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.IsEqualTo(Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
Compares the PointOnLine and Direction properties of a to those of this object, using Global tolerance.
a: The shape of a pick point.
Returns: True if this object is identical to the argument object.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.IsEqualTo(Autodesk.AutoCAD.EditorInput.PickPointDescriptor,Autodesk.AutoCAD.Geometry.Tolerance)
Compares the PointOnLine and Direction properties of a to those of this object, using the tolerance specified by tolerance.
a: The shape of a pick point.
tolerance: The tolerance.
Returns: True if this object is identical to the argument object.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.GetHashCode
Returns the hash code for this object.
Returns: The hash code for this object.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.op_Inequality(Autodesk.AutoCAD.EditorInput.PickPointDescriptor,Autodesk.AutoCAD.EditorInput.PickPointDescriptor)


Autodesk.AutoCAD.EditorInput.PickPointDescriptor.op_Equality(Autodesk.AutoCAD.EditorInput.PickPointDescriptor,Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
