Autodesk.AutoCAD.Runtime.DistanceUnitFormat.Decimal


Autodesk.AutoCAD.Runtime.DistanceUnitFormat.Fractional


Autodesk.AutoCAD.Runtime.DistanceUnitFormat.Architectural


Autodesk.AutoCAD.Runtime.DistanceUnitFormat.Engineering


Autodesk.AutoCAD.Runtime.DistanceUnitFormat.Scientific


Autodesk.AutoCAD.Runtime.DistanceUnitFormat.Current
