Autodesk.AutoCAD.PlottingServices.AppPlotStatus
Signifies the plot state, condition, or results of the plot job.

Autodesk.AutoCAD.PlottingServices.AppPlotStatus.PlotHadSystemError
Indicates that the plot job failed due to a system error.

Autodesk.AutoCAD.PlottingServices.AppPlotStatus.PlotHadErrors
Indicates that the job had plotting errors.

Autodesk.AutoCAD.PlottingServices.AppPlotStatus.PlotSuccessful
Indicates that the job was plotted successfully.

Autodesk.AutoCAD.PlottingServices.AppPlotStatus.ViewPlotLog
Indicates that the plot log viewer should be invoked.

Autodesk.AutoCAD.PlottingServices.AppPlotStatus.PlotStart
Indicates that the plot has started.

Autodesk.AutoCAD.PlottingServices.AppPlotStatus.NoPlotYet
Indicates that no attempt has been made to plot during this AutoCAD session. This is the default value on startup and is intended for internal use only.

Autodesk.AutoCAD.PlottingServices.AppPlotStatus.PlottingMessage
Indicates that there is a plot job message.

Autodesk.AutoCAD.PlottingServices.AppPlotStatus.DwfFilePlotted
Indicates that a DWF file was plotted successfully.