Autodesk.AutoCAD.ApplicationServices.Application
Represents the AutoCAD application. All methods are static, and the class cannot be instantiated or inherited from as a base class. It provides services for accessing the AcadApplication automation object, as well as AutoCAD's editor, document manager, and main window. It also provides methods for updating AutoCAD's display, and invoking help and context help.

Autodesk.AutoCAD.ApplicationServices.Application.Publisher
Gets the Publisher property value.

Autodesk.AutoCAD.ApplicationServices.Application.UserConfigurationManager
Gets the UserConfigurationManager property value.

Autodesk.AutoCAD.ApplicationServices.Application.MenuGroups
The MenuGroups collection contains all the menu groups that are loaded in the current AutoCAD session ,the type of the MenuGroups collection is AcadMenuGroups.

Autodesk.AutoCAD.ApplicationServices.Application.MenuBar
The MenuBar object contains that are currently displayed on the AutoCAD menu bar ,the type of the MenuBar object is AcadMenuBar.

Autodesk.AutoCAD.ApplicationServices.Application.Preferences
The Preferences object holds all the options from the Options dialog that reside in the registry ,the type of the Preferences object is AcadPreferences.

Autodesk.AutoCAD.ApplicationServices.Application.Version
Gets a Version object representing the version of the currently running instance.

Autodesk.AutoCAD.ApplicationServices.Application.IsQuiescent
Gets if there is a command, LISP script, or ARX command active.

Autodesk.AutoCAD.ApplicationServices.Application.StatusBar
Gets the application status bar, allowing developers to customize it.

Autodesk.AutoCAD.ApplicationServices.Application.MainWindow
Gets the Windows' window handle for the AutoCAD main window.

Autodesk.AutoCAD.ApplicationServices.Application.DocumentManager
Gets the DocumentManager object.

Autodesk.AutoCAD.ApplicationServices.Application.AcadApplication
Gets an instance of the AutoCAD application ,which is a instance of AcadApplication.

Autodesk.AutoCAD.ApplicationServices.Application.Quit
Closes the drawing file and exits the AutoCAD application.

Autodesk.AutoCAD.ApplicationServices.Application.SetSystemVariable(System.String,System.Object)
Sets the value of an AutoCAD system variable.
name: The name of the system variable to set.
value: The new value for the specified system variable.

Autodesk.AutoCAD.ApplicationServices.Application.GetSystemVariable(System.String)
Gets the current setting of an AutoCAD system variable.
name: The name of the variable to return. Must contain a valid system variable name (the case of the characters is not significant).
Returns: The value of the specified system variable.

Autodesk.AutoCAD.ApplicationServices.Application.AddDefaultContextMenuExtension(Autodesk.AutoCAD.Windows.ContextMenuExtension)
Adds a default mode context (shortcut) menu.
menuExtension: The context (shortcut) menu to be displayed as part of the default context menu.

Autodesk.AutoCAD.ApplicationServices.Application.RemoveDefaultContextMenuExtension(Autodesk.AutoCAD.Windows.ContextMenuExtension)
Removes a default mode context (shortcut) menu.
menuExtension: The context (shortcut) menu to be removed as part of the default context menu.

Autodesk.AutoCAD.ApplicationServices.Application.AddObjectContextMenuExtension(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.Windows.ContextMenuExtension)
Adds a context (shortcut) menu for a given class.
runtimeClass: The runtime class of the object that has the context (shortcut) menu.
menuExtension: The context (shortcut) menu to be displayed as part of the object selection context menu.

Autodesk.AutoCAD.ApplicationServices.Application.RemoveObjectContextMenuExtension(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.Windows.ContextMenuExtension)
Removes a mode context (shortcut) menu for a given class.
runtimeClass: The runtime class of the object that has the context (shortcut) menu.
menuExtension: The context (shortcut) menu to be removed as part of the object selection context (shortcut) menu.

Autodesk.AutoCAD.ApplicationServices.Application.DoDragDrop(System.Windows.Forms.Control,System.Object,System.Windows.Forms.DragDropEffects,Autodesk.AutoCAD.Windows.DropTarget)
Starts an ObjectARX application's participation in a drag-and-drop event started from an AutoCAD window.
control: The runtime class of the object that has the context (shortcut) menu.
data: The context (shortcut) menu to be removed as part of the object selection context (shortcut) menu.
allowedEffects: The current effect flag.
target: The runtime class of the object that has the context (shortcut) menu.

Autodesk.AutoCAD.ApplicationServices.Application.InvokeContextHelp(System.IntPtr,System.Int32,System.String)
Invokes the default context help file for the application (for example, "acadctxt.hlp").
window: System.IntPtr object.
contextId: System.Int32 object.
helpPrefix: System.String object.

Autodesk.AutoCAD.ApplicationServices.Application.InvokeContextHelp(System.IntPtr,System.Int32)
This overload calls InvokeContextHelp(System.IntPtr window, System.Int32 contextId, System.String helpPrefix) with helpPrefix set to null.
window: System.IntPtr object.
contextId: System.Int32 object.

Autodesk.AutoCAD.ApplicationServices.Application.InvokeHelp(System.String,System.String)
Provides Help using the specified HTML Help file.
fileName: Name of the Help file.
topic: Topic ID of the Help topic to display.

Autodesk.AutoCAD.ApplicationServices.Application.ShowAlertDialog(System.String)
Displays an alert box with an error or warning message. An alert box is a dialog box with a single OK button. If you want the message to have multiple lines, you can include newline characters (specified by \n) in the string.
message: Message to display (maximum of 132 characters with the 133rd slot reserved as the end-of-string character).

Autodesk.AutoCAD.ApplicationServices.Application.ShowModalDialog(System.Windows.Forms.Form)
Shows a modal dialog. You must use this method instead of Form.ShowDialog, which may lead to unexpected behavior.
formToShow: The form to be shown.
Returns: The result of the dialog's interaction with the user.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModalDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form)
Shows a modal dialog. You must use this method instead of Form.ShowDialog, which may lead to unexpected behavior.
owner: The owner window of this dialog.
formToShow: The form to be shown.
Returns: The result of the dialog's interaction with the user.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModalDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form,System.Boolean)
Shows a modal dialog. You must use this method instead of Form.ShowDialog, which may lead to unexpected behavior.
owner: The owner window of this dialog.
formToShow: The form to be shown.
persistSizeAndPosition: System.Boolean object.
Returns: The result of the dialog's interaction with the user.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModelessDialog(System.Windows.Forms.Form)
Shows a modeless dialog. You must use this method instead of Form.Show, which may lead to unexpected behavior.This method calls the ShowModelessDialog(System.Windows.Forms.IWin32Window owner, System.Windows.Forms.Form formToShow) method with owner set to null.
formToShow: The form to be shown.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModelessDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form)
Shows a modeless dialog. You must use this method instead of Form.Show, which may lead to unexpected behavior.
owner: The owner window of this dialog.
formToShow: The form to be shown.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModelessDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form,System.Boolean)
Shows a modeless dialog. You must use this method instead of Form.Show, which may lead to unexpected behavior.
owner: The owner window of this dialog.
formToShow: The form to be shown.
persistSizeAndPosition: System.Boolean object.

Autodesk.AutoCAD.ApplicationServices.Application.UpdateScreen
Causes AutoCAD to update its display screen. The update is essentially a repaint of the AutoCAD graphics window with what AutoCAD's display engine has cached as the window's image.

Autodesk.AutoCAD.ApplicationServices.Application.DisplayingCustomizeDialog
Occurs when the Customize dialog is displayed by AutoCAD.

Autodesk.AutoCAD.ApplicationServices.Application.DisplayingDraftingSettingsDialog
Occurs when the Drafting Settings dialog is displayed by AutoCAD.

Autodesk.AutoCAD.ApplicationServices.Application.DisplayingOptionDialog
Occurs when the Options dialog is displayed by AutoCAD.

Autodesk.AutoCAD.ApplicationServices.Application.SystemVariableChanged
Occurs when a system variable is changed directly through the SETVAR command or by entering the variable name at the command line. For other built-in AutoCAD commands that provoke system variable changes, this event is not guaranteed.

Autodesk.AutoCAD.ApplicationServices.Application.SystemVariableChanging
Occurs when a system variable is changed directly through the SETVAR command or by entering the variable name at the command line. For other built-in AutoCAD commands that provoke system variable changes, this event is not guaranteed.

Autodesk.AutoCAD.ApplicationServices.Application.QuitWillStart
Occurs just after the BeginQuit event if it has not been vetoed and just before shutdown processing begins.

Autodesk.AutoCAD.ApplicationServices.Application.QuitAborted
Occurs if a shutdown of AutoCAD is aborted, either by an individual Veto() in BeginQuit, or by any other condition that would abort a shutdown such as canceling a prompted save of a document.

Autodesk.AutoCAD.ApplicationServices.Application.BeginQuit
Occurs when AutoCAD starts to shutdown, this method allows a Veto() that will cancel the shutdown.