Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDropTarget
A stock tool implements this interface to handle objects dragged and dropped in the palette.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDropTarget.DragEnter(System.Windows.Forms.IDataObject,System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL,System.UInt32@)
Called by the framework on a stock tool when a dragged object enters a palette containing tools.
data: The IDataObject interface on the data object.
keyState: Current state of the keyboard modifier keys.
pt: Expresses the current cursor location in screen coordinates.
effect: The current effect flag.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDropTarget.DragOver(System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL,System.UInt32@)
Called by the framework on a stock tool when an object is dragged over a palette containing tools.
keyState: Current state of the keyboard modifier keys.
pt: Expresses the current cursor location in screen coordinates.
effect: The current effect flag.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDropTarget.DragLeave
Called by the framework on a stock tool when a dragged object leaves a palette containing tools.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDropTarget.Drop(System.Windows.Forms.IDataObject,System.UInt32,Autodesk.AutoCAD.Windows.ToolPalette.POINTL,System.UInt32@,System.Guid@,System.Guid@)
Called by the framework on a stock tool when an object is dropped on a palette containing tools.
data: The IDataObject interface on the data object.
keyState: Current state of the keyboard modifier keys.
pt: Expresses the current cursor location in screen coordinates.
effect: The current effect flag.
currentStockToolId: The GUID of this stock tool.
parentId: The GUID of the parent catalog item to which the new tools should be added.
Returns: The IDs of the newly created tools.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolDropTarget.GetDragDropContextMenuItem(System.Object,System.String@,System.UInt32@)
This method is called by the framework during a right mouse button drag when a dragged object can be handled by more than one stock tool. During right mouse button drag, the framework calls this method on every stock tool that can handle the dragged object if it is dropped.
data: The IDataObject interface on the data object being dragged.
menuItemText: Output string contains text to display in the drop context menu.
flag: Currently not used.