Autodesk.AutoCAD.Windows.ToolPalette.Scheme
This class is used to store and manage a tool palette scheme.

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.#ctor(System.String)
Constructor.
name: Name of the scheme.

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.Name
Gets or sets the scheme name.

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.GetCatalogSet(Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags)
Gets the catalog set for the specified catalog type.
flags: Type of catalog set to get, which can be one of the following CatalogType enum values.
Returns: A catalog set containing catalogs of the specified type, or null if the catalog type is invalid.

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.Find(System.Guid,Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags)
Searches the specified catalogs for an item ID.
guid: ID of the catalog item to find.
flags: Type of catalog to search, which can be one or more of the CatalogType enum values (multiple values can be combined with bitwise OR).
Returns: The catalog item with the specified ID, or null if there is no catalog item with that ID.

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.LoadCatalogs
Loads all the catalogs. The currently loaded catalogs are discarded.

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.LoadCatalogs(Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags,Autodesk.AutoCAD.Windows.ToolPalette.LoadFlags)
Loads the specified catalogs. The currently loaded catalogs are discarded.
flags: Catalog type to load, which can be one or more of the CatalogType enum values (multiple values can be combined with bitwise OR).
loadFlags: Load option, which can be one or more of the LoadFlags enum values (multiple values can be combined with bitwise OR).

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.UnloadCatalogs
Unloads all the catalogs.

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.UnloadCatalogs(Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags)
Unloads the specified catalogs.
flags: Catalog type to unload, which can be one or more of the CatalogType enum values (multiple values can be combined with bitwise OR).

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.SaveCatalogs
Saves all the catalogs.

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.SaveCatalogs(Autodesk.AutoCAD.Windows.ToolPalette.CatalogTypeFlags,Autodesk.AutoCAD.Windows.ToolPalette.SaveFlags)
Saves all the catalogs.
flags: Catalog type to save, which can be one or more of the CatalogType enum values (multiple values can be combined with bitwise OR).
saveFlags: Save option, which can be one or more of the SaveFlags enum values (multiple values can be combined with bitwise OR).

Autodesk.AutoCAD.Windows.ToolPalette.Scheme.{dtor}
