Autodesk.AutoCAD.PlottingServices.PlotInfo
Provides methods for building information about how and what to plot and, ultimately, acts as a vehicle to transport this information to the plotting pipeline.

Autodesk.AutoCAD.PlottingServices.PlotInfo.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.PlottingServices.PlotInfo.MergeStatus
Gets the bitwise OR value of the MergeStatus flags, which indicate the differences between the original layout settings and the validated settings.

Autodesk.AutoCAD.PlottingServices.PlotInfo.IsValidated
Gets true if the device has been validated.

Autodesk.AutoCAD.PlottingServices.PlotInfo.ValidatedConfig
Gets or sets PlotConfig that will be used if the info object is plotted. null indicates that the object has not been validated.

Autodesk.AutoCAD.PlottingServices.PlotInfo.ValidatedSettings
Gets or sets the validated PlotSettings stored in the object; or gets or set null if the object has not been validated.

Autodesk.AutoCAD.PlottingServices.PlotInfo.DeviceOverride
Gets or sets PlotConfig object representing the device override stored in the object; may be null if no override has been provided.

Autodesk.AutoCAD.PlottingServices.PlotInfo.OverrideSettings
Gets or sets the current plot settings override stored in the object; may be null if no overrides have been provided.

Autodesk.AutoCAD.PlottingServices.PlotInfo.Layout
Gets or sets ObjectId of the layout represented by the plot info object. The ID may be null if no layout has been specified.

Autodesk.AutoCAD.PlottingServices.PlotInfo.IsCompatibleDocument(Autodesk.AutoCAD.PlottingServices.PlotInfo)
Returns true if the other plot info object is document compatible with this plot info object.
info: Non-null PlotInfo object to be compared to this object for document compatibility.
Returns: True if the other plot info object is document compatible with this plot info object.

Autodesk.AutoCAD.PlottingServices.PlotInfo.{dtor}
