Autodesk.AutoCAD.Publishing.PublishUIEventArgs
Provides data for the PublishUI event.

Autodesk.AutoCAD.Publishing.PublishUIEventArgs.JobWillPublishInBackground
Gets a Boolean indicating whether the job will publish in the background.

Autodesk.AutoCAD.Publishing.PublishUIEventArgs.DsdData
Gets the DSD object for this publish job.

Autodesk.AutoCAD.Publishing.PublishUIEventArgs.IUnknown


Autodesk.AutoCAD.Publishing.PublishUIEventArgs.ReadPrivateSection(System.String)
Provides read access to the client's private DSD data.
sectionName: Name that the client assigned to its private DSD data section as a mbcs string.
Returns: Object with name-value pairs for the section requested.

Autodesk.AutoCAD.Publishing.PublishUIEventArgs.WritePrivateSection(System.String,System.Collections.IDictionaryEnumerator)
Replaces a section of the same name. This method fails if it attempts to replace a recognized section of standard DSD data.
sectionName: Name that the client assigned to its private DSD data section as a mbcs string.
data: Name-value pairs to update in the client section of the DSD file.