Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemType
Enumerates types of items that may be found in a tool catalog.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemType.ItemStockTool
Stock tool item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemType.ItemCatalog
Catalog item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemType.ItemCategory
Category item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemType.ItemPalette
Palette item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemType.ItemPackage
Package item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemType.ItemTool
Tool item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemType.ItemUnknown
Uninitialized item.