Autodesk.AutoCAD.Windows.ToolPalette.ExecutionContext
Contains values that indicate how a Tool Palette tool is launched.

Autodesk.AutoCAD.Windows.ToolPalette.ExecutionContext.DroppedInDrawing
Tool was dropped into the drawing window.

Autodesk.AutoCAD.Windows.ToolPalette.ExecutionContext.LeftButtonClicked
Left mouse button was clicked to execute the tool.