Autodesk.AutoCAD.Windows.ToolPalette.ToolEditFlags
Lists types of tool edit operations.

Autodesk.AutoCAD.Windows.ToolPalette.ToolEditFlags.EditMultiple


Autodesk.AutoCAD.Windows.ToolPalette.ToolEditFlags.EditNone


Autodesk.AutoCAD.Windows.ToolPalette.ToolEditFlags.EditCustom


Autodesk.AutoCAD.Windows.ToolPalette.ToolEditFlags.EditDefault
