Autodesk.AutoCAD.EditorInput.PromptEntityResult.ObjectId
Gets the object ID representing the picked object.

Autodesk.AutoCAD.EditorInput.PromptEntityResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptEntityResult.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.