Autodesk.AutoCAD.EditorInput.SelectedSubObject
This is the base for classes that describe subobjects selected through various techniques. It defines the basic data that describes a selected subobject: full subentity path, GS marker, and selection method, as well as optional details.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int32)
Constructor.
path: Subentitiy path.
method: Selection method.
gsMarker: The index for the part of the object that was selected.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.GraphicsSystemMarker
Gets the index for the part of the object that was selected.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.OptionalDetails


Autodesk.AutoCAD.EditorInput.SelectedSubObject.SelectionMethod
Gets selection method.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.FullSubentityPath
Subentitiy path.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.