Autodesk.AutoCAD.PlottingServices.StdConfiguration
This enumeration is used to identify special device types installed with AutoCAD.

Autodesk.AutoCAD.PlottingServices.StdConfiguration.PublishToWebPng
The PNG publish-to-web device.

Autodesk.AutoCAD.PlottingServices.StdConfiguration.PublishToWebJpg
The JPG publish-to-web device.

Autodesk.AutoCAD.PlottingServices.StdConfiguration.PublishToWebDwf
The DWF publish-to-web device.

Autodesk.AutoCAD.PlottingServices.StdConfiguration.DwfEplotOptForViewing
The DWF ePlot optimized-for-viewing device.

Autodesk.AutoCAD.PlottingServices.StdConfiguration.DwfEplotOptForPlotting
The DWF ePlot optimized-for-plotting device.

Autodesk.AutoCAD.PlottingServices.StdConfiguration.Dwf6ePlot
The DWF6 ePlot device.

Autodesk.AutoCAD.PlottingServices.StdConfiguration.DefaultWindowsSysPrinter
A device representing the Windows printer used by default on the current system.

Autodesk.AutoCAD.PlottingServices.StdConfiguration.NoneDevice
The "None" device--a default device used when no real devices are available.