Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs
Provides data for the PromptForSelectionEnding event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs.Add(Autodesk.AutoCAD.EditorInput.SelectedObject)


Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs.AddSubEntity(Autodesk.AutoCAD.EditorInput.SelectedSubObject)


Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs.Remove(System.Int32)


Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs.RemoveSubEntity(System.Int32,System.Int32)
