Autodesk.AutoCAD.PlottingServices.PreviewEndPlotInfo
Contains information about the results of a plot preview operation.

Autodesk.AutoCAD.PlottingServices.PreviewEndPlotInfo.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.PlottingServices.PreviewEndPlotInfo.Status
Gets how the preview was terminated by the user, which is one of the following values:PreviewStatus.Plot,PreviewStatus.Cancel,PreviewStatus.Normal.

Autodesk.AutoCAD.PlottingServices.PreviewEndPlotInfo.{dtor}
