Autodesk.AutoCAD.Windows.Pane
Represents an individual pane in the status bar. A pane can contain text or an icon.

Autodesk.AutoCAD.Windows.Pane.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.Pane.MaximumWidth
Gets or sets the maximum width for the pane, in logical units. The default maximum pane width is 0, which means the pane will be sized according to the pane text. This value is ignored when an icon is displayed in the pane.

Autodesk.AutoCAD.Windows.Pane.MinimumWidth
Gets or sets the minimum width for the pane, in logical units. The default minimum pane width is 0.

Autodesk.AutoCAD.Windows.Pane.Style
Gets or sets the current pane style.

Autodesk.AutoCAD.Windows.Pane.Text
Gets or sets the text displayed in the pane.

Autodesk.AutoCAD.Windows.Pane.{dtor}
