Autodesk.AutoCAD.Windows.ToolPalette.AccessRight
Specifies catalog item access rights.

Autodesk.AutoCAD.Windows.ToolPalette.AccessRight.ReadWrite
Item is read/write.This flag can be combined with AccessRight.ReadOnlyFile. This flag is loaded and saved while loading and saving the item.

Autodesk.AutoCAD.Windows.ToolPalette.AccessRight.Read
Item is read-only. This flag can be combined with AccessRight.ReadOnlyFile. This flag is loaded and saved while loading and saving the item.

Autodesk.AutoCAD.Windows.ToolPalette.AccessRight.ReadOnlyFile
Item was loaded from a read-only file. This flag can be combined with AccessRight.Read or AccessRight.ReadWrite. This flag will not be loaded and saved while loading and saving the item.