Autodesk.AutoCAD.Windows.ToolPalette.IOPMPropertyDialog
Provides a method that enables the message handler of a stock ellipsis control to display a modal dialog when the Property Inspector creates a stock ellipsis control to display a property.

Autodesk.AutoCAD.Windows.ToolPalette.IOPMPropertyDialog.DoModal(System.String@,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
The ellipsis stock control calls this method on the property page object of a property that returned a non-null CLSID.
propertyValue: Current value of the property represented as a string; can be empty but never null.
activeShapes: Array of object IDs whose values are represented by propertyValue; can be empty but never null.