Autodesk.AutoCAD.Windows.ToolPalette.POINTL
This .NET struct wraps the POINTL struct of the Windows API.

Autodesk.AutoCAD.Windows.ToolPalette.POINTL.x


Autodesk.AutoCAD.Windows.ToolPalette.POINTL.y
