Autodesk.AutoCAD.ApplicationServices.ConfigurationSectionNameAttribute
Defines an attribute that is used to define and retrieve a configuration section name.

Autodesk.AutoCAD.ApplicationServices.ConfigurationSectionNameAttribute.#ctor(System.String)
Constructor.
name: Name of the Configuration Section.

Autodesk.AutoCAD.ApplicationServices.ConfigurationSectionNameAttribute.Name
Gets the name of the Configuration Section.