Autodesk.AutoCAD.Windows.ColorDialog.ColorTabs
This enumeration represents the tabs of the color dialog.

Autodesk.AutoCAD.Windows.ColorDialog.ColorTabs.ColorBookTab
Color book tab.

Autodesk.AutoCAD.Windows.ColorDialog.ColorTabs.TrueColorTab
True color tab.

Autodesk.AutoCAD.Windows.ColorDialog.ColorTabs.ACITab
ACI tab.