Autodesk.AutoCAD.EditorInput.SelectionFilter
Describes the kind of filtering to be applied to the object during a selection prompt.

Autodesk.AutoCAD.EditorInput.SelectionFilter.#ctor(Autodesk.AutoCAD.DatabaseServices.TypedValue[])


Autodesk.AutoCAD.EditorInput.SelectionFilter.GetFilter
Returns an array of TypeValues that contains the filtering instructions.
Returns: An array of TypeValues that contains the filtering instructions.