Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem
CatalogItem is the base class for all catalog items.It encapsulates an item's common properties and behavior.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.#ctor(System.IntPtr,System.Boolean)


Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.ChildCount
Gets the number of children.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.TargetProductCount
Gets the number of target products specified in the item, or zero if no target product is specified.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.OverlayImageFilePath
For local overlay images,this property copies the image file's absolute path to the buffer. If the overlay image file in the item refers to a URL and is not downloaded, this function copies the URL. If the overlay image file refers to a URL, and the file is downloaded locally, this function copies the local file path.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.OverlayImageInfo
Gets or sets information about the overlay image.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.OverlayImage
Gets or sets the overlay image if an overlay image is set in the item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.SourceID
Gets or sets the ID of the source catalog item from which this item can be refreshed.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.LinkFilePath
Not implemented.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.CustomData
Gets the XML node which contains the item's custom data.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.AutoRefresh
Gets or sets the auto refresh value.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.CanRefresh
Gets a booleam indicating whether an item can be refreshed. An item can be refreshed if it has source information.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Refresh
Gets or sets the refresh value.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.LastRefreshedTime
Gets or sets the the times of item last refresh.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.LastModifiedTime
Gets or sets the the times of item last modification.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.CreateTime
Gets or sets the the times of item creation.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.ImageList
Gets the image list associated with the item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.IsLinkLoaded
Gets true if the item is a linked item, and if the linked file is currently loaded into this item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.IsLink
Gets value indicates whether the item is a linked item. Linked items provide a reference to another XML file which contains the item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.IsRoot
Gets a boolean indicating whether this item is the root item. A root item is one that does not have a parent.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Parent
Gets the parent of the item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Scheme
Gets the scheme to which this catalog item belongs.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Root
Gets the root item if successful.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.LocalFile
Gets the local file from which this item was loaded.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Url
Gets the file or URL from which this item was loaded.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.PublisherUrl
Gets or sets the publisher's URL.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.PublisherEmail
Gets or sets the publisher's Email address.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.PublisherCountry
Gets or sets the publisher's country.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.PublisherDescription
Gets or sets the publisher description.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.PublisherName
Gets or sets the publisher's name.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.ParentDocumentUrl
Gets or sets the parent document URL.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.ParentDocumentDescription
Gets or sets the parent document description.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.ParentDocumentName
Gets or sets the parent document name.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.SourceUrl
Gets or sets the URL of the source for this item.The source URL refers to the original file (in the intranet, Internet, or local server) from which this item was downloaded. The source URL is used to refresh the item from its source.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.LinkUrl
Gets or sets the URL if this item is a linked item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Keywords
Gets or sets the keywords of the item. Keywords are separated by commas.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.HelpInfoData
Gets additional data required to display the help information stored in the item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.HelpInfoCommand
Gets the command information stored in the item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.HelpInfoFile
Gets string specifying an HTML filename, a URL, or a compiled HTML filename.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.ToolTipText
Gets or sets the tool tip text for the item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Description
Gets or sets the item description.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Name
Gets or sets the item name.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.IsReadOnly
Gets true if the item is read-only.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.AccessRight
Gets or sets the access right for the item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.ID
Gets or sets the ID of the item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.HasChildren
Gets or sets true if the item has children.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.DeleteUnmanagedObject


Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.SetHelpInfo(System.String,System.String,System.String)
Sets the URL of the help file to be used by the item.
file: String specifying an HTML file, a URL, or a compiled HTML Help (CHM) file.
command: Command string.
data: Addional data required to display the help.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.GetImageFilePath(System.Int32)
Gets the local image file with absolute path of the image at the specified index. If the image file in the item refers to a URL and the image file is not downloaded, it gets the URL. If the image file refers to a URL and the image file is downloaded locally, it gets the local image file path.
index: Zero-based index of the image.
Returns: The local image file.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.FromFile(System.String,System.Boolean,Autodesk.AutoCAD.Windows.ToolPalette.LoadFlags)
Finds the catalog item contained in the specified XML file, then creates and returns an appropriate catalog item object. If the file does not contain a valid catalog item this method returns null. If load is true, this method loads the file into the item after creating it.
file: A string specifying the XML file that contains the catalog item.
load: Bool to indicate whether the function should load the file into the newly created catalog item.
flags: Load option value; ignored if load is false.
Returns: The newly created catalog item if the file contains a catalog item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.GetType(System.String)
Checks the root node of the specified XML file and returns the type of catalog item it contains.
filename: A string containing the name of an XML file that contains a catalog item.
Returns: The type of catalog item it contains.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Load(System.Uri,Autodesk.AutoCAD.Windows.ToolPalette.LoadFlags)
Loads the catalog item from an XML file.
url: A string specifying the file from which the item is loaded.
flags: Load option value.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.LoadLink
If this catalog item is a linked item, this method loads the linked file into this item. If this item is not linked, this method fails.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Save(System.Uri,Autodesk.AutoCAD.Windows.ToolPalette.SaveFlags)
Saves the catalog item to the XML file specified by url.
url: A string specifying the file to which the item is saved.
flag: Save option value.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.AddChild(Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem)
Appends newItem as the last child of this item.
newItem: The item to be added.
Returns: The index of the added element.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.InsertChild(System.Int32,Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem)
Inserts newItem as the child of this item at the index specified by index.
index: Index at which to insert the it.
newItem: The item to be inserted.
Returns: Non-zero if successful.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.DeleteChild(Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem)
Removes the specified child item from the list of children.
item: Child item to be deleted from this item's list of children.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.DetachChild(Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem)
Removes the specified child item from the list of children without deleting it. The detached child's parent member is set to null.
item: Child item to be detached from this item's list of children.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.GetChildCountFor(Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemType)
Returns the number of children of type type.
type: Item type to count.
Returns: The number of children of type type.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.GetChild(System.Int32)
Returns the child at index index.
index: Zero-based index of the child to be retrieved.
Returns: The child at index index.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.GetNextChild(System.Int32,Autodesk.AutoCAD.Windows.ToolPalette.CatalogItemType)
Searches the child array for a child of type type, beginning at index index.
index: Array index at which to begin the search, or -1 to find the first item that matches the specified type.
type: Item type to get.
Returns: The next matching child item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.DeleteAllChildren
Deletes all of this item's children and their descendents recursively.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.GetImage(System.Drawing.Size)
Returns an Image object.The object's width in pixels is specified by the Size.Width member of size. The height member of size is ignored.
size: The image size.
Returns: An Image object.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.GetXml(Autodesk.AutoCAD.Windows.ToolPalette.SaveFlags)
Gets the XML representation of the item, including the item node and all its children.
flag: Save option enum value.
Returns: The XML representation of the item.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.FindInChildren(System.String,System.Boolean)
Searches the children for an item by its name. The search is not case sensitive. Because duplicate names are allowed, this function returns the first item that matches the name.
name: Name of the item for which to search.
recursive: Boolean specifying whether to search recursively (the children of the children) or only search the children of this item.
Returns: The catalog item found. Returns null if no item is found with the specified name.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.FindInChildren(System.Guid,System.Boolean)
Finds the item with the specified ID. The item from which this function is called is not included in the search.
id: ID to find.
recursive: Boolean indicating whether to search the children's descendents.
Returns: The item if it is found.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.DoRefresh(Autodesk.AutoCAD.Windows.ToolPalette.RefreshFlags)
Refreshes the item from its source. The item should have source information to refresh it, and the refresh option should not be disabled. Refresh fails if there is no source information or if refresh currently is disabled.
flag: Refresh flag,which can be one or more of the ToolPalette.RefreshFlags flags.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.Download(System.Uri,Autodesk.AutoCAD.Windows.ToolPalette.DownloadFlags,System.String)
Downloads a catalog item from the specified URL to a local directory and then loads the file into this item. The URL should point to the same type of catalog item represented by this object.
url: URL to download;should point to the same type of catalog item that is represented by this object.
flag: Download flag, which can be one or more of the ToolPalette.DownloadFlags flags.
downloadPath: Path to which the URL will be downloaded; if null, the URL is downloaded to TEMP directory.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.GetReferencePath(System.Int32)
Gets the reference path which is used to resolve the relative paths of image files and linked files while loading and saving the item.
flag: Value indicating type of reference path.
Returns: The reference path.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.SetReferencePath(System.String,System.Int32)
Sets the reference path. This path is used to resolve the relative paths of image files and linked files while loading and saving the item. If no reference path is set, relative paths are resolved using the path of the file from which the item is loaded/saved. Use this method to override this default path.
value: String to be used as the reference path for the item.
flag: Value indicating type of reference path to set.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.AssignNewId(System.Boolean)
Creates a new ID and sets it in this item.
recursive: BOOL to indicate whether to set new IDs in children.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.DeleteImageFile(System.Boolean)
Permanently deletes the image file referred to by this item.
recursive: BOOL to indicate whether to delete image files of children.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.DeleteLinkFile(System.Boolean)
Permanently deletes the link file if this item is a linked item.
recursive: BOOL to indicate whether children's links should be deleted.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.DeleteOverlayImageFile(System.Boolean)
Permanently deletes the overlay image file of this item and, optionally, those of its children.
recursive: Boolean that indicates whether to delete images recursively.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.GetTargetProduct(System.Int32)
Returns information about an entry in the target product list.
index: Zero-based index of a target product list item.
Returns: ToolPalette.TargetProductInfo object that receives the product information.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.AddTargetProduct(Autodesk.AutoCAD.Windows.ToolPalette.TargetProductInfo)
Adds a new target product to the target product list.
productInfo: ToolPalette.TargetProductInfo object that contains the product's information.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.DeleteTargetProduct(System.Int32)
Deletes the target product whose index in the target product list is iIndex. iIndex is zero-based and may range from zero to one less than the number of target products.
index: Index of the target product to delete.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.IsValidForProduct(System.String,System.Int32,System.Int32,System.Int32)
Returns a value that indicates whether this item can be used in the specified product.
productName: The product name.
majorVersion: Major version value of the product.
minorVersion: Minor version of the product.
localeId: Locale identifier of the product.
Returns: Boolean indicates whether this item can be used in the specified product.

Autodesk.AutoCAD.Windows.ToolPalette.CatalogItem.{dtor}
