Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject
Encapsulates a subobject that is selected by the crossing or window selection method.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int32)
Encapsulates a subobject that is selected by the crossing or window selection method.
path: Subobject path.Uniquely identifies a subobject within a particular entity in a drawing.
method: Subobject selection methods.
gsMarker: A value that describes what part of the subobject was selected.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject.GetPickPoints
Returns the list of pick points used to select the subobject.
Returns: The list of pick points used to select the subobject.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.