Autodesk.AutoCAD.Windows.ToolPalette.ImageType
Enumerates the types of image formats that may be contained by Image objects.

Autodesk.AutoCAD.Windows.ToolPalette.ImageType.Icon
Image is an icon.

Autodesk.AutoCAD.Windows.ToolPalette.ImageType.Bitmap
Image is a bitmap.

Autodesk.AutoCAD.Windows.ToolPalette.ImageType.Tiff
Image is of type Tiff.

Autodesk.AutoCAD.Windows.ToolPalette.ImageType.Gif
Image is of type Gif.

Autodesk.AutoCAD.Windows.ToolPalette.ImageType.Png
Image is of type Png.

Autodesk.AutoCAD.Windows.ToolPalette.ImageType.Jpeg
Image is of type Jpeg.

Autodesk.AutoCAD.Windows.ToolPalette.ImageType.EnhancedMetaFile
Image is an Enhanced metafile.

Autodesk.AutoCAD.Windows.ToolPalette.ImageType.MetaFile
Image is metafile.

Autodesk.AutoCAD.Windows.ToolPalette.ImageType.Uninitialized
Image object is not loaded.