Autodesk.AutoCAD.ApplicationServices.DocumentDestroyedEventArgs
Provides data for the DocumentDestroyed event of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentDestroyedEventArgs.FileName
Gets the name of the document that was destroyed.