Autodesk.AutoCAD.EditorInput.KeywordCollection
Holds a collection of Keyword objects.

Autodesk.AutoCAD.EditorInput.KeywordCollection.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Item(System.Int32)
Holds a collection of Keyword objects.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Default
Gets or sets the default keyword to be used when the user presses ENTER without any other input.

Autodesk.AutoCAD.EditorInput.KeywordCollection.GetEnumerator
Returns an IEnumerator for the KeywordCollection.
Returns: An IEnumerator for the KeywordCollection.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Add(System.String)
Adds a keyword to the KeywordCollection class.Calls Add(globalName,globalName).
globalName: Global name of the keyword; this is never displayed, but can be used by programs to access keywords when the local translation is not known.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Add(System.String,System.String)
Adds a keyword to the KeywordCollection class.Calls Add(globalName,localName,localName).
globalName: Global name of the keyword; this is never displayed, but can be used by programs to access keywords when the local translation is not known.
localName: Local name of the keyword; the user enters the local name to specify the keyword.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Add(System.String,System.String,System.String)
Adds a keyword to the KeywordCollection class.Calls Add(globalName, localName,displayName, true, true).
globalName: Global name of the keyword; this is never displayed, but can be used by programs to access keywords when the local translation is not known.
localName: Local name of the keyword; the user enters the local name to specify the keyword.
displayName: Display name of the keyword; this is shown on the command line and is usually the same as local name.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Add(System.String,System.String,System.String,System.Boolean,System.Boolean)
Adds a keyword to the KeywordCollection class.
globalName: Global name of the keyword; this is never displayed, but can be used by programs to access keywords when the local translation is not known.
localName: Local name of the keyword; the user enters the local name to specify the keyword.
displayName: Display name of the keyword; this is shown on the command line and is usually the same as local name.
visible: Indicates whether the keyword should be shows to the user.
enabled: Indicates whether the keyword is currently enabled; a disabled keyword is disabled is not accepted as user input.

Autodesk.AutoCAD.EditorInput.KeywordCollection.CopyTo(Autodesk.AutoCAD.EditorInput.Keyword[],System.Int32)
Copies the KeywordCollection class or a portion of it to a one-dimensional array.
array: The one-dimensional Array that is the destination of the elements copied from KeywordCollection. The array must have zero-based indexing.
index: The zero-based index in array at which copying begins.

Autodesk.AutoCAD.EditorInput.KeywordCollection.GetDisplayString(System.Boolean)
Gets a string that represent the keywords in this collection as they should be displayed to the user.
showNoDefault: Shows No Default.
Returns: A string that represent the keywords in this collection.