Autodesk.AutoCAD.Runtime.CommandClassAttribute
This custom attribute class is used to mark a type as the application's command class. An application may designate one, and only one, type as its command class. AutoCAD looks for an application's command methods on the type that bears this attribute.

Autodesk.AutoCAD.Runtime.CommandClassAttribute.#ctor(System.Type)


Autodesk.AutoCAD.Runtime.CommandClassAttribute.Type
