Autodesk.AutoCAD.Windows.ToolPalette.LoadFlags
Enumerates options for loading catalog item data.

Autodesk.AutoCAD.Windows.ToolPalette.LoadFlags.LoadImages
Load images while loading the item. If this option is not set, the images are loaded on demand. Use this option only if it is necessary to load images "up front," because statically loaded images unnecessarily occupy memory while not in use.

Autodesk.AutoCAD.Windows.ToolPalette.LoadFlags.LoadLinks
Load linked items also.