Autodesk.AutoCAD.ApplicationServices.DocumentLockMode
Locking type Enum.

Autodesk.AutoCAD.ApplicationServices.DocumentLockMode.Read
This locking type indicates a Read Only lock. It may coexist with Read locks placed by other execution contexts. It mutually excludes other Write and ExclusiveWrite locks. It allows the execution context to examine the given document contents, but not to modify.

Autodesk.AutoCAD.ApplicationServices.DocumentLockMode.Write
This locking type indicates a Shared Write lock. It may coexist with Read locks placed by other execution contexts. It mutually excludes other Write and ExclusiveWrite locks. It allows the execution context to examine modify the given document contents.

Autodesk.AutoCAD.ApplicationServices.DocumentLockMode.None
No locking.

Autodesk.AutoCAD.ApplicationServices.DocumentLockMode.ExclusiveWrite
This locking type indicates an Exclusive Write lock. It mutually excludes all other lock types by other execution contexts. It allows the execution context to examine and modify the given document contents.

Autodesk.AutoCAD.ApplicationServices.DocumentLockMode.ProtectedAutoWrite
This locking type is used instead of AutoWrite before executing code which might perform a nested document lock which should leave the AutoWrite lock intact. See the description following this table.

Autodesk.AutoCAD.ApplicationServices.DocumentLockMode.NotLocked
This locking type indicates there is no locking on the document context.

Autodesk.AutoCAD.ApplicationServices.DocumentLockMode.AutoWrite
This locking type indicates an Automatic Write lock. The purpose of this lock mode is to group contiguous sequences of ActiveX requests that were made without explicit locking, together as a single command. This insures their behavior as a single command with regards to Undo and notification, rather than as a bunch of separate commands/operations. This lock mode has the same effect as Write, except it is only effective when no other lock is active. An automatic lock will be unlocked when any other kind of lock is requested, complete with notification and the end undo markers and will occur just before the new notification and start undo markers for the new lock request.