Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties
IAcadToolProperties can be used by the tool's COM object to get and set properties of the tool, such as name, description, and image.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.ActiveShapeIds


Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.CurrentShapeId


Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.ShapePackageId


Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.IsFlyoutEnabled


Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.ToolType


Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.IsReadOnly
Gets true if the item is read-only; false if the item is writable.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.HelpData
Gets or sets the additional Help data required to display the Help. The Help data depends on the Help command.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.HelpCommand
Gets or sets the Help command which specifies how the Help is displayed.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.HelpFile
Gets or sets the Help file, which can be an HTML file, a URL, or a compiled HTML file.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.ToolTipText
Gets or sets the tool tip text.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.Description
Gets or sets a string that receives the tool description.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.Name
Gets or sets a string that receives the tool name.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.ID
Gets or sets the ID of the tool.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.GetImage(System.Int32,System.Int32,System.Object@,System.String@,System.String@)
Returns the image associated with the tool whose width matches with width from the image list. The height of the image is ignored.
width: Width of the image; only width is used, and height is ignored.
height: Height of the image; this parameter is ignored.
value: Output address of the output variable that receives the interface of the IAcadToolImage interface.
resourceName: Output resource identifier if the image was loaded from a resource.
sourceFile: Output file name if the image was loaded from a disk file.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.SetImage(System.Int32,System.Int32,System.Object,System.String,System.String)
Sets an image or deletes an image. A tool can have multiple size images associated with it. This method replaces the image of the specified size if an image of same size exists. If an image of the same size does not exist, it adds the image to the list.
width: Width of the image; only width is used, and height is ignored.
height: Height of the image; this parameter is ignored.
newVal: The IAcadToolImage interface that needs to be set; this can be null if the image is a resource image.
resourceName: Resource identifier of the image if the image resides in a resource DLL.
sourceFile: If the image is from resource, this specifies the resource DLL containing the resource image; otherwise, the image file name to use while saving the image to a file.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.GetCustomData
Gets the XML node that contains the tool's custom data.
Returns: Address to receive the XML node that contains the tool's custom data.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.GetCurrentShape(System.Object@)


Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.GetOverlayImage(System.Object@,System.String@,System.String@)


Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.SetOverlayImage(System.Object,System.String,System.String)


Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolProperties.GetAcTcTool
