Autodesk.AutoCAD.Windows.PalettePersistEventArgs
Provides data for the PalettePersist event.

Autodesk.AutoCAD.Windows.PalettePersistEventArgs.#ctor(Autodesk.AutoCAD.ApplicationServices.IConfigurationSection)


Autodesk.AutoCAD.Windows.PalettePersistEventArgs.ConfigurationSection
