Autodesk.AutoCAD.Runtime.Converter
Converts angular and distance numerical values to string values, and vice versa.

Autodesk.AutoCAD.Runtime.Converter.DistanceToString(System.Double,Autodesk.AutoCAD.Runtime.DistanceUnitFormat,System.Int32)
Formats a floating-point value as a string.
value: Value to format.
units: Units into which the string is formatted as a valid AutoCAD LUNITS value; if -1, uses the current value of LUNITS.
precision: Number of decimal places of precision to include in the string; if -1, uses the current value of the AutoCAD LUPREC system variable.
Returns: Resulting string.

Autodesk.AutoCAD.Runtime.Converter.DistanceToString(System.Double)
This method calls Converter.DistanceToString(Double value, DistanceUnitFormat units, Int32 precision) method using the current distance units format for units and the current value of the LUPREC system variable for precision.
value: Value to format.
Returns: Resulting string.

Autodesk.AutoCAD.Runtime.Converter.StringToDistance(System.String,Autodesk.AutoCAD.Runtime.DistanceUnitFormat)
Converts a string that displays a real (double-precision floating-point) value expressed in the specified display format into a real value.
value: String to be converted.
units: Units in which the string is formatted; if -1, uses the current value of LUNITS.
Returns: The result of the conversion.

Autodesk.AutoCAD.Runtime.Converter.StringToDistance(System.String)
This method calls Converter.StringToDistance(String value, DistanceUnitFormat units) method using the current DISTANCEunits format for units.
value: String to be converted.
Returns: The result of the conversion.

Autodesk.AutoCAD.Runtime.Converter.AngleToString(System.Double,Autodesk.AutoCAD.Runtime.AngularUnitFormat,System.Int32)
Formats an angle into a string.
value: Angle to be converted.
units: Units into which the angle is formatted; if -1, uses the current value of AUNITS.
precision: Number of decimal places of precision to include in the string; if -1 uses the current value of AUPREC.
Returns: Result of the conversion,large enough to hold the formatted string (depends on requested mode and precision but 15 bytes is usually adequate).

Autodesk.AutoCAD.Runtime.Converter.AngleToString(System.Double)
This method calls Converter.AngleToString(Double value, AngularUnitFormat units, Int32 precision) method using the current angular units format for units and the current value of the AUPREC system variable for precision.
value: Angle to be converted.
Returns: Result of the conversion,large enough to hold the formatted string (depends on requested mode and precision but 15 bytes is usually adequate).

Autodesk.AutoCAD.Runtime.Converter.StringToAngle(System.String,Autodesk.AutoCAD.Runtime.AngularUnitFormat)
Converts a string representation of an angle to a double-precision floating-point value.
value: String representation of the angle being converted.
units: Units in which the string is formatted; if -1, uses the current value of AUNITS.
Returns: Result of the conversion, in radians.

Autodesk.AutoCAD.Runtime.Converter.StringToAngle(System.String)
This method calls Converter.StringToAngle(String value, AngularUnitFormat units) method using the current angular units format for units.
value: String representation of the angle being converted.
Returns: Result of the conversion, in radians.