Autodesk.AutoCAD.ApplicationServices.DocumentLock
Represents a locked document. Objects of this class are created and returned to an application when it calls the Document.LockDocument method.

Autodesk.AutoCAD.ApplicationServices.DocumentLock.Dispose
Unlocks a previously locked document.