Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs
Provides data for the DocumentLockModeChanged event of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.GlobalCommandName
Gets the name of the command that is requesting the change.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.CurrentMode
Gets the current lock mode of the document.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.MyCurrentMode
Gets the current locks that this fiber has on the document.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.MyPreviousMode
Gets the previous locks of this fiber.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.Document
Gets the document that is requesting the change.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.Veto
Used to veto the lock change.