Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolFlyoutShape
This interface provides access to the ID of the flyout tool that is being executed or dragged.

Autodesk.AutoCAD.Windows.ToolPalette.IAcadToolFlyoutShape.SetFlyoutTools(System.Object)
This method is called by the framework on a tool that appears as a shape in a flyout palette. It is called when the flyout tool is executed or dragged. This method passes the ID of the flyout tool to the tool's COM object during execution or drag.
flyoutToolIds: IDs of flyout tools.