Autodesk.AutoCAD.Windows.Window
Represents an operating system window.

Autodesk.AutoCAD.Windows.Window.Icon
Gets or sets the icon for the window.

Autodesk.AutoCAD.Windows.Window.Text
Gets or sets the title of the window.

Autodesk.AutoCAD.Windows.Window.Location
Gets or sets the location of the window.

Autodesk.AutoCAD.Windows.Window.Size
Gets or sets the size of the window.

Autodesk.AutoCAD.Windows.Window.Visible
Gets or sets a value indicating whether the window is displayed.

Autodesk.AutoCAD.Windows.Window.WindowState
Gets or sets the window's window state.

Autodesk.AutoCAD.Windows.Window.Handle
Gets the window handle that the window is bound to.

Autodesk.AutoCAD.Windows.Window.Close
Closes the window.

Autodesk.AutoCAD.Windows.Window.DeleteUnmanagedObject


Autodesk.AutoCAD.Windows.Window.{dtor}
