Autodesk.AutoCAD.EditorInput.SelectionSet.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.EditorInput.SelectionSet.IsSynchronized
For internal use only.

Autodesk.AutoCAD.EditorInput.SelectionSet.SyncRoot
For internal use only.

Autodesk.AutoCAD.EditorInput.SelectionSet.Item(System.Int32)


Autodesk.AutoCAD.EditorInput.SelectionSet.FromObjectIds(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Creates a new selection set using the object IDs in ids.
ids: The object IDs.
Returns: A new selection set using the object IDs in ids.

Autodesk.AutoCAD.EditorInput.SelectionSet.GetObjectIds
Gets an array of object IDs representing the selected objects.
Returns: An array of object IDs representing the selected objects.

Autodesk.AutoCAD.EditorInput.SelectionSet.CopyTo(Autodesk.AutoCAD.EditorInput.SelectedObject[],System.Int32)
Copies the SelectionSet or a portion of it to a one-dimensional array.
array: The one-dimensional Array that is the destination of the elements copied from SelectionSet. The array must have zero-based indexing.
index: The zero-based index in array at which copying begins.

Autodesk.AutoCAD.EditorInput.SelectionSet.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider: The culture-specific format.
Returns: An equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.SelectionSet.ToString
Returns an equivalent string representation of this object.
Returns: An equivalent string representation of this object.