Autodesk.AutoCAD.PlottingServices.SheetType
Represents the type of sheet (multi sheet or single sheet).

Autodesk.AutoCAD.PlottingServices.SheetType.OriginalDevice
The sheets will be plotted to the original device configured in the layout.

Autodesk.AutoCAD.PlottingServices.SheetType.MultiDwf
All the sheets will be aggregated into a multi-sheet DWF file.

Autodesk.AutoCAD.PlottingServices.SheetType.SingleDwf
Each sheet will be plotted to an individual DWF file.