Autodesk.AutoCAD.EditorInput.PromptStringOptions
Represents optional parameters for a prompt for a string.

Autodesk.AutoCAD.EditorInput.PromptStringOptions.#ctor(System.String)


Autodesk.AutoCAD.EditorInput.PromptStringOptions.UseDefaultValue
Gets or sets whether the prompt should use the default value when the user presses ENTER without any other input. The property allowing client code to set the default value is declared by derived classes.

Autodesk.AutoCAD.EditorInput.PromptStringOptions.DefaultValue
Gets or sets the default value to be used when the user presses ENTER without any other input.

Autodesk.AutoCAD.EditorInput.PromptStringOptions.DoIt
