Autodesk.AutoCAD.Windows.TrayItemBubbleWindowClosedEventArgs
Provides data for the TrayItemBubbleWindow.Closed event.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindowClosedEventArgs.CloseReason
Gets the reason for closing the bubble window.