Autodesk.AutoCAD.EditorInput.DrawJig.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.EditorInput.DrawJig.ViewportDraw(Autodesk.AutoCAD.GraphicsInterface.ViewportDraw)


Autodesk.AutoCAD.EditorInput.DrawJig.WorldDraw(Autodesk.AutoCAD.GraphicsInterface.WorldDraw)
