Autodesk.AutoCAD.Publishing.OptionsDialogResult
Represents the return value of the Publisher.ShowDwfOptionsDialog method.

Autodesk.AutoCAD.Publishing.OptionsDialogResult.PlotConfig


Autodesk.AutoCAD.Publishing.OptionsDialogResult.DsdData


Autodesk.AutoCAD.Publishing.OptionsDialogResult.Status
