Autodesk.AutoCAD.PlottingServices.PlotConfigManager
This class exposes access to plot configurations, plot style tables, devices, and PC3 files available on the system.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.CurrentConfig
Gets the currently loaded plotting device as a PlotConfig,or null if no device is currently loaded.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.StdConfigNames(Autodesk.AutoCAD.PlottingServices.StdConfiguration)
Gets the name (which may be localized) for the specified standard device.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.ColorDependentPlotStyles
Gets the list of color-dependent plot style tables installed on the system (with fully qualified paths).

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.NamedPlotStyles
Gets the list of named plot style tables installed on the system (with fully qualified paths).

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.Devices
Gets a list of plot devices installed on the system.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.RefreshList(Autodesk.AutoCAD.PlottingServices.RefreshCode)
Refreshes the lists cached in the PlotConfigManager based on the input enum RefreshCode.
refreshCode: Specifying which lists need to be refreshed; default is RefreshCode.All.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.SetCurrentConfig(System.String)
This method attempts to load the specified device or device configuration file and make it the current device.
deviceName: Name of the device for which plotter configuration is requested.