Autodesk.AutoCAD.PlottingServices.PlotReactorManager
This class manages a list of PlotReactor instances and provides methods for applications to add and remove reactor instances from the list.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.#ctor
Initializes a new instance of the  class.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.EndPlot
Called by the plotting framework when PlotEngine.EndPlot() has been called by an application.